{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MDQxMzM5NzYiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMjVUMDY6MDY6NDMuMTEwWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzg0MDUxMTYiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMjVUMDY6MjM6MTMuMzAzWiJ9"},"reviews":[{"rating":"STAR_3","review":"I have a series of mixed feelings about Frozen 2. While I walked out with the words \"That could have been so much better\" on my lips, the film was beautiful, and it touched me emotionally to the point that I cried, multiple times. However, the tears were aligned with the power behind the music and animation more than the overall plot.\n\nThe story and the writing were choppy, at best. A lot of the major things that happened didn't make sense the more I thought about them, and seemed to exist for the pure purpose of moving the plot forward. I realize this could be due to the several, excessive rewrites the script went through, but I don't see that as a proper excuse. Rewrites should improve the movie, reduce clutter, and make the overall plot flow better. From my understanding, these rewrites did exactly the opposite.\n\nFor a chunk of the movie, I was so annoyed with Anna's characterization I could hardly focused. Reducing her to a \"bitchy girlfriend\" during Kristoff's proposal scenes, for example, was incredibly bothersome. She became a stereotype of how some men see their girlfriends and wives. It was like watching a crappy, sexist sitcom. I understand it was trying to illustrate Kristoff's poor communication skills, but all it succeeded in doing is making Anna seem like the \"crazy girlfriend\" who constantly made obscure leaps in logic.\n\nIn addition, Anna's clinginess and lack of understanding with her sister's struggle was poorly represented. She seemed pushy and annoying. I realize they were trying to illustrate her codependency, but for most of the film, it was less relatable or understandable or even \"charming\" and more... toxic. The first movie had her characterized as someone who actually cared and wanted to understand Elsa. She listened, and was maybe a little selfish, but not nearly to this extent. If I was in Elsa's shoes, I'd push her away, too, in a heartbeat. There's a difference between listening to someone, and in forcing them to say what you want to hear for your sake. I will fully admit I always liked Elsa better, but the writers snatched Anna's kindness and quirkiness for this film, and it was largely a mistake.\n\nThe overall plot with the river and the magic was clunky, too. For example, why would Elsa's mother do such a poor job of raising her to use her powers if she, in fact, was so aware of magic? The first movie portrayed Elsa's parents as people who could not understand her magical abilities, and they did their best to help her control them, even if their approach was ultimately detrimental. Introducing the concept of her mother understanding magic makes her actions in the first film - or at least her compliance with Elsa's father's approach - incredibly confusing and, frankly, upsetting.\n\nThe film also has so many characters deliver very minor impact to the story as a whole. What was the purpose of Kristoff's friend, for example? They seemed to have a real connection with the reindeer thing. I thought it was going somewhere! And there was absolutely no payoff. The same goes for Elsa's friend - the one who helped CONVINCE HER TO STAY in the woods. Why didn't they build on that relationship more? It would have been so easy. Even Kristoff's overall role confounded me. He was a great McGuffin, sure, but his emotional impact and influence on other characters was minimal.\n\nAs a whole, I enjoyed Elsa's journey in this one. I loved that she expressed a desire to leave Arrendell, but an uncertainty with her ability to. She knows what she wants, and even what's best for her, but she's held back by her responsibilities, as she always has been. I empathize with that heavily. I wish that would have been explored more, and I don't think it would've been hard to do. Show the pains of being a person with magical abilities in a town that accepts it but doesn't understand it. And being a QUEEN in that town, nonetheless. Give us a reason to understand why she wants more. Elsa is not interested in power - we've seen that from the beginning. She's only interested in being understood. Making that more apparent in the plot instead of solely throwing it into a musical number would not be a challenge to write.\n\nAll of that being said, I adored parts of this film. All of Elsa's songs and Anna's last song both hit me hard. I understood where the characters were coming from, and I largely empathized with them. Elsa's transformation into being her own person was flawless in the musical number. I cried when she let her hair down, because the symbolism was so damn strong. Elsa breaking the magical water horse was beyond cool to watch. And I have to say - Idana Menzel worked HARD for the singing portions. Her voice never fails to give me chills.\n\nIn addition, Anna's song about feeling defeated and taking things one step at a time… gave me chills. We've all experienced a dark place like that. If you haven't, count your blessings! It was relatable, and I finally started to feel for her as a character, even if her overlooking of Kristoff during the sequence was a little bothersome. She sang about moving forward, even when it's impossible, through whatever effort you can expend at the time. Kristen Bell's performance was emotional, heartbreaking, and inspiring all at once.\n\nMeanwhile Kristoff's 80's Power Ballad-... Whoof. I don't know if I've ever seen something look so out of place in an animated film before. The song was a solid parody, but it didn't belong in this movie. It belongs in a show like Crazy Ex-Girlfriend, and because of that, it completely took me out of the film. I spent the entire sequence waiting for it to end. I almost didn't want to look at the screen out of embarrassment.\n\nAnd speaking of out of place sequences, the \"film reel\" in the cave Elsa found briefly took me out of the film. I would have much rather seen solely the ice/snow memories than… whatever that was. But I came back to the movie quickly because of Elsa's song and raw emotional power.\n\nSince I'm apparently back to the negative, I also had a problem with there not being any sort of villain in this movie. Don't get me wrong - I love moral grayness and uncertainty. But Disney's animated films HEAVILY rely on the importance, strength, and badassery of its villains. There were several villainous characters in the first Frozen film, and I loved watching them do their thing! I found myself missing a character to properly loathe/love (but ultimately admire).\n\nUltimately, I had a very fun time with Frozen 2. Elsa's journey was extremely relatable. Finding yourself and accepting yourself is something she went through in the first film, but at the end, she was pulled back into a role she was never suited for. I loved seeing her find a greater version of this internal acceptance and a solid purpose for herself on top of it all. She found her people, finally. It was touching, it was relatable, and I'm so, so happy for her. The line \"You are the one you've been waiting for.\" will stick with me for a long, long time. Maybe more than \"I belong here. Alone. Where I can be who I am without hurting anybody.\" from the first movie.\n\nI would highly recommend watching this film if you have any interest in animation or theatrical music. In these places, it certainly excelled. Take the film with a grain of salt, like I did, and you'll end up having a great time. This I can guarantee.","displayName":"J M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":true,"createDate":"2019-11-25T06:23:13.303Z","updateDate":"2019-11-25T06:23:25.749Z","user":{"userId":"978405116","realm":"RT","displayName":"J M","accountLink":"/user/id/978405116"},"score":3,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_5","review":"I wasnt very excited at first ... I dont really like sequels but this movie while SO DIFFERENT than the first I liked it a lot! They touched on relative issues and I was so thankful!","displayName":"Danielle","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T06:21:08.424Z","updateDate":"2019-11-25T06:21:08.424Z","user":{"userId":"997e18f4-163a-456e-8f17-191044d0cdfc","realm":"Fandango","displayName":"Danielle","accountLink":null},"score":5,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_5","review":"I actually didn't like it the first time watching. Perhaps it's because I sat next to crying children and was in a subpar movie theater where half the speakers weren't working (this was a very big issue for a movie that relied on its music). But the second time through (in a better cinema) I appreciated it way more and the previous gripes I had didn't bother me as much. I liked the story and though I wish they fleshed it out more instead of relying on comedy, I realized how much fun the movie truly was and how much I still enjoy the franchise. The songs were admittingly better and far more memorable in the first movie but this one had enjoyable tunes and I believe they're complicated enough so you won't hear kids trying to cover them too often. First time viewing I would rate a 3.5 but second time through focusing on more of the details and what I enjoyed about the characters I would rate it a 4.5/5. Go ahead a watch for yourselfs and preferably sit away from annoying audience members.","displayName":"Danison G","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T06:19:43.563Z","updateDate":"2019-11-25T06:19:43.563Z","user":{"userId":"977011494","realm":"RT","displayName":"Danison G","accountLink":"/user/id/977011494"},"score":5,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_5","review":"Great movie for adults and kids.  IMAX experience awesome.","displayName":"Sylvia","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T06:17:52.558Z","updateDate":"2019-11-25T06:19:48.198Z","user":{"userId":"92610256-4156-49ec-b96f-afecbae3343e","realm":"Fandango","displayName":"Sylvia","accountLink":null},"score":5,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_5","review":"The movie was everything you would expect from Disney and more.  In many ways it was better than the first and explained where Elsas powers came from and the strength that love can give you.","displayName":"Claudia M","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T06:17:33.776Z","updateDate":"2019-11-25T06:17:33.953Z","user":{"userId":"d5916d3c-bf23-4cd6-b3a0-21606bc22c80","realm":"Fandango","displayName":"Claudia M","accountLink":null},"score":5,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_5","review":"3rd time watching it and we still LOVE it!","displayName":"Yadira","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T06:16:27.871Z","updateDate":"2019-12-16T03:58:04.104Z","user":{"userId":"5F02A4C1-1C56-4442-AE7C-9A94DDE42C43","realm":"Fandango","displayName":"Yadira","accountLink":null},"score":5,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_5","review":"I took my grandson to watch the movie. It wad really good. Well directed & graphics were good. Also made us laugh in some parts. Would recommend others to watch.","displayName":"Francisco","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T06:14:47.849Z","updateDate":"2019-11-25T06:14:47.849Z","user":{"userId":"de101c69-4dbc-4c1e-8756-71bacfc4db75","realm":"Fandango","displayName":"Francisco","accountLink":null},"score":5,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_4_5","review":"Perfectly cute in every way","displayName":"Taylor","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T06:08:48.283Z","updateDate":"2019-11-25T06:08:48.283Z","user":{"userId":"6b762a93-0a5b-45f7-a011-619be1a6a8a7","realm":"Fandango","displayName":"Taylor","accountLink":null},"score":4.5,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_5","review":"I was wondering if Disney would pull this off and make it just as good as the first one but they managed to make Frozen II even better.","displayName":"Elizabeth L","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T06:08:13.084Z","updateDate":"2019-11-25T06:08:13.084Z","user":{"userId":"44BD5449-5282-4CEE-BBB5-B03841AFED70","realm":"Fandango","displayName":"Elizabeth L","accountLink":null},"score":5,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_5","review":"I loved this movie. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T06:06:43.110Z","updateDate":"2019-11-25T06:06:43.110Z","user":{"userId":"904133976","realm":"RT","displayName":null,"accountLink":"/user/id/904133976"},"score":5,"timeFromCreation":"Nov 25, 2019"}]}