{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzc3ODczNzkiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMjVUMTA6MDI6MTkuMTYyWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb19lYWMyNjljYy1kZDdjLTQzNTMtYTg0ZS1iZTA2ZWY1ZTAzZTkiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMjVUMTA6NDU6MjMuMjY3WiJ9"},"reviews":[{"rating":"STAR_5","review":"Terrific for the kids.  Catchy songs again.  The storyline is engaging and entertaining as well as ties back to the first movie.","displayName":"Anthony P","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T10:45:23.267Z","updateDate":"2019-11-25T10:45:23.267Z","user":{"userId":"eac269cc-dd7c-4353-a84e-be06ef5e03e9","realm":"Fandango","displayName":"Anthony P","accountLink":null},"score":5,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_5","review":"visually stunning, storyline was engaging, songs were gorgeous","displayName":"momof3","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T10:40:55.742Z","updateDate":"2019-11-25T10:40:55.742Z","user":{"userId":"8ccdf251-e141-4584-923f-5ebc0dd0fa84","realm":"Fandango","displayName":"momof3","accountLink":null},"score":5,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_5","review":"I thought it was much better than the first one!!  I took my 3 yr old granddaughter.","displayName":"Margarita S","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T10:38:58.801Z","updateDate":"2019-11-25T10:38:58.801Z","user":{"userId":"7eb490c5-82b8-4a11-97ec-5b0e6219c346","realm":"Fandango","displayName":"Margarita S","accountLink":null},"score":5,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_5","review":"Excellent Olaf ! When is the Olaf movie? :)","displayName":"Dawn","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T10:30:13.969Z","updateDate":"2019-11-25T10:30:13.969Z","user":{"userId":"bd572fcd-e9d1-4cd4-95b0-5a5ccb83e7a8","realm":"Fandango","displayName":"Dawn","accountLink":null},"score":5,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_4","review":"The story was great, very entertaining to adults and children alike. There were many meaningful moments and the picture was beautiful. We loved everything about it- except the music, but its hard to strike gold in the same place twice.","displayName":"Amber","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T10:27:44.625Z","updateDate":"2019-11-25T10:27:44.625Z","user":{"userId":"ca7e79a8-655c-4ec3-8931-194a9b56315e","realm":"Fandango","displayName":"Amber","accountLink":null},"score":4,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_5","review":"Completely awesome in every respect.","displayName":"Nathaniel Z","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T10:24:36.101Z","updateDate":"2019-11-25T10:24:36.101Z","user":{"userId":"e61621fd-fc7a-436e-ba16-bf5d2bb95e08","realm":"Fandango","displayName":"Nathaniel Z","accountLink":null},"score":5,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_5","review":"I loved it way more than the first. More songs (all but one good, and that one was so cheezy its good), humor really worked for me, characters while not growing did go through some drama and the way they persevere reinforced why I liked them, and so many allusions to history and current events that really had my mind racing.\n\nThere were somethings that I didnt like, lots actually, but whats good was so good (for me) that  it warrants a 5 star rating. \n\nThat said, SPOILERS as I go over what loved, and what kinda fell flat:\n\n1. Child death- Olaf is now 3 years old, he plays with the children, won't shut up on long car rides, and sings a song about how all the things he doesn't get will make sense when he's older; that is to say, he is very much a child, and disney killed his ass in this movie.\n\n2. Grief- after dying in her arms Ana grieves for both Olaf and her sister. Shes in a dark cave, in the fetal position, at her lowest point and sings a very dark song where she goes from wanting to \"succumb to the darkness\" (suicide) to having to move forward step by step. These small steps become giant leaps over jagged rocks which I'm sure is what resuming normal life after the passing of loved ones is like. Watching it, I felt nervous for her, thinking about it, I went from really resonating with her pain at the beginning to really respecting her fortitude, to straight up rooting for her.\n\n3. Elsa's transformation - everyone was enjoying their post happily ever after life but Elsa who feels called to a different sort of life free from the trappings of being matriarch of her subjects, boring job, vanilla home life, etc. Where princesses before had this half baked sense of \"I want more...\" the subtext for else was clear, she's in the closet and wants out. Her first song exploring that starts with her \"hearing a voice\" (getting a text) straight up telling that voice \"leave me alone\" and \"I got commitments\" but as it goes on she drawn more and more by the allure and mystery and as the song builds to a climax she bursts out of her home, foists herself up on the banister in a silk nighty, bites her lip, hits a high note, and frosts the entire city. Later Elsa talks with some girl, on the surface its for exposition, but since this is the first bonding moment she's had with someone one on one besides her sister, it felt intimate. I didn't think this was deep, very on the nose, and I was even a little judgemental about how she endangered others, pushed them away, abdicated responsibility for personal satisfaction but it was still engaging in the way that celebrity gossip or steamy romance novels hook you.\n\n4. Dealing with the legacy of colonialism- Ana and Elsa's grandfather built monuments on native land, slayed their chief, and suprise attacked their people. Arondale since prospered partly because of this. This is their grand father and their founding father and they instantly despise him (wish there was more ambiguity in there feelings but) more interestingly, Ana destroys the dam knowing Arondale would be destroyed in the ensuing flood (no civilian casualties, guaranteed, but still). Imagine destroying Mt. Rushmore and bankrupting the country to payback those who were exploited to enrich it. We struggle to take down 1 confederate monument, they literally doomed their city, most Disney films try to teach kids something, this one felt aimed society in this respect.\n\n5. Climate change- the native North Aldran's whole \"living in harmony with nature\" felt cliche but it lead to fire fight reminiscent of the California wildfires. The fire fight was cool and the reference was interesting, and Ana's line to Elsa about \"running into fire\" after and its perfect delivery it justified everything, even that dumb ass lizard.\n\n6. repeating the past- The soldiers and natives are stuck in a fog (literally) and not sure why they are fighting. Good obvious metaphor disney, make those kids feel smart when they figure it out in the 5th grade.\n\n7. Soldier- that main soldier guy was a cool character. He'd been stationed far from home, still carrying a torch for an old flame, Ana tells him she's still single, hes like, \"why does that make me feel worse?\" says so much about his character and was so endearing. He later learns he was given unjust orders and must do something seemingly unpatriotic that could also get him killed. The look and body language show's he's shaken, hurt, and then summoning the strength to soldier on, then beats his sword on his shield for one last battle.\n\nLets talking about the ending. Disney didnt shy away from the darkness in this movie, but it did undo all the bad things that happened, deux ex machina'ed the shit out of everything, and gave everyone and even happier ending. There was some bitter to go with the sweet in that Ana and Elsa no longer live together, but they still see eachother on weekends (I was literally releived when they specified that) but besides that, ridiculously ludicrously happy ending. I liked these characters and wanted them to have the happy ending so I was satisfied, but Normally this would feel forced and I get why people dont respect this ending. The character deaths that seemed so final were retconned, the town that was gonna get destroyed didn't, peace between societies was achieved in like a day, and climate change was solved. But disney was so explicit with the darkness and consequences and stakes throughout the movie, that I didn't need a dark ending to know how it would go down. I could see exactly how that would have played out so clearly I feel like I got both endings in like a multiverse kinda way, but I'm glad the happy one is canon. For those of you who need a dark ending to feel the movie was worth it, forget the ending you saw and accept this false memory implant as my gift to you:\n\nChristof dies in forest fire, someone gives Ana his ring and she laments the happily ever after she'll never have with him now. Elsa still becomes the fifth element, but rather than freeze, she ascends to a higher plane of being to assume this role and is affectively dead (sorta like Sokka's first gf becoming the moon), Olaf still dies (and stays dead), Ana still does her plan with the dam, the soldiers perish bravely against the golems, their sacrifice allows Ana to survives though the injuries she sustains cripple her. Arondale is washed away, which some of its citizens are inclined to blame on the North Aldrans even after Ana and the stone trolls left in charge try to talk sense into them. Cut too 45 years later, Arondale is rebuilt, but more in harmony with nature. Ana is old and walks with a cane, never married but wearing Christoff's ring. Clearly both she and the town have kept going doing the next right thing or however the song goes. She watches some kids build a snowman, sighs. Relations with the North Aldra are normalized and on equal footing, in a joint excursion, they take her to that cave where Elsa ascended. Its sacred to them and off limits to Arondale, but Ana is welcome as Elsa was her sister and she asked nicely. Ana pays her respects. Fade to black and we hear that voice Elsa heard one more time.\n\nKnowing that is what could have happened makes me all the more appreciative it worked out the way it did. Even if those elementals are kinda dumb and Christoff had nothing to do, and Olaf was grating, ect. I like these guys, I'm glad disney let them eat cake.","displayName":"Rob W","displayImageUrl":"https://graph.facebook.com/v3.3/2324080497920620/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":true,"createDate":"2019-11-25T10:24:04.959Z","updateDate":"2019-11-25T10:24:15.572Z","user":{"userId":"978168248","realm":"RT","displayName":"Rob W","accountLink":"/user/id/978168248"},"score":5,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_3","review":"The storyline was ok.  Could have been better.","displayName":"Lisa S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T10:11:25.472Z","updateDate":"2019-11-25T10:11:25.472Z","user":{"userId":"3e127b40-aac5-4443-afce-af466e42f05b","realm":"Fandango","displayName":"Lisa S","accountLink":null},"score":3,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_2","review":"I rather enjoyed the first offering, catchy songs, engaging storyline, likeable characters and most importantly rememberable... Frozen 2, however, manages to destroy any lasting memories of the original. The film is below average at best and will drift away into the void of DVD bargain buys after its initial release. The kids kinda' enjoyed it, hence the 2 stars","displayName":"Alan S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T10:08:18.079Z","updateDate":"2019-11-25T10:08:52.761Z","user":{"userId":"978405284","realm":"RT","displayName":"Alan S","accountLink":"/user/id/978405284"},"score":2,"timeFromCreation":"Nov 25, 2019"},{"rating":"STAR_5","review":"I absolutely loved frozen 2! The songs! The storyline! I personally loved it more than the original.","displayName":"Annette20 V","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-25T10:02:19.162Z","updateDate":"2019-11-25T10:02:23.477Z","user":{"userId":"977787379","realm":"RT","displayName":"Annette20 V","accountLink":"/user/id/977787379"},"score":5,"timeFromCreation":"Nov 25, 2019"}]}