{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb19jMTFhNmY5OS0wOWFjLTQ5MjktYjE0My1mYmY4NDg0OWRjMmMiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMjJUMTA6Mjg6MzIuNjM1WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb182NUM2RUY3OC02OEI2LTQwMUYtQUFENS05RTJGNTIyQkZGREEiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMjJUMTE6Mzk6MzAuOTQ5WiJ9"},"reviews":[{"rating":"STAR_2_5","review":"I left the theater disappointed. It was appealing to the eyes but not to the ears. The music sucked compared to the music from the first one. This storyline needed more from the supporting characters and a little less Elsa.","displayName":"MominTX4","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-22T11:39:30.949Z","updateDate":"2019-11-22T11:39:30.949Z","user":{"userId":"65C6EF78-68B6-401F-AAD5-9E2F522BFFDA","realm":"Fandango","displayName":"MominTX4","accountLink":null},"score":2.5,"timeFromCreation":"Nov 22, 2019"},{"rating":"STAR_5","review":"It was a wonderful movie that continued the relationship of the sisters Elsa and Anna in a beautiful way. As well as keeping Kristoff and Anna's relationship strong. I'm very happy that the movie was still about Elsa and Anna above all else and I think it really helped it shine. Also the ending was an amazing point for the sisters' relationship to reach. It was beautiful seeing them be connected in such a cool way. Watch this movie is you haven't and please don't be spoiled it is on par with the first movie as the best movie I've ever seen.","displayName":"Aurelia G","displayImageUrl":"https://graph.facebook.com/v3.3/484292701929725/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-22T11:28:23.813Z","updateDate":"2019-11-22T11:28:53.894Z","user":{"userId":"976755627","realm":"RT","displayName":"Aurelia G","accountLink":"/user/id/976755627"},"score":5,"timeFromCreation":"Nov 22, 2019"},{"rating":"STAR_4_5","review":"It certainly is a good movie. Disney was able to come up with a decent follow up to the original. The female characters very well done and neither Elsa nor Anna feel like they are MarySues. The film will probably be a bit too deep for younger audiences. I took my daughter to see it and she got some what restless partway through. It's still good for kids though. Darker in tone but still very family friendly.","displayName":"Kyle D","displayImageUrl":"https://graph.facebook.com/v3.3/1888935737889179/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-22T11:00:33.957Z","updateDate":"2019-11-22T11:00:39.268Z","user":{"userId":"977569203","realm":"RT","displayName":"Kyle D","accountLink":"/user/id/977569203"},"score":4.5,"timeFromCreation":"Nov 22, 2019"},{"rating":"STAR_4","review":"So darn dramatic but always difficult for a sequel to live up to the standard of the original especially for an animated film, but hits the feels and explains a lot about their parents and the origin of Elsa’s powers","displayName":"Jon","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-22T10:55:26.624Z","updateDate":"2019-11-22T10:55:26.624Z","user":{"userId":"C762A4D6-A5CD-47A3-9F91-97CB27DE1503","realm":"Fandango","displayName":"Jon","accountLink":null},"score":4,"timeFromCreation":"Nov 22, 2019"},{"rating":"STAR_5","review":"I loved the movie. I don't think has to be a villain to be dramatic. I just feel it's very profound, especially because of Elsa she doubt her capacity and Anna ground her thought. For me, one of the best parts is when Anna says to Elsa ... I would like you to see yourself as I see you. This was so powerful. I just love the movie.","displayName":"Tais A","displayImageUrl":"https://graph.facebook.com/v3.3/10208445948346838/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-22T10:50:05.791Z","updateDate":"2019-11-22T10:50:12.804Z","user":{"userId":"976883351","realm":"RT","displayName":"Tais A","accountLink":"/user/id/976883351"},"score":5,"timeFromCreation":"Nov 22, 2019"},{"rating":"STAR_5","review":"any sequel that can keep up with first is a 5 star","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-22T10:45:46.491Z","updateDate":"2019-11-22T10:45:46.491Z","user":{"userId":"905893118","realm":"RT","displayName":null,"accountLink":"/user/id/905893118"},"score":5,"timeFromCreation":"Nov 22, 2019"},{"rating":"STAR_5","review":"I throughly enjoyed it! Yes this movie was created because if the financial success of its predecessor. But this isn't your average Disney sequel that's pushed out to make extra money. This was very well thought out and it was given a lot of love and it shows. The plot I think was simple enough for children but complex enough to keep the adult viewers interested. I really love this movie so much. My only complaint is Olaf. Olaf is the worst character in these movies, I understand he's supposed to be the comical relief but it just ends up coming off as really annoying and it sometimes takes away from some really beautiful parts in the movie.","displayName":"Sierra W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-22T10:45:33.555Z","updateDate":"2019-11-22T10:45:33.555Z","user":{"userId":"978400362","realm":"RT","displayName":"Sierra W","accountLink":"/user/id/978400362"},"score":5,"timeFromCreation":"Nov 22, 2019"},{"rating":"STAR_5","review":"Extremely. Enjoyable","displayName":"D L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-22T10:43:59.767Z","updateDate":"2019-11-22T10:44:05.613Z","user":{"userId":"978400365","realm":"RT","displayName":"D L","accountLink":"/user/id/978400365"},"score":5,"timeFromCreation":"Nov 22, 2019"},{"rating":"STAR_4","review":"Desde el principio quieren despertar los recuerdos del éxito de la primera entrega, desde canciones y frases que te transportan al primer gran éxito, repitiendo la ternura de la niñez de las hermanas hasta el gran amor que construyeron a lo largo de 3 años.\n\nEl primer gran error que note fue la cantidad de información que Disney mostró en sus avances, desde escenas completas, hasta la parte mas divertida o épica de la historia, interrumpiendo la emoción de dicho momento. \nY ni hablar de la canción principal \"into the unknown\" que seria el nuevo \"let it go\" de la película. Creo que debieron confiar en sus seguidores y en su éxito para vivir la emoción por primera vez tal y como paso con todas las canciones de frozen 1.\n\nY ya que tocamos el tema de las canciones, creo que son buenas y muy elaboradas. Para los que saben de música, si llegamos a descomponerlas podríamos notar alguna similitud con \"las puertas del amor\", \"y si hacemos un muñeco\" pero también las combinan con arreglos que suelen hacerse en musicales de Broadway, que por cierto, no esta nada mal, pero estoy casi segura que esa decisión hizo que no salgamos del cine queriendo cantar todas las canciones de frozen 2.\n\nPor otro lado la historia fue mucho más elaborada y oscura, donde Olaf era quien salvaba las partes divertidas y kristoff  hace el intento de sacarnos risas. \n\nSe sienten algunos huecos argumentales que nos desubican en un instante, ya sea porque los personajes saltan muy rápido una situacion y el espectador no tiene tiempo para procesarlo o porque la historia necesitaba mas tiempo para ser contada. \n\nY si todos estos aspectos podrían desanimarnos a ver la película, creo que deberían ir a verla de todas formas y guardarse todas las emociones para el momento. \nLo que más me gusto fueron los mensajes. Que son bastante avanzados para que lo entienda un niño, pero  Disney siempre a tenido esa especialidad de enseñarnos algo nuevo tengas la edad que tengas.\n\nEl personaje que más me sorprendió fue Elsa, es el personaje que se a desarrollado más desde la primera entrega, y se muestra más de su personalidad curiosa y con ganas de descubrir su propósito.\n\nDisfruté mucho la película y me hubiera encantado verla sin fresca, es decir, sin ningún adelanto, trailers, post que mostraron. Pienso q fue lo que no me dejo disfrutarla por completo.","displayName":"Monica S","displayImageUrl":"https://graph.facebook.com/v3.3/10219176455549560/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-22T10:36:40.084Z","updateDate":"2019-11-22T10:44:19.626Z","user":{"userId":"978400358","realm":"RT","displayName":"Monica S","accountLink":"/user/id/978400358"},"score":4,"timeFromCreation":"Nov 22, 2019"},{"rating":"STAR_5","review":"Watched the movie expecting to see a bunch of what Hollywood has been pushing, to my happy surprise, nothing of that. This was a good musical where they answer a bunch of questions, mainly if Tarzan is related to Elsa & Anna. I wont spoil that one for you. The musical numbers arent as great as the last one, but that just means that this one wont cause song tumors, something this movie even makes fun of a little. This movie had character development that showed each character has made progress in the time since the first one.","displayName":"Bobby","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-22T10:28:32.635Z","updateDate":"2019-11-22T10:28:32.635Z","user":{"userId":"c11a6f99-09ac-4929-b143-fbf84849dc2c","realm":"Fandango","displayName":"Bobby","accountLink":null},"score":5,"timeFromCreation":"Nov 22, 2019"}]}