{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzg0MTY2MzUiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMDNUMDU6NTg6NDMuMTUwWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb18wQTYwRjE1MC0yMEEzLTQwNjUtODNBRS0xOTBEMUE2RTZDQjEiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMDNUMDc6MDk6MzIuNjY1WiJ9"},"reviews":[{"rating":"STAR_5","review":"I loved the treatment and shade to Hans.","displayName":"JoAnna","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-03T07:09:32.665Z","updateDate":"2019-12-03T07:09:32.665Z","user":{"userId":"0A60F150-20A3-4065-83AE-190D1A6E6CB1","realm":"Fandango","displayName":"JoAnna","accountLink":null},"score":5,"timeFromCreation":"Dec 03, 2019"},{"rating":"STAR_5","review":"different from the first movie in a good way! loved all the new songs!","displayName":"Victoria","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-03T06:51:09.091Z","updateDate":"2019-12-03T06:51:09.091Z","user":{"userId":"e677af0c-7840-4c95-a83f-77f10774e67c","realm":"Fandango","displayName":"Victoria","accountLink":null},"score":5,"timeFromCreation":"Dec 03, 2019"},{"rating":"STAR_5","review":"really good movie. honestly really loved it. great family film","displayName":"A.E","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-03T06:39:50.798Z","updateDate":"2019-12-03T06:39:50.798Z","user":{"userId":"A6B33AA9-E1CE-4893-B147-759FB4C24E26","realm":"Fandango","displayName":"A.E","accountLink":null},"score":5,"timeFromCreation":"Dec 03, 2019"},{"rating":"STAR_5","review":"Amazing.Our family all like it.","displayName":"Regina","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-03T06:26:46.291Z","updateDate":"2019-12-03T06:26:46.291Z","user":{"userId":"2c00a2ca-9981-40ca-9e2f-8e321e4e36b1","realm":"Fandango","displayName":"Regina","accountLink":null},"score":5,"timeFromCreation":"Dec 03, 2019"},{"rating":"STAR_4","review":"There was to much drama that relates to a older crowd, the ending was wonderful and there was touching moments but I feel there where inappropriate depth to some of the relationship drama and would have enjoyed even more to just focus on the dream not the drama","displayName":"Diamond","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-03T06:20:22.467Z","updateDate":"2019-12-03T06:20:22.467Z","user":{"userId":"a10d18a7-c747-4721-98cd-65dd92b75758","realm":"Fandango","displayName":"Diamond","accountLink":null},"score":4,"timeFromCreation":"Dec 03, 2019"},{"rating":"STAR_5","review":"Amazing music!! Beautiful storyline. Loved it so much!! For kids of all ages","displayName":"Sarah","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-03T06:11:20.662Z","updateDate":"2019-12-03T06:11:22.399Z","user":{"userId":"449e6bba-64aa-46d7-80bd-1d9d987dc4cd","realm":"Fandango","displayName":"Sarah","accountLink":null},"score":5,"timeFromCreation":"Dec 03, 2019"},{"rating":"STAR_4","review":"Super cute, catchy tunes.  Good story reinforcing working together, family and girl power.\nNot as good as original.","displayName":"Rosie","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-03T06:07:43.186Z","updateDate":"2019-12-03T06:07:43.186Z","user":{"userId":"46cd5e9c-3e00-4aea-8161-062c64b1b5da","realm":"Fandango","displayName":"Rosie","accountLink":null},"score":4,"timeFromCreation":"Dec 03, 2019"},{"rating":"STAR_3_5","review":"I like this movie. It didnt have as much action and singing as the first one. Its good for children under 12.","displayName":"Cheryl","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-03T06:04:52.319Z","updateDate":"2019-12-03T06:04:53.830Z","user":{"userId":"733b892c-842c-4bcc-966b-918d2cd4b620","realm":"Fandango","displayName":"Cheryl","accountLink":null},"score":3.5,"timeFromCreation":"Dec 03, 2019"},{"rating":"STAR_5","review":"wonderful show. my wife cried my daughter laughed... ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-03T06:04:42.478Z","updateDate":"2019-12-03T06:04:42.478Z","user":{"userId":"933494453","realm":"RT","displayName":null,"accountLink":"/user/id/933494453"},"score":5,"timeFromCreation":"Dec 03, 2019"},{"rating":"STAR_5","review":"Better than its predecessor in every way, Frozen 2 stuns with awe-striking animation, a surprisingly serious plot, and both a message and a soundtrack that are every bit as memorable as the original's with twice the heart and ten times the depth. Young audiences will be swept away in the grandiosity of the storytelling and will surely be taken by Olaf's uncharacteristically endearing comic relief, and older audiences are sure to note that the narrative has matured considerably since Frozen 1, six long years ago. \n\nJust as the original had, Frozen 2 pits royal sisters Elsa and Anna against conflicts both external and internal; as with the first film, the external problems relate to international relations, whereas the internal problems are more attuned to the characters' need to overcome their own insecurities and personal failings. The scope, however, is broadened greatly - in many, many ways, the film reads less like a children's movie and more like an epic fantasy story that just happens to include a naïve talking snowman and a family-friendly veneer. Indeed, to call Frozen 2 a \"children's movie\" would be incredibly reductive, as audiences of all ages will find more than enough to love. Allusions to real-world problems are many, and the film doesn't shy away from depicting the harsh reality of colonialism (via the Northuldra, a strikingly authentic representation of Northern Europe's indigenous Sámi peoples) and the ever-more-relevant need for environmental responsibility. The gravity of its central conflicts are aided greatly by the excellent score, as well as the brilliant songwriting, courtesy of returning songsmiths Kristen Anderson-Lopez and Robert Lopez. \n\nSmartly taking cues from musical theatre, the film weaves its songs into the film's plotline. This is a trait it shares with the original, but where most the first film's songs are punctuated by ill-fitting jokes and transparently referential lyrics, the sequel's soundtrack (usually) remains as serious as the plot and speaks in broader language, equally suitable for the storyline as for a listener's own life. This new, more mature approach makes the songs' more dramatic moments pay off in ways the first film couldn't begin to reach, particularly in Elsa's \"Show Yourself\" and Anna's \"The Next Right Thing\". Moments of levity are reserved for (of course) Olaf, although Kristoff's 80s-inspired power ballad leans into its cheesiness to offer a moment of well-needed lightness even during a sincerely emotional scene with the character. This is one of the greater factors in the movie's excellent pacing; adults may notice more nuance in the songs' parallels to the characters' arcs, but even young viewers with less of a sense for subtlety are sure to appreciate the high standard of quality that allows the varied soundtrack to carry the film through its nearly two-hour runtime. \n\nThat same quality standard is present in the other areas, too - the original film was (deservedly) lauded for its gorgeous visuals and clever writing, but it's genuinely mind-blowing to see how far the studio has come in less than a decade. For returning heroes Anna, Elsa and Kristoff this means facial expressions, body language and dialogue as thoughtful and realistic as a human actor's; for newcomers like Ryder, Mattias and the especially lovable Honeymaren, this means far greater depth and sincerity than was afforded to any side character in the original (here's looking at you, Duke of Weselton). \n\nThe last factor worth noting is one whose details I'll elide for the sake of anyone who hasn't yet seen the film: there is no villain. Certain characters are seen to perform villainous (or at least antagonistic) acts, but the black-and-white morality that characterizes so many similar films (including the original Frozen, of course) is nowhere to be found. Rather, the conflicts are complex and tied to characters' own sense of right and wrong. Appropriately, their solutions aren't as simple as \"bring the bad guy to justice\". Instead, characters are faced with terrible choices, and the film's greatest moral can be summed up thusly: sometimes, doing what's right means immense self-sacrifice. Maybe it's too heady for child viewers - I wouldn't know, I haven't been a child for a while - but I really don't think so. The same moral is found on a smaller scale in plenty of animated features; Frozen 2 simply has the confidence to commit fully to it, and the writing to back it up. \n\nThe bottom line: see this movie. 2013's Frozen was undoubtedly one of Disney's best, but with Frozen 2 they've far eclipsed it. Even from an avowed non-Disney fan, it's clear to see that this is far more than a cash-cow sequel, far more than Oscar-baiting kids' fare and far, far more than a run-of-the-mill Disney musical: Frozen 2 is real art.","displayName":"Jack  U","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-03T05:58:43.150Z","updateDate":"2019-12-03T05:58:43.150Z","user":{"userId":"978416635","realm":"RT","displayName":"Jack  U","accountLink":"/user/id/978416635"},"score":5,"timeFromCreation":"Dec 03, 2019"}]}