{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb181NkMwQTgxQi0zRUNELTRBQjEtQTE2OC1BRjUzQTJGQ0IwQzEiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMzBUMTU6MDY6MjkuMDIxWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzc2MDAwNzUiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMzBUMTU6NDk6MzAuNzUwWiJ9"},"reviews":[{"rating":"STAR_4","review":"frozen 2\n\n2019\nU\ndirector: Chris Buck and Jennifer Lee\nstarring: Idina Menzel,Kristen Bell,Jonathan Groff,Josh Gad,Sterling K brown, Evan Rachel wood etc\n\noverall rating 84/100\n\nFrozen 2 is based around a voice that Elsa  ( Idina Menzel) can hear. So When it becomes to much for her to handle. She embarks on a journey with her sister Anna ( Kristen Bell), Christoff ( Jonathan Groff) and Olaf ( Josh Gad) as they embark on a journey to find the origins of Elsa's powers and secrets about there parents life's and with some fresh faces along the way. I was not expecting for frozen 2 to be as good as it was i rarely say a sequel is better then the first film but in this case i feel differently, lets talk about why this is.\n\nFirst of all the animation was fantastic. And the film was very funny. Wow the film looked absolutely stunning. They really paid loads of attention to the fine details within the film. Showing how far animation has come in 6 years. All the characters looked like real people. And the locations both new and old looked beautiful and really made for great world building. And secondly the films humour was fantastic and very clever. There was a lot of great slapstick gags and running gags throughout the film regarding some songs and Christoff's character. But the character that bought the most amount of humour for me would be Olaf. Josh Gad was fantastic and was given a very clever script to read off. Olaf was so random which was hilarious. And he always made light of awkward situations which is what the film needed. And he bought one of the best scenes of the movie when he reanacted the first film.\n\nMy next positives would be the voice acting and for the most part the soundtrack. The voice acting from everyone was fantastic. All the characters had fantastic scripts and were delivered perfectly by the actors. And all there singing voices were fantastic as well. And the songs were for the most part very good. I didn't think any of the soundtrack would match the first film but i was mostly proven wrong. There was still some very funny and powerful songs here into the unknown being a fantastic lead single for the film. I do still have to say that the songs didn't quite match the standard of the first film with some weak links within the film compared to all the songs being good in the first film. This is just an observation and not really a criticism as i was expecting them to not be as good anyway.\n\nI do just have two more slight negatives. I thought that there was some dull plot points and a few of the characters were either over or underused. I thought that there was a few parts of the plot that were a bit dull and boring. Due to there being a lack of action throughout the first half and it being more focused on character development. So i wish the film was consistently entertaining throughout. But i understood there focus on the character development and the film very quickly got you invested  again. And finally i thought that Olaf despite being funny was slightly overused and characters like Chrsitoff and some of the newer characters were underused. Yes Olaf was funny but i felt as if he overstayed his welcome slightly. And became irratating in places. So he could of been cut from a few scenes. And Christoff was underused. Yes he had some good humour with Anna and his song. But he was not in half of the film which was a shame. And new characters like Honeymaran (Rachel Mathews) were underused and only given a few scenes therefore making you not connect with there characters as much. \n\nMy next two positives would be that i loved some of the new characters and i loved the films mystery. It was a good decision by the directors to spice it up and to add some new faces to the film and for me it really worked. Characters like Mattias ( Sterling K Brown) and Ryder ( Jason Ritter) bought some great new energy,emotion and humour to the film. And the films mysterious tone was fantastic. The fact that you didn't know what was going to happen or be revealed was really interesting to me. And kept me guessing and entertained throughout the movie. \n\nBut my final big positive for the film would be its fantastic final act. They really went all out for the visuals and exploring Elsa's powers. And the mysterious tone continued throughout as well. Leaving you guessing who would survive. And the ending was very satisfying as well.  Ending the film on a high note.\n\nOverall despite a few questionable character choices and the soundtrack not being quite on par with the first film. Frozen 2 offers a mysterious,thrilling and exciting new adventure. And  is a rare improvement for a sequel which leaves me excited for its hopeful future.","displayName":"Ryan N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-30T15:49:30.750Z","updateDate":"2019-11-30T15:49:32.982Z","user":{"userId":"977600075","realm":"RT","displayName":"Ryan N","accountLink":"/user/id/977600075"},"score":4,"timeFromCreation":"Nov 30, 2019"},{"rating":"STAR_5","review":"ERY NICE!! kids had a blast!!","displayName":"TClaude","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-30T15:47:56.298Z","updateDate":"2019-11-30T15:47:56.298Z","user":{"userId":"E45EE35B-6335-48FD-B56E-F5112FF0699A","realm":"Fandango","displayName":"TClaude","accountLink":null},"score":5,"timeFromCreation":"Nov 30, 2019"},{"rating":"STAR_4","review":"I disliked the Christof singing part. But overall the movie was good.","displayName":"melissa","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-30T15:47:16.680Z","updateDate":"2019-11-30T15:47:16.680Z","user":{"userId":"3C42DD24-8647-4E03-A949-C5AE1A2EA275","realm":"Fandango","displayName":"melissa","accountLink":null},"score":4,"timeFromCreation":"Nov 30, 2019"},{"rating":"STAR_5","review":"Much better music than the first Frozen. better storyline than the first movie. We loved the second frozen.","displayName":"Tanya","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-30T15:46:03.759Z","updateDate":"2019-11-30T15:46:03.759Z","user":{"userId":"C2C9D498-BE77-46C6-B566-5C815ED43278","realm":"Fandango","displayName":"Tanya","accountLink":null},"score":5,"timeFromCreation":"Nov 30, 2019"},{"rating":"STAR_5","review":"Loved it!!! Definitely recommend 💙","displayName":"Camila","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-30T15:40:32.726Z","updateDate":"2019-11-30T15:40:32.726Z","user":{"userId":"E921799D-4E86-43CE-A631-88810AE1F2D3","realm":"Fandango","displayName":"Camila","accountLink":null},"score":5,"timeFromCreation":"Nov 30, 2019"},{"rating":"STAR_4","review":"I liked the first movie better.","displayName":"Tonya","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-30T15:35:11.540Z","updateDate":"2019-11-30T15:35:11.540Z","user":{"userId":"4b4f9bad-4c49-4bbd-89f3-9677d995dc13","realm":"Fandango","displayName":"Tonya","accountLink":null},"score":4,"timeFromCreation":"Nov 30, 2019"},{"rating":"STAR_3","review":"I felt there was more singing then normal. Could have done better with a little more dialogue","displayName":"Amber J","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-30T15:22:35.854Z","updateDate":"2019-11-30T15:22:35.854Z","user":{"userId":"560A9EC3-7205-4D77-A5C0-FAB0CCFC0400","realm":"Fandango","displayName":"Amber J","accountLink":null},"score":3,"timeFromCreation":"Nov 30, 2019"},{"rating":"STAR_0_5","review":"Boring. Not relatable","displayName":"Luisa S","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-30T15:11:05.121Z","updateDate":"2019-11-30T15:11:05.121Z","user":{"userId":"0655E3A1-9EFF-4B20-B0F3-FEEF8DA62E59","realm":"Fandango","displayName":"Luisa S","accountLink":null},"score":0.5,"timeFromCreation":"Nov 30, 2019"},{"rating":"STAR_5","review":"Great story but I have to admit that I wouldnt take my girls to see it when they were little.","displayName":"Christine S","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-30T15:07:34.381Z","updateDate":"2019-11-30T15:07:34.381Z","user":{"userId":"40b08dc1-b9ec-4392-a44f-ab584d4ea057","realm":"Fandango","displayName":"Christine S","accountLink":null},"score":5,"timeFromCreation":"Nov 30, 2019"},{"rating":"STAR_5","review":"I loved it! I will be going to see if again. From the beginning when it came on, when Elsa and Anna parents where telling their life story to the end when Christof proposed. I can't wait until Frozen III comes out!!! The Family and I will be there.","displayName":"Laquanda","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-30T15:06:29.021Z","updateDate":"2019-11-30T15:06:29.021Z","user":{"userId":"56C0A81B-3ECD-4AB1-A168-AF53A2FCB0C1","realm":"Fandango","displayName":"Laquanda","accountLink":null},"score":5,"timeFromCreation":"Nov 30, 2019"}]}