{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MDc1NjE2MzYiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMDdUMjI6MDM6MTYuMTQ3WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb18xNjVDMTM2NS1FQ0Y3LTQ4ODItODBBMC0xRTc2RjQ2MjBFODUiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMDdUMjM6MDI6NDEuNjE0WiJ9"},"reviews":[{"rating":"STAR_5","review":"Cried twice and absolutely love the movie!!!","displayName":"Anna D","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-07T23:02:41.614Z","updateDate":"2019-12-07T23:02:41.614Z","user":{"userId":"165C1365-ECF7-4882-80A0-1E76F4620E85","realm":"Fandango","displayName":"Anna D","accountLink":null},"score":5,"timeFromCreation":"Dec 07, 2019"},{"rating":"STAR_5","review":"I LOVED EVERYTHING!!!!!\nIt was an amazing experience. So much action, adventure , singing.","displayName":"Alyssa Smith","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-07T22:59:36.940Z","updateDate":"2019-12-07T22:59:36.940Z","user":{"userId":"720200D1-0ACD-4D4F-804B-C2DD0C215ECE","realm":"Fandango","displayName":"Alyssa Smith","accountLink":null},"score":5,"timeFromCreation":"Dec 07, 2019"},{"rating":"STAR_3","review":"first one was good because of the struggle of self, family, love & duty. This seemed on the border of, nature good civilized men bad.  Saying that, I wouldn't hesitate bringing the kids, they will love it. Frozen II visually, character wise and emotionally is good as ever. I would give 4 stars for that","displayName":"movie lover","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-07T22:53:06.398Z","updateDate":"2019-12-07T22:53:06.398Z","user":{"userId":"EB0CA2DF-9A4E-4F12-8449-58EDACABA1B5","realm":"Fandango","displayName":"movie lover","accountLink":null},"score":3,"timeFromCreation":"Dec 07, 2019"},{"rating":"STAR_5","review":"loved it.. it had my daughter and I singing along...","displayName":"Bella","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-07T22:47:46.409Z","updateDate":"2019-12-07T22:47:57.484Z","user":{"userId":"8E983113-8893-45D2-8366-44448066B7FE","realm":"Fandango","displayName":"Bella","accountLink":null},"score":5,"timeFromCreation":"Dec 07, 2019"},{"rating":"STAR_5","review":"loved loved the movie","displayName":"ana","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-07T22:39:52.919Z","updateDate":"2019-12-07T22:39:52.919Z","user":{"userId":"0CE75FDA-F1BB-422D-95FF-56921BB37972","realm":"Fandango","displayName":"ana","accountLink":null},"score":5,"timeFromCreation":"Dec 07, 2019"},{"rating":"STAR_3","review":"Great storyline. Lots of funny stuff. I didn't like the fact that all the songs had to be epic. Whatever happened to a nice jaunty tune.","displayName":"Ummyusif","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-07T22:36:18.375Z","updateDate":"2019-12-07T22:36:18.375Z","user":{"userId":"693B9D6B-7826-45BD-8AF3-2DE47685E3B7","realm":"Fandango","displayName":"Ummyusif","accountLink":null},"score":3,"timeFromCreation":"Dec 07, 2019"},{"rating":"STAR_3_5","review":"I was alright. I love Olaf.","displayName":"Nicole G","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-07T22:35:25.210Z","updateDate":"2019-12-07T22:35:25.210Z","user":{"userId":"9E4788D7-F03F-4F52-90B4-8AD19658CA4D","realm":"Fandango","displayName":"Nicole G","accountLink":null},"score":3.5,"timeFromCreation":"Dec 07, 2019"},{"rating":"STAR_5","review":"There is nothing to worry about regarding whether the groundbreaking, ever-expanding, unavoidable phenomenon would repeatedly rejuvenate now that another film – not a short, not a special, just a film – will once again freeze the screen and enchants moviegoers with new songs and a new journey for the beloved characters. Once promotional material surfaced with characteristic glimpses, the ideal tone sets in and the expressions appears more serious than just being all cheery while buried in the snow. What we see is the iconic sisterly dynamic duo with determination in facing whatever is unknown to them, but no doubt ought to be their most challenging venture yet, which indicates a truly epic storyline with a distant hint of darkness. Trust them and you will not be disappointed.\n\nAfter freezing summer, sneezing spring and [traditionally] warming winter, three years have passed since Else feared her powers were too much for the world but most importantly hers with her close friends and little sister Anna. While everyone is enjoying a peaceful harmony beneath fall, Elsa could not ignore what her gift is being drawn to until something has threatened her kingdom and the only way to subdue it is to embark on a dangerous but remarkable journey into the mystical unknown whereas answers she seeks are awaiting. Joined by Anna, Kristoff, Olaf and Sven, with their own wonders on what is ahead for them as well, with the first former protecting her big sister, Elsa only hope that her powers are just enough.\n\nFor such a phenomenon with heartening-driven narrative laying out a standardized elemental fantasy story that initially closes it book once everyone lives happily ever after, it deserves another round of applause by giving the spectating readers more than what they been given since. Partnering directors Chris Buck and Jennifer Lee returned to pen a canonical expansion that will solely unveil the mystery surrounding the mythology they had set up, mainly Elsa's character, by answering and raising new questions. Elsa's voice Idina Menzel predicted how right the time is for the sequel and why, enforcing the sequel's position of being made that is not exploiting the franchise's inadvertent money machine:\n\"I knew that if returning directors… felt it was the right time to do the sequel, they were only going to do it because they weren't coming from any materialistic or commercial place, that they felt there was an important reason to tell the next story and that's why it took so long for them to do it.\"\n\nAs foretold, \"Frozen II\" is epic, while the story proved it further to be transformative and a near contrast to the original that just got triumphed over (with couple of winks). Although there are cringeworthy moments but thankfully less then astoundingly made up for those moments despite their humorous purposes and also casually humanizes the characters. The story is so precious in a mysterious, literally foggy way that it has to be kept under wraps until we allow it to unfold as it progresses with enough turns, increasing stakes and minimal twists, one being predictable and non-affected to the rest, to exceed expectations, aided by typical beauty in the emotional resonance and animation. It greatly blends the two main tones that supposedly categorically divides the Disney animated library between a thematically serious, adventurous tone and a cheerful musical filtering a heroine narrative, as well forming the soundtrack at a diverse range coming off that blend.\n\nEven though the starring quartet kept running the unexpected upsizing franchise, their return in the cinematic feature-length follow-up felt more like a reunion in akin to last year's \"The Incredibles 2\". Each of their characters have grown and are burdened with emotional depth that needed to be put upfront when facing respective challenges through lingering questions and their effects, and the cast achieved that expanded exploration very nicely. While both Jonathan Groff and Josh Gad performed well while providing humorous relief, particularly the latter, and breaking down the changes as delicately they can, they are acceptably once again overshadowed by Kristen Bell and Menzel's strong and at times loving performances given the tasked development that the two sisters were given the heavier emotional weights and must singlehandedly decide what decisions must be made in coursing the expedition's stakes. Aligned with how the film as a whole is better than the first, the casted quartet outshines themselves from the first film.\n\nWhile generally well-performed all around, notable newcomers joining in are Sterling K. Brown (\"This Is Us\"), Evan Rachel Wood and Alfred Molina's collaborated gentleness, and probably Jason Ritter and Rachel Meadows for their own significances brought into their respective characters from familiarity to speculative fuel that need to be checked again to identify.\n\nWhat makes \"Frozen\" memorable to an extent of definition is the music that is not only the main trait in throwing back to Disney's Renaissance era but solely led by the high number \"Let It Go\", and it seems to be the main question regarding the sequel's expectations. The soundtrack is rivetingly more welcoming and catchier to the unshakeable point of mental stickiness with a melodious, upbeat return to form since its predecessor before \"Moana\" attempted replicating in its own originality. Then there is the aforementioned diverse range of moodily expressive tunes including a serious turn, with one break in a number being a more significant portion of the film's overall cringe despite the humorously purposed, randomly mimic throwback. The vocalizing vibrates more power to the film's epic stance than just one powerful song which spurred a debate whether its successor is sung either through \"Into the Unknown\" or \"Show Yourself\", only to bookend the search. Comparing the two soundtracks is similar to the comparison between the soundtracks of the first two \"Lion King\" films with similar placements being swapped, mixed and shared.\n\nThe best single adjective to award \"Frozen II\" for this year's usage of the word is a stellar masterpiece. Saying it is better than the first film will not cut it as it is actually one of the absolute best fantasy sequels that damaged the preceding standards based on the unbelievable strength that really did exceed expectations albeit how predictable that outcome would be. What can be simply applauded is that this \"Lion King\" equivalent is the best animated film of the year – barely surpassing \"The Hidden World\". (A+)","displayName":"Kyle M","displayImageUrl":"https://graph.facebook.com/v3.3/100001513380747/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-07T22:30:00.773Z","updateDate":"2019-12-07T22:30:00.773Z","user":{"userId":"907803058","realm":"RT","displayName":"Kyle M","accountLink":"/user/id/907803058"},"score":5,"timeFromCreation":"Dec 07, 2019"},{"rating":"STAR_5","review":"Awesome movie from start to finish","displayName":"kari","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-07T22:14:04.071Z","updateDate":"2019-12-07T22:14:04.071Z","user":{"userId":"00AC2FD5-5165-44CB-93C6-3287B3585D15","realm":"Fandango","displayName":"kari","accountLink":null},"score":5,"timeFromCreation":"Dec 07, 2019"},{"rating":"STAR_5","review":"As magical, original, effective and emotionally powerful as the first! Disney storytelling at its finest.","displayName":"James P","displayImageUrl":"https://graph.facebook.com/v3.3/100001395221461/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-07T22:03:16.147Z","updateDate":"2019-12-07T22:03:23.795Z","user":{"userId":"907561636","realm":"RT","displayName":"James P","accountLink":"/user/id/907561636"},"score":5,"timeFromCreation":"Dec 07, 2019"}]}