{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MTcyMDE4OTUiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMjhUMDg6MTE6MDAuOTM5WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb19iNWZhYmU3Ny05MWU2LTRlN2EtOGE0NC01YmFlZWQ0Yzg3ODQiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMjhUMTA6MTM6MzcuODI1WiJ9"},"reviews":[{"rating":"STAR_5","review":"Enjoyed more than the first movie.","displayName":"Roberto","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T10:13:37.825Z","updateDate":"2019-11-28T10:13:37.825Z","user":{"userId":"b5fabe77-91e6-4e7a-8a44-5baeed4c8784","realm":"Fandango","displayName":"Roberto","accountLink":null},"score":5,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_4_5","review":"Good movie!!! One worth seeing.","displayName":"Roy B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T09:45:48.870Z","updateDate":"2019-11-28T09:46:00.969Z","user":{"userId":"978152810","realm":"RT","displayName":"Roy B","accountLink":"/user/id/978152810"},"score":4.5,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_4_5","review":"I took two of my granddaughters age 7 and 9, They LOVED IT very entertaining, lots of activity and the animation was beautiful.","displayName":"Cynthia H","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T09:37:13.146Z","updateDate":"2019-11-28T09:37:13.146Z","user":{"userId":"0d1107a3-df40-438f-9c93-d877fb66e024","realm":"Fandango","displayName":"Cynthia H","accountLink":null},"score":4.5,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_4_5","review":"It was a great movie that everyone can enjoy","displayName":"Ahmad A","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T09:36:27.966Z","updateDate":"2019-11-28T09:36:27.966Z","user":{"userId":"e46294ea-d369-4d54-a9c4-8675c243b466","realm":"Fandango","displayName":"Ahmad A","accountLink":null},"score":4.5,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_4","review":"Great concept overall just felt a little rushed to fit the 90 minute squeeze","displayName":"StaceyJ75","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T09:28:25.418Z","updateDate":"2019-11-28T09:28:30.921Z","user":{"userId":"E282762F-19AF-4381-B208-56C015F1B0BC","realm":"Fandango","displayName":"StaceyJ75","accountLink":null},"score":4,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_4_5","review":"I like the family history lesson in the story. Good movie","displayName":"Andy H","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T09:16:27.050Z","updateDate":"2019-12-19T03:49:38.132Z","user":{"userId":"26FFB986-8496-48C2-81B0-0CAFBC7916A7","realm":"Fandango","displayName":"Andy H","accountLink":null},"score":4.5,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_0_5","review":"Song selection was not optimal. The singing by Stephan was deplorable","displayName":"Lin","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T09:09:32.360Z","updateDate":"2019-11-28T09:09:32.360Z","user":{"userId":"9b1cfc28-85bd-484e-8750-86fe297248db","realm":"Fandango","displayName":"Lin","accountLink":null},"score":0.5,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_5","review":"I loved Frozen 2!! I took my niece and we cant stop singing the songs!! Must see","displayName":"Robyne P","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T08:52:23.099Z","updateDate":"2019-11-28T08:52:23.099Z","user":{"userId":"9da66726-4deb-48f4-99d1-e1edc7ff57c8","realm":"Fandango","displayName":"Robyne P","accountLink":null},"score":5,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_4","review":"The movie was better than the first one!  Great story line and great job at catching people in their feelings!","displayName":"Dana m","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T08:12:00.677Z","updateDate":"2019-11-28T08:12:01.760Z","user":{"userId":"952a73fb-9b74-41a0-b539-675c30555a32","realm":"Fandango","displayName":"Dana m","accountLink":null},"score":4,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_2","review":"SPOILER ALERT\n\nLet me start off with how I was VERY, VERY, VERY excited for this movie. It had so much promise to reveal an exciting new world full of adventure and culture. Yes, the movie did do this... to some extent, but I fear as if it was not portrayed to it's full potential.\n\nLet me start with my frustration at the amount of singing within the first 15 minutes alone of this movie. Yes, the producers were trying to throw in some catchy new tunes that would be as heartfelt and warning as the original Title, however, the approach of so many songs within the first part of the movie was a pushy way to try and impose something that was like the original. And they failed greatly. The most catchy song, in my opinion in the sequel was probably 'Into the Unknown' by Elsa. Very catchy, in character, and overall a tune many came relate to. After all, how many of us go through life feeling as if we are not where we truly belong. I know I do. But before that, there is Ana's song with Olaf that is just out there in the sense that it doesn't quite fit. Cute, but out of character for the two mains that... well aren't very responsible or grownup. \n\nThen there's Kristoff's little solo... cute song, cool idea behind the tune but I'm sorry Disney... what the actual heck was that?! \n\nThe reindeer world would have been so interesting to see more of... how are they incorporated into the NorthUldra daily life? And on that matter, what is the NorthUldra daily lifestyle like? How has it changed since the forest became excluded and cut off from the magic they once harnessed?  \n\nWhy is only the wind Spirit named...? The one spirit you cannot physically see? The lovely interweb has given the water and fire spirits their Germanic names, but without having come across them on the internet, then a fan would never know they even had names.\n\nThe whole Anna and Kristoff engagement plot could have been played with more, along with their relationship, putting it to the true test. Maybe the fifth spirit should have been emotions, and some temptations were thrown in there.\n\nHow do Elsa and Anna's parents get out of the forest if the spirits are angry and create a mist that no one can enter or leave from? The wagon they escape in makes no sense as no one left... the soldiers were trapped in the forest... so who was driving the wagon?\n\nAnd don't get me started on this fifth spirit nonsense. I am all for a fifth spirit to tie the movie together... but Elsa as the fifth MAKES. NO. SENSE. Ice is not a spirit Disney. Lightning would have made more sense here, having the ability to harness all of the other spirits, and yes in a way Elsa can, but she cannot make fire, she doesn't control the wind... Ice is too closely to water, in my opinion, to be considered a fifth. \n\nAlso, upon the conclusion of the original film, Elsa was supposed to gain confidence and fall in love with her powers... why does it feel like in the beginning of the first and all throughout it we take a major step backwards in character development?\n\nLack of a villain kills this movie, and there is no drama to it, and a viewer does not feel the connection to the characters this time around as with the original. Maybe a villain could have been added sort of like Moana, where the spirit has become evil due to being enraged... maybe a bad guy moved into Ahtohallan and had been calling the shots, so the spirits went into hiding until Elsa awoke them...?\n\nThere was an idea that Elsa and Anna together are the fifth spirit that connect the two worlds of Arendale and The North but why does Anna not have even a glimmer of a power if this is the case? And yes there is some beauty in Anna just being... well Anna, and don't get me wrong, Anna is one of my favorite Disney characters, but she very much always seems to have that 'I'm the little sister and my big sister is better than me in every way imaginable' feel to her. Anna is a cool enough gal, she ought to have some little glimmer of a power on her own. Yes, she is the stand up princess who defeated a Frozen heart by acting on her own and finding her own 'true love' but... Frozen 2 also contradicts this... When Anna is rushing to destroy the dam, and it is collapsing all around her, she jumps to the ledge, and it falls out from under her... only to be saved BY. TWO. MEN. Why didn't the earth giants swoop a hand in and catch her? Why didn't Elsa come back to life and catch her with her pretty magical water horse? Why didn't Anna find a power within herself to save herself.\n\nWhy was Anna completely okay with Elsa upon her return? Olaf actually was mad. He had rising anger, and nothing is said... at. all, about Elsa breaking the promise that they do it together and that the girls go to Ahtohallan together. In true Anna style, she would have crossed the sea on a raft just to track down Elsa, but instead she gets trapped in a cave? Whaaaaaaa?\n\nThe queen, Elsa and Anna's mother is Northuldra, which is not suprising due to the foreshadowing within the first 10 minutes of the movie, however, this brings many questions to the forefront, my first being and most important being, IF MOMMA KNEW ABOUT MAGIC AND WAS AROUND IT AS A CHILD HOW DID SHE NOT KNOW THAT FEARING IT WOULD MAKE IT WORSE?!?!? WHAT THE ACTUAL HELL?! Also, why is a character that barely spoke in the first movie suddenly center stage in the second one? If Iduna was indeed from one of the oldest families of her people, why do we not meet any, LIKE ANY AT ALL, of Elsa and Anna's family from the other side of the mist? There has to be someone in that dang forest that is related to those two... like HELLOOOOO cool feature to thrown in. Also, if she was from such an old family they had to have some sort of tie with the spirits to have a clue how to handle them...\n\nWhy does Elsa's mom show up at the end of the movie, in Ahtohallan as if she is still alive? She speaks to Elsa, telling her that she is what she has been looking for... This contradicts another part of the movie where some of the Uldra believe that they heard the fifth spirit calling out at the end of the battle when the spirits became enraged... Doesn't this insinuate that Momma Iduna is indeed the fifth spirit... and if she is/was why is she dead?\n\nWHAT IS WITH THE AHTOHALLAN REVEAL? There were so many different outcomes that I was expecting versus Elsa busting into song (yes another good one and catchy, seems as if Elsa is the only one in the whole movie who deserves any sort of catchy song), and yes, its quite a good Frozen theme that Elsa is what she has been looking for and all she needs is herself, but... I was getting more of a vibe of leading up to mom and dad being frozen in the river from 'going so deep that they drowned' or even maybe mom was alive but trapped by the spirits... Anna having some sort of power? Even a baby one... Anything but the obvious, which we learned in the FIRST DANG MOVIE, that Elsa only needs herself and the love of her sister to be what she needs to be.\n\nWhen Elsa goes too deep into the glacier and finds herself actually felling cold.. for the first time it almost seems, Anna is devastated upon learning of this through Olaf, she knows she has lost two of the closest people to her, but then all she does is hunker down in a cave... for the night, and then gets up and belts out a... ballad? Not really a song at all, and definitely not your typical catchy frozen song. I understand the song revolves around Anna picking herself up and being able to take the 'next right step' but wouldn't it have been more true to the plot line had she become crushed and not able to move forwards? Maybe the forest starts crumbling upon the death of the fifth spirit... and that is what rouses her? Maybe Anna becomes so consumed with grief that she emerges as the fifth spirit, one that somehow harnesses darkness, a true contradiction to her character, but could only have came to the forefront upon the death of two of her most beloved people.\n\nI understand the whole symbolical issue of the two sisters being the bridge between Arendale and the Northuldra, but it makes no sense the the spirits would only reward one of Iduna's daughters with powers.....\n\nWhy was poor Kristoff left out of this movie? I swear we saw more of Sven.\n\nThe ending is very rushed, nothing truly feels tied together and your left with a what the hell just happened feel, and has a Game of Thrones feel to it that is unlike any other... white haired ice queen that becomes the 'Queen in the North....'\n\nI feel as if this movie should have been portrayed from a completely different point of view... maybe there is a Northuldra princess who's view the story is told from, perhaps she goes into the same cave Anna did trying to find a way to break her people free of the mist, and she comes across cave drawings that lead her into a secret tunnel to Ahtohallan, and once she arrives Elsa hears the siren, and from there the original Frozen princess and queen come into play? Maybe the world should have been an introduction to a whole new Disney princess and not tied to Frozen at all. At least if this had happened we might have been able to catch a glimpse of something new and exciting that made some sort of sense.\n\nOverall a visually stunning movie, that opened the doors to a beautiful new world... one that you feel as if you barely catch a glimpse of, and is not explored enough due to the attempt at some catchy new songs and so much focus on them that the ending of the movie is rushed and the depth that is seen in the original is barely captured.\n\nThe more times I see this film, the more holes I find, and the less I want to watch it again. After it comes out I may watch it once more, and that is the end for me and Frozen 2.\n\nVery disappointed Disney.","displayName":"Mikayla W","displayImageUrl":"https://graph.facebook.com/v3.3/100001603871208/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":true,"createDate":"2019-11-28T08:11:00.939Z","updateDate":"2019-11-28T08:14:02.251Z","user":{"userId":"917201895","realm":"RT","displayName":"Mikayla W","accountLink":"/user/id/917201895"},"score":2,"timeFromCreation":"Nov 28, 2019"}]}