{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY3MDQ2NjkiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMjRUMDE6MDk6MTUuNTI2WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb180NzM2RUUxOS0wQkIxLTQ2RjAtQkQwRS1CRjlFRjZEMUM4NDYiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMjRUMDE6MTM6MzkuOTc0WiJ9"},"reviews":[{"rating":"STAR_5","review":"Loved it!! As amazing as the first film","displayName":"Janine S","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-24T01:13:39.974Z","updateDate":"2019-11-28T01:31:14.912Z","user":{"userId":"4736EE19-0BB1-46F0-BD0E-BF9EF6D1C846","realm":"Fandango","displayName":"Janine S","accountLink":null},"score":5,"timeFromCreation":"Nov 24, 2019"},{"rating":"STAR_3_5","review":"It was a good movie, but I think it was geared for kids a bit older than the first movie","displayName":"eve","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-24T01:12:42.744Z","updateDate":"2019-11-24T01:12:42.744Z","user":{"userId":"0A7CCAC8-0719-40A6-9817-66F6E700B354","realm":"Fandango","displayName":"eve","accountLink":null},"score":3.5,"timeFromCreation":"Nov 24, 2019"},{"rating":"STAR_5","review":"great storyline, loved the music and comedy! my girls laughed alot","displayName":"Carrie","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-24T01:12:36.623Z","updateDate":"2019-11-24T01:12:36.623Z","user":{"userId":"F344A6BF-1C99-40C9-9FA5-AD472EAE93BC","realm":"Fandango","displayName":"Carrie","accountLink":null},"score":5,"timeFromCreation":"Nov 24, 2019"},{"rating":"STAR_5","review":"Disney Never disappoints","displayName":"kfer","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-24T01:11:54.364Z","updateDate":"2019-11-24T01:11:54.364Z","user":{"userId":"450E891E-EDFA-478F-8909-9B22CBC1D19E","realm":"Fandango","displayName":"kfer","accountLink":null},"score":5,"timeFromCreation":"Nov 24, 2019"},{"rating":"STAR_4_5","review":"Better than the first!","displayName":"Lee Ann W","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-24T01:11:26.035Z","updateDate":"2019-11-24T01:11:26.035Z","user":{"userId":"3FF87046-13F8-4C02-B66B-AAC3049FE0AB","realm":"Fandango","displayName":"Lee Ann W","accountLink":null},"score":4.5,"timeFromCreation":"Nov 24, 2019"},{"rating":"STAR_5","review":"took a group of 8 girls and they all loved it","displayName":"nl+8","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-24T01:10:52.886Z","updateDate":"2019-11-24T01:10:52.886Z","user":{"userId":"6A1B54DE-DCC5-4928-A38D-D0B4818BF6EF","realm":"Fandango","displayName":"nl+8","accountLink":null},"score":5,"timeFromCreation":"Nov 24, 2019"},{"rating":"STAR_5","review":"Awesome. Need part 3","displayName":"Daniel","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-24T01:10:40.728Z","updateDate":"2019-11-24T01:10:40.728Z","user":{"userId":"31FDB387-71DE-406A-80AE-DB957B25F26C","realm":"Fandango","displayName":"Daniel","accountLink":null},"score":5,"timeFromCreation":"Nov 24, 2019"},{"rating":"STAR_5","review":"Beautiful movie. This is definitely a movie one and all can enjoy.","displayName":"Mary","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-24T01:10:13.449Z","updateDate":"2020-01-01T13:57:58.283Z","user":{"userId":"82BBD056-58E9-4165-A8A1-52305AE62D45","realm":"Fandango","displayName":"Mary","accountLink":null},"score":5,"timeFromCreation":"Nov 24, 2019"},{"rating":"STAR_5","review":"went with my wife and enjoyed it very much","displayName":"Nicole and Ken","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-24T01:09:55.550Z","updateDate":"2019-11-24T01:09:55.550Z","user":{"userId":"A8234348-F66B-429E-B91E-7344AFBCE5F6","realm":"Fandango","displayName":"Nicole and Ken","accountLink":null},"score":5,"timeFromCreation":"Nov 24, 2019"},{"rating":"STAR_4","review":"Frozen II is directed by Chris Buck and Jennifer Lee, screenplay by Jennifer Lee, and story by Jennifer Lee, Chris Buck, Marc Smith, Kristen Anderson-Lopez and Robert Lopez.\nStarring Kristen Bell, Idina Menzel and Josh Gad.\n\nFrozen II is about Anna, Elsa, Kristoff, Olaf and Sven who leave Arendelle to travel to an ancient, autumn-bound forest of an enchanted land. They set out to find the origin of Elsa's powers in order to save their kingdom.\n\nFrozen was amazing, I think it's one of the best movie of 2013, it was beautifully animated, deep, emotional, showstopping and amazingly voiced! Frozen II was one of my top 5 anticipating movies, and it definitely delivers, Frozen II -once again- is one of the most memorable and special movies of 2019, I think it's one of the best movies of this year!\n\nThough the plot of this movie is simple, you will find yourself getting something every scene, there was so much happening, and that's something great, to have a simple plot, and to know how to extract entertaining from it without making the audiences feel that the plot is huge, but it fact it was simple.. and that's amazing!\n\nAlso the movie has no villain, and that's weird for Disney, and this genre in general, but still the movie was amazing without one, it handled itself very well without a villain to make them do stuff as it happened in How to Train Your Dragon 3, but no, Frozen II survived without a villain, and that made the story compelling, that it's different, it took risks, and also interesting, because what made the journey so good and special is that they went for it not because someone was threatening them, they went for it because they had to but for other motivations, other than a villain, and that what made Frozen II compelling and interesting.\n\nWhen it comes to improvements over the first one, of course the first thing that will pop up in everyone's mind is the animation, and yeah, Frozen II is appealing to the eyes, it's gorgeous to look at, and the details are so impressive, there are lots of scenes in the water and it didn't feel animated, for the most part the water seemed real, just like how amazing the animation was in Toy Story 4.\n\nThe plot is more richer, there is more that's happening, the first one was simple, and the sequel is -as some are saying- the more complex. For me they're both amazingly simple, it's just that the execution in the second one, made it darker and more complex.\n\nElsa's development made her really good in this movie, and way more interesting than the first one, and there's another transformation scene, which also has some details to notice, that really was chilling and gave her character a deeper and emotional feeling!\n\nAlso Olaf is really funny in this movie, he's more often in this movie more that the previous one, but I would say that I liked his character as much as I liked him in the first one, which is a lot! But what made him improved that we got more of him in this movie than what we got in the first one.\n\nWhen it comes to deterioration I think this movie is not as good as the first movie as a musical, I think the first one has better songs, this one is still great don't get me wrong, but the first one was better in that aspect.\n\nKristoff's character isn't that good in this movie, all he was doing in this movie is that he wanted to marry Anna and he was trying to propose to her and that's it! He's my least favorite part of this movie. He's not that bad, he still has a couple of gags throughout this movie, but he's not as good as he was in the first one, he's so cliched in this movie, even more than the first one, that's why I didn't like him that much in this movie.\n\nWhen it comes to flaws, I think this movie isn't as good as the first one, besides the things I said above, I think that the movie was a little rushed, some actions and decisions were made really fast without that much of thinking or discussions, and that's my main issue with this film.. and that's all about it!\n\nTo me, what makes this movie really works is the sister-ship between Anna and Elsa, it got deeper in this movie, and every scene they were together the movie got better, I think they're what made this movie beautiful, and their bond what got into my heart and eyes into tears! Also the ending is so beautiful, I don't wanna spoil anything, but the ending is just one of the best ending in 2019!\n\nThe movie also can be funnier that the first one from time to time, there's that much of rude humor, but adults can find themselves laughing more than kids, because some scenes were shot in a way that adults can find more funny, but kids won't get it, and that's a good thing, because animated movie nowadays only rely on rude humor to make adults laugh, but Frozen II is gonna be a weapon to defend yourself when you say that rude humor isn't the only way to make adults laugh in animation.\n\nFrozen II is awesome from start to finish, it was never dull, it never dragged down.. it used everything as it could to make this movie as fun as it it, it's so magical to go through this journey with this amazing cast into the unknown!\nYeah, right this movie has a song that's gonna stuck with you for years, goodluck trying to get it out of your head!\n\nI'm gonna give Frozen II an A-, I think it's one of the best movie of 2019, look forward to my spoiler review of Frozen II because there're so many stuff that I loved about this movie, that made it special, but I couldn't talk about them, because you know.. spoilers are bad!\n\nAlright guys, than you as always for reading my review, and if you like this you can click on my name to see some more.","displayName":"Kirollos N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-24T01:09:15.526Z","updateDate":"2019-11-24T01:09:17.095Z","user":{"userId":"976704669","realm":"RT","displayName":"Kirollos N","accountLink":"/user/id/976704669"},"score":4,"timeFromCreation":"Nov 24, 2019"}]}