{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb185REY1MkY0MC0wOTc3LTQyQ0QtOUNBOS1FQUNGMTEwOTVDMTMiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMDVUMDI6NTI6NDguNjU1WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NjAxMjU5MTEiLCJlbXNJZCI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjI2Njg5OTFiLTFhYWYtMzQ5Mi04ODRkLTc0MTE2M2YzMjAwNF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMDVUMDM6NDY6MjQuNDU5WiJ9"},"reviews":[{"rating":"STAR_4","review":"Frozen II Review:\n\nFrozen II is the sequel to the 2013 movie that surprised audiences everywhere.  This time we find Elsa, Anna, Kristoff, Sven, and Olaf traveling in an autumn forest to a village of people who may have the answers to Elsa's origin with her powers.  Frozen became a huge hit when it first came out and everyone loved it.  I did like it until it became very annoying and the songs were everywhere.  I still do like it, it's just that I can only handle so much of it.  The same thing worried me for this one.  Obviously the sequel wouldn't be as great as the first, but I didn't want to be annoyed if I actually really liked it.  Frozen II reminds me a lot of last year's Ralph Breaks the Internet: not necessary and not as great as the first, but entertaining.  Many people will disagree with the comparison I made, in fact I know many who just adored it.  I thought it was fine.  Personally, I have problems with stories that return to the original so we learn something we didn't know before, if that makes any sense.  In this case we go back to their childhood right away and learn about this forest.  That's just something I don't really like, however there's not much I can do about that.  The story itself wasn't bad, definitely not as strong as the first.  I didn't feel as strongly connected with the characters to begin with.  The circumstances towards the end helped me become more invested with the characters.  There's a risk taken that results in a darker tone and I thought that was a great opportunity for some character development and emotion.  Anna and Elsa were by far the strongest characters, Anna more than Elsa.  Elsa is just trying to figure things out kind of on her own which was good for her, but there was a detachment with the characters then which I wasn't a huge fan of.  Kristoff almost felt different from the first movie.  He's trying to propose to Anna all this time, but it's never working out.  He sings this song, and it's not a bad song, it's just that it felt out of place when it happens.  However that scene was entertaining.  Speaking of entertaining, Olaf is a character that's supposed to entertain everyone with his stupidity.  I can only handle so much of him.  I find that character to be very annoying.  Mainly, my problem was with the characters and some of the choices they made throughout the story.  The singing is good once again.  I didn't find the songs to be that catchy and fun, but in a couple weeks they'll be stuck in my head I'm sure.  One of them, either All is Found or Into the Unknown, will most likely make it into the Best Original Song category.  My favorite song, other than Lost in the Woods, was The Next Right Thing because that song showed some emotion.  Once again I really liked that darker tone towards the end.  The animation gets better and better each and every movie.  I loved looking at the screen to see the beautiful scenery.  For those who don't know, I love autumn so the parts in the autumn forest were just so beautiful to look at and I didn't want to look away at the scenery.  Overall I think Frozen II is a fine movie, but nothing special for me.  I just wanted a more from the story and characters.  Since it's a movie primarily aimed towards children, it became predictable.  Most everyone will enjoy this movie and I would recommend seeing it.\n\nMy Grade: B-","displayName":"Sawyer W","displayImageUrl":"https://graph.facebook.com/v3.3/217447608683164/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-05T03:46:24.459Z","updateDate":"2019-12-05T03:46:26.778Z","user":{"userId":"960125911","realm":"RT","displayName":"Sawyer W","accountLink":"/user/id/960125911"},"score":4,"timeFromCreation":"Dec 05, 2019"},{"rating":"STAR_5","review":"It was one of the best animated movies I've seen in a long time.","displayName":"treetopx","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-05T03:44:09.942Z","updateDate":"2019-12-05T03:44:09.942Z","user":{"userId":"56F9D2D7-05AE-4D50-96E0-C5215362F486","realm":"Fandango","displayName":"treetopx","accountLink":null},"score":5,"timeFromCreation":"Dec 05, 2019"},{"rating":"STAR_5","review":"Absolutely loved it! Will definitely be watching again.","displayName":"Esther","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-05T03:42:09.160Z","updateDate":"2019-12-05T03:42:09.160Z","user":{"userId":"45BCDAA0-381B-4C37-B999-FC98BA02F134","realm":"Fandango","displayName":"Esther","accountLink":null},"score":5,"timeFromCreation":"Dec 05, 2019"},{"rating":"STAR_5","review":"The critical reviews are way too harsh and in many cases are s***posts. This was a great movie with moving music.","displayName":"Alex B","displayImageUrl":"https://graph.facebook.com/v3.3/1250708568459196/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-05T03:38:59.617Z","updateDate":"2019-12-05T03:39:10.207Z","user":{"userId":"978419060","realm":"RT","displayName":"Alex B","accountLink":"/user/id/978419060"},"score":5,"timeFromCreation":"Dec 05, 2019"},{"rating":"STAR_5","review":"Great movie, my kids loved it and so did I. :)","displayName":"Jason S","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-05T03:34:00.474Z","updateDate":"2019-12-05T03:34:00.474Z","user":{"userId":"595377DE-E88A-4F08-9B59-AF6AEAACCE70","realm":"Fandango","displayName":"Jason S","accountLink":null},"score":5,"timeFromCreation":"Dec 05, 2019"},{"rating":"STAR_5","review":"surprised me with a great story. I thought it wouldn't be able to trump or even come close to the first but it did","displayName":"BJ","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-05T03:31:03.110Z","updateDate":"2019-12-05T03:31:03.110Z","user":{"userId":"1a6569e0-d817-45b7-9463-6786bf3f68de","realm":"Fandango","displayName":"BJ","accountLink":null},"score":5,"timeFromCreation":"Dec 05, 2019"},{"rating":"STAR_4","review":"My daughter said she enjoyed this more than the first one.","displayName":"Tony","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-05T03:01:18.864Z","updateDate":"2019-12-05T03:01:18.864Z","user":{"userId":"71864d10-f696-4492-a979-972eda8c0ec9","realm":"Fandango","displayName":"Tony","accountLink":null},"score":4,"timeFromCreation":"Dec 05, 2019"},{"rating":"STAR_5","review":"Loved it I want to see it again without my kids so I can watch it with no interruptions lol","displayName":"Autumn M","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-05T02:55:12.710Z","updateDate":"2019-12-05T02:55:12.710Z","user":{"userId":"68136CE0-C488-4627-A2B2-72FCC699FA89","realm":"Fandango","displayName":"Autumn M","accountLink":null},"score":5,"timeFromCreation":"Dec 05, 2019"},{"rating":"STAR_4","review":"Frozen II has a story line that adults watching can enjoy. It's like it was made for a live action film! It makes you feel things you wouldn't expect Disney to make you feel in an animated film. Loss, nostalgia, and betrayal are only a few of them. It even tackles some aspects of climate change, if you would believe it.\n\nThe graphics are stunning. The songs aren't as catchy as the first movie's but they're even deeper, in my opinion. Disney signed a contract with the Sami people, the indigenous of the Scandinavian region, to make sure they were represented right in this film and you could really feel it in the songs included and new characters. \n\nI love how both genders were equally represented here, how the women are shown as gutsy and courageous, and how the men aren't seen as useless but supportive.\n\nOverall this film made me feel an intense rollercoaster of emotions and presented so many themes that could be overwhelming but were personally enjoyable for me.\n\nP.S. The cheesy music video irked me at first, but looking back it was a good contrast for what you're about to feel in the last half of the film.","displayName":"Abiera W","displayImageUrl":"https://graph.facebook.com/v3.3/100000216660645/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-05T02:53:04.065Z","updateDate":"2019-12-05T02:53:07.701Z","user":{"userId":"962612949","realm":"RT","displayName":"Abiera W","accountLink":"/user/id/962612949"},"score":4,"timeFromCreation":"Dec 05, 2019"},{"rating":"STAR_4_5","review":"loved it! I thought out was as good as the first movie. the story line was good and the music was excellent!","displayName":"Sharon","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-05T02:52:48.655Z","updateDate":"2019-12-05T02:52:48.655Z","user":{"userId":"9DF52F40-0977-42CD-9CA9-EACF11095C13","realm":"Fandango","displayName":"Sharon","accountLink":null},"score":4.5,"timeFromCreation":"Dec 05, 2019"}]}