{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb19BNkE1MTc3Ni1ERTdCLTQ2NjQtQTM2Ny0wQkNDRTM0MjcyQ0YiLCJlbXNJZCI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMDctMTVUMjE6MTg6MzcuNzcyWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb184MDAwODgzZS0zOTI2LTQxMTYtODY2NS0wNWVlZDBkMWRkNDMiLCJlbXNJZCI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMDctMTVUMjM6NDA6MzcuODk4WiJ9"},"reviews":[{"rating":"STAR_4","review":"Another great Toy Story Movie. Loved the previous ones more. This one has a little unpredictable, sad and happy ending.","displayName":"Avi And Benjamin","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-15T23:40:37.898Z","updateDate":"2019-07-15T23:40:37.898Z","user":{"userId":"8000883e-3926-4116-8665-05eed0d1dd43","realm":"Fandango","displayName":"Avi And Benjamin","accountLink":null},"score":4,"timeFromCreation":"Jul 15, 2019"},{"rating":"STAR_4_5","review":"Great new characters, original storyline, witty , funny and a tear jerker","displayName":"Pom","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-15T23:32:40.782Z","updateDate":"2019-07-15T23:32:40.782Z","user":{"userId":"97431919-0f16-47c6-a15e-8c8dbee4dc91","realm":"Fandango","displayName":"Pom","accountLink":null},"score":4.5,"timeFromCreation":"Jul 15, 2019"},{"rating":"STAR_5","review":"My boys and I truly enjoyed this movie!  I cried!","displayName":"danisouth","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-15T23:18:27.007Z","updateDate":"2019-07-15T23:18:27.007Z","user":{"userId":"9b671a44-42fc-4bf1-aaae-c2c98cab04ae","realm":"Fandango","displayName":"danisouth","accountLink":null},"score":5,"timeFromCreation":"Jul 15, 2019"},{"rating":"STAR_5","review":"Who doesnt love Toy story??","displayName":"Jennifer C","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-15T23:01:23.800Z","updateDate":"2019-07-15T23:01:23.800Z","user":{"userId":"fed3b0db-5895-4fd0-a02d-d8b94580b82b","realm":"Fandango","displayName":"Jennifer C","accountLink":null},"score":5,"timeFromCreation":"Jul 15, 2019"},{"rating":"STAR_3_5","review":"Toy Story was a perfect trilogy in a world where cinematic threepeats often fail (think Matrix, Pirates, Spider-Man, and the most dreaded of all, Godfather III). Toy Story was about why we love our possessions. Toy Story 2 was about why our possessions love us. And the now penultimate Toy Story 3 capped it off clean with why we eventually have to part with our possessions. So the questions us film purists had when Pixar announced a fourth entry were: What's left? Artistic merit or cash cow? Why toy with a perfect set? If third movies are bad, fourths usually get the reboot, or take off in a different direction, frequently getting lost. Part 4 was particularly unkind to Indiana Jones, whose perfect trilogy long stood as a cinematic staple, until crystal skulled aliens transported the archaeologist to an awkward dimension. It's that whole can't leave a good thing alone business. Scream took the meta approach, making jokes about how fourth movies function in a franchise. I'm happy to report Toy Story 4 was also self-aware, if only a little less poignant. \n\nToy Story 4 outright admits to themes of throwing itself in the garbage and having nothing left to do, roles played by Forky (Tony Hale) and Woody (Tom Hanks) respectively. Woody learned some time ago that the only important role he had as a toy was to love his kid to the fullest, to be willing to do anything for them. He soon realizes Bonnie (Madeleine McGraw) is no longer interested in playing with him, an awfully contrived plot device since he was just recently her favorite toy, and she still plays with the others. \n\nBonnie is terrified to start kindergarten orientation, and Woody wants to help. He shows up at school with her and assembles some trash for arts and crafts, in which she concocts the now infamous Forky, our first born-anew handcrafted toy. There's a moment of consciousness-awareness that's both frightening and hilarious, reminding us of clones or replicants awakening in sci-fi films. Bonnie loves Forky, but Forky hates his existence, feeling bound to the trash from whence he came. Woody has to convince him that life is worth living, but Forky's persistence winds them both on the street as lost toys. Nothing new to the formula, the toys set out to accomplish one smaller task and wind up far away, homeward bound. So what's fresh?\n\nToys, a whole lot of them, so much that most of the former cast is reduced to small appearances or cameos. Key & Peele reunite as Ducky & Bunny, carnival toys stuck to each other and a shooting gallery wall with little hope of ever having a kid, until Buzz Lightyear (Tim Allen) intervenes. Officer Giggle McDimple's (Ally Maki) is one of those even the smallest can make a difference characters, Bo Peep's sidekick. Perhaps the most anticipated comes from the voice of America's favorite urban legend, Keanu Reeves as the fitting stuntman Duke Kaboom, yet another abandoned toy driven by anguish. And a softer, more sympathetic antagonist riles things up as our heroes try to get home, Gabby Gabby (Christina Hendricks), accompanied by her creepy henchmen, the Dummies.\n\nThere's a lot of fun and spectacle, but for the caliber franchise that Toy Story has been, was it necessary? At times, it does seem to be on repeat, upping the ante to the third's ‘say goodbye' tear-jerking – \"higher on the strings, Randy [Newman].\" Has Pixar found a comfortable, safe formula that we're just easily susceptible to? I'm not sure I can identify the bold, overarching point, which each of the others have, nor any evolution, besides technology, with incredible texture/motion animation in the carnival at night, and a photorealistic cat. The flashback to losing Bo Peep (Annie Potts) is hardly an impactful starting point, although her re-emergence into the story, as a toy-wielding camper glides Bo and Woody right into each other, was magical. Still, it seems this film is made mostly to get Woody and Bo back together, which would've made for a better TV short film.\n\nThere's some confusion as to where our sympathies should lie. Woody and Bo are in dispute over who's really ‘lost.' Gabby is too cruel to be so easily forgiven. Bonnie's despair over losing Forky gets annoying. Whatever sympathy we lose for her is traded for dad (Jay Hernandez), who's having a Clark Griswold experience, one failure after the other on a family road trip. And while some of the humor works, some overstays it's welcome, particularly Forky's garbage montage, making it's point about his destiny redundant.\n\nWe've been told Toy Story 4 will be the end, but I'm not convinced. I was taught a five-act structure in school, and this easily feels like act IV, the false resolution. It's probably more wishful thinking, as the voice actors aren't getting any younger; we already bade farewell to the late Don Rickles (Mr. Potato Head) for this round. But I think fans are owed a more satisfying ending than this ‘going rogue' business, which I'll not elaborate on. There's no shortage of fun and laughter, and it's ultimately worth seeing. But by Toy Story standards, it's a bit like going from a Buzz Lightyear multi-feature space ranger action figure to an old, worn, pull-string Woody doll. And yet we still love that cowboy, so it's got a friend in us.\n","displayName":"Tiberio S","displayImageUrl":"https://graph.facebook.com/v3.3/832747305/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-15T22:47:58.485Z","updateDate":"2019-07-15T22:48:22.557Z","user":{"userId":"789707717","realm":"RT","displayName":"Tiberio S","accountLink":"/user/id/789707717"},"score":3.5,"timeFromCreation":"Jul 15, 2019"},{"rating":"STAR_5","review":"This movie was excellent. Sometimes Disney movies are too dark and too many villain s for children under 8. It taught some nice lessons throughout the movie.","displayName":"Grandma","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-15T22:26:36.751Z","updateDate":"2019-07-15T22:26:36.751Z","user":{"userId":"ca3f197f-43a8-43b2-a6ef-1c1fd9823051","realm":"Fandango","displayName":"Grandma","accountLink":null},"score":5,"timeFromCreation":"Jul 15, 2019"},{"rating":"STAR_2","review":"While entertaining enough for extremely young children I was a bit disturbed by the Stockholm syndrome feel you get from the interactions of Woody and Gabby-Gabby. She kidnaps, blackmails, uses reverse psychology,  has goons like a mob boss, tries to forcibly tear out Woody's voicebox before ultimately surgically removing it (leaving him a broken toy)... and by the end we're to forgive that, are expected to feel bad, and her victim helps her? ","displayName":"Chelcie L","displayImageUrl":"https://graph.facebook.com/v3.3/706118930/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-15T22:16:03.800Z","updateDate":"2019-07-15T22:16:03.800Z","user":{"userId":"946919029","realm":"RT","displayName":"Chelcie L","accountLink":"/user/id/946919029"},"score":2,"timeFromCreation":"Jul 15, 2019"},{"rating":"STAR_3_5","review":"I never got bored with the different plots and developments. Throw in some great animation and humor and you have another good addition to the Toy Story franchise. But for me there were too many sappy and emotional scenes that were unwarranted. (69%)","displayName":"Quinn R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-15T22:08:37.635Z","updateDate":"2019-07-15T22:08:37.635Z","user":{"userId":"977314405","realm":"RT","displayName":"Quinn R","accountLink":"/user/id/977314405"},"score":3.5,"timeFromCreation":"Jul 15, 2019"},{"rating":"STAR_4_5","review":"I loved the plot line and the way everything blended together at the end..  I don’t know if it was because I knew all of the characters before or not.  But Considering my 91 year old mother loved it and she had not seen any of the other movies should say something!","displayName":"Donna D","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-15T21:43:40.741Z","updateDate":"2019-07-15T21:43:40.741Z","user":{"userId":"2AB351C3-A9B7-47C7-A4E2-C98465DE242E","realm":"Fandango","displayName":"Donna D","accountLink":null},"score":4.5,"timeFromCreation":"Jul 15, 2019"},{"rating":"STAR_5","review":"nice ending for woody but not inlined with TS Tradition","displayName":"Eric N V","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-15T21:18:37.772Z","updateDate":"2019-07-15T21:18:37.772Z","user":{"userId":"A6A51776-DE7B-4664-A367-0BCCE34272CF","realm":"Fandango","displayName":"Eric N V","accountLink":null},"score":5,"timeFromCreation":"Jul 15, 2019"}]}