{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb180QTRGMDQ5OS1GNjlDLTQ4RjUtQjQ1RS1BQjFFMDk4MDQ1ODIiLCJlbXNJZCI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMDctMDlUMjA6MDc6MTEuNzQxWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwMTE5NzYiLCJlbXNJZCI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMDctMDlUMjE6MTQ6MzUuNjg4WiJ9"},"reviews":[{"rating":"STAR_5","review":"Best toy story film of all time!!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-09T21:14:35.688Z","updateDate":"2019-07-09T21:14:35.688Z","user":{"userId":"260011976","realm":"RT","displayName":null,"accountLink":"/user/id/260011976"},"score":5,"timeFromCreation":"Jul 09, 2019"},{"rating":"STAR_5","review":"Great storyline! Loved this movie!","displayName":"Jennifer","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-09T21:06:45.265Z","updateDate":"2019-07-09T21:06:45.265Z","user":{"userId":"3E57A487-AF74-43EF-929E-7EB0D637B474","realm":"Fandango","displayName":"Jennifer","accountLink":null},"score":5,"timeFromCreation":"Jul 09, 2019"},{"rating":"STAR_4_5","review":"Inevitably beautiful and nostalgic, it leaves us laughing, crying and hope. A deeply human and funny toy story that once again takes us to infinity and beyond.","displayName":"Pablo B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-09T21:06:22.988Z","updateDate":"2019-07-09T21:06:22.988Z","user":{"userId":"978147599","realm":"RT","displayName":"Pablo B","accountLink":"/user/id/978147599"},"score":4.5,"timeFromCreation":"Jul 09, 2019"},{"rating":"STAR_4","review":"Good movie but i hated the ending","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-09T21:03:08.528Z","updateDate":"2019-07-09T21:03:08.528Z","user":{"userId":"260248432","realm":"RT","displayName":null,"accountLink":"/user/id/260248432"},"score":4,"timeFromCreation":"Jul 09, 2019"},{"rating":"STAR_5","review":"Another great addition to the series. Not on the level of the last one,  but still had enough laughs and fun. Kids will love it of course.","displayName":"Stephen K","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-09T20:59:55.436Z","updateDate":"2019-07-09T20:59:55.436Z","user":{"userId":"94376533-7688-4885-8148-86745DEFC084","realm":"Fandango","displayName":"Stephen K","accountLink":null},"score":5,"timeFromCreation":"Jul 09, 2019"},{"rating":"STAR_5","review":"This series will be part of me for the rest of my life!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-09T20:53:22.303Z","updateDate":"2019-07-09T20:53:22.303Z","user":{"userId":"260004433","realm":"RT","displayName":null,"accountLink":"/user/id/260004433"},"score":5,"timeFromCreation":"Jul 09, 2019"},{"rating":"STAR_5","review":"\"To infancy and beyond!\"\n\nHow attached are you to Andy and his Toys, Woody, Buzz and the gang? Don't bother answering because, like me, I already know just how dependent you are on these peerless Pixar characters. Chances are you've grown up with these movies...\n\n...Having watched Toy Story 4, I further suggest that these movies have grown up with you! And they have just earned a First Class Honours Degree. Forget going to college with Andy  - this incomparable quadrilogy provides the most nuanced examination of Attachment Theory imaginable. \n\nAttachment, in psychology, refers to the special bond and the lasting relationships that children form with one or more adults.  \n\nUnderlying the truly genius Toy Story saga is an in-depth cognitive, psycho-dynamic and socio-psychological exploration, of the theory of Attachment.\n\nThe saga initially tackles Attachment Parenting during the childhood years, involving all the ways parents must hold a child close for reliance on a secure dependence to be established. We can view Woody as a substitute child dependent on the love and attention of his primary carer, Andy. But we can just as easily see Woody as the carer, with Andy dependent on the safe love provided to him by his trusty toy. Take your pick; it works both ways, just as the films work harmoniously as entertaining flicks for kids and detailed studies of the Attachment Theory.\n\nDon't believe me? Well ok then, push the button, spread the wings and watch my theory fly...\n...or at the very least fall with style:\n\nToy Story \n\nAs with babies, we learn from Woody that toys have a kind of biological drive to seek proximity to a primary carer (or a child to play with them) for survival and fulfilment. Woody et al are dependent on the physical and emotional availability of Andy to play with them. We see that the toys' relationships with their child owners are crucial to their trust of others, their understanding of relationships generally and their feelings about themselves. Just check out the juxtaposition between Andy's contented toy box with the tragically nervous and dysfunctional behaviour of Sid's mistreated and mutated playthings! The drive in Woody for closeness to Andy promotes attachment behaviours, which helps him feel safe and wanted. Woody's development of attachment relationships continues as he gradually learns to think about others' feelings, manage relationships with his peers and co-operate with others, not least the insufferable new addition to the family, Buzz Lightyear!\n\nSynchronous with the above theme, Andy himself - throughout the first movie - is dependent on his toys, not least his trusty old chum Woody. His attachment to Woody is self evident - the cuddly gunslinger equivalent of a comfort blanket.\n\nToy Story 2\n\nIn the sequel, Woody is no longer the selfish and dependent infant. He is growing into adolescence, and in so doing is learning more about self. As an adolescent who has benefitted from regular love, affection and ‘favourite toy' status from Andy, our maturing cowboy is reassured enough by Attachment to begin flirting with autonomy - more individual responsibility, more expression of individuality and a yearning to direct and lead his own life. Of course he is not quite ready to cut loose, and dutifully, nay triumphantly, returns to the safe haven of his room with Andy... \n\n...albeit he is no longer the vulnerable and defenceless old rag tag cowboy we had seen in the first film but rather a self assured collectible leader of the Round Up Gang! \n\nMeanwhile, in the second instalment of the saga, Andy is growing into adolescence himself. No longer quite so dependent on his toys, he even briefly casts Woody aside, daring to travel to camp without his old ally. For Heaven's sake, the bewildered cowboy even finds himself gathering dust on the shelf! Woody feels like any parent who suddenly realises his child would prefer to go to the pictures with his friend instead of his mum and dad. Like Woody though, he can't stay away for long just yet, and runs giddily back into the protective safety of his beloved Sheriff. Attachment runs deep don't you know!\n\nThe latter two entries then move seamlessly yet suddenly into an exploration of Detachment Parenting during the adolescent years, involving all the ways parents must let the child go for a confident independence to grow.\n\nToy Story 3\n\nWoody has proven very good at becoming an integral part of Andy's life, and vice versa, Great, I hear you all proclaim. After all, close parental attachment nurtures a founding sense of interpersonal trust and a solid platform for the development that follows.\n\nHowever, it's not all rosy in the garden. Highly attached parents of children (or toys) can have a devil of a time not excessively holding on, hovering over and helping out when the time for more parental detachment arrives. \n\nBut time waits for no-one - not even a digitally created cowboy doll! Without adequate parental detachment, developing individuality for identity and responsibility for independence are very difficult to accomplish. \n\nLetting go - I know, I'm already welling up thinking about the scene - is done through parental permission and acceptance. Both Woody and Andy - whether you view either or both as the maturing child or the heartbroken parent - converge to permit and accept a final parting of the ways. Detachment can be THE most painful process. Parents have to let go some life agenda they had for the child, \"We determine the direction you take;\" to \"We accept that you must set your own course through life.\" - \"THANKS GUYS\"! 😭\n\nToy Story 4\n\nFor Woody, just as for any child or indeed parent, detachment can be an emotionally costly process. He has now let go of Andy, who is no longer his to control or his to rely upon. \n\nIn infancy and childhood, through attachment, the child trusts in dependence on the parent, but in adolescence, through parental detachment, the child learns to trust in dependence on self. Woody, as you view him a grown child who has flown the nest, is no longer tied to a carer. He can make his own choices; choose his own path; take his own fork in the road!\n\nBut what about Woody the primary carer? Parental detachment to foster independence is neither an expression of parental desertion nor abandonment of parental love. While daring to let go of Andy, and then ultimately Bonnie, Woody still holds fast to his commitment of continuing to care. He will, as Forky wisely observes, never get over Andy. And he requires the assurance of Buzz that \"She'll be ok, Bonnie will be ok\", before he gives his final permission and acceptance to cut loose with Bo Peep! \n\nWhether the parent or the older adolescent, Woody must pay a price of this new independence; he must, like Bo Peep already has, learn to live with the new challenges independent of his prior attachment - Decide for myself; Define myself; Direct myself. \"To infancy...and beyond\"!","displayName":"Andrew T","displayImageUrl":"https://graph.facebook.com/v3.3/602854637/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-09T20:40:42.516Z","updateDate":"2019-07-09T20:40:42.554Z","user":{"userId":"976923863","realm":"RT","displayName":"Andrew T","accountLink":"/user/id/976923863"},"score":5,"timeFromCreation":"Jul 09, 2019"},{"rating":"STAR_4","review":"kinda dark for a kids movie","displayName":"Sir-Tubby","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-09T20:12:34.045Z","updateDate":"2019-07-09T20:12:34.045Z","user":{"userId":"7E14C8D6-33ED-4A06-96DF-5C406B881C60","realm":"Fandango","displayName":"Sir-Tubby","accountLink":null},"score":4,"timeFromCreation":"Jul 09, 2019"},{"rating":"STAR_2_5","review":"I loved the movie my kids enjoyed it so much. The only issue we had was the seating we were so uncomfortable the seats where not like the regular priced movie theater seating. They were old small horribly dirty and uncomfortable they did not recline and my son would not sit in the seat so he sat on my lap. He has been to other movie theaters and sat just fine but not this time. I was very disappointed and felt as if I was cheated out of our experience give that the other areas of seating that were not IMAX where way nicer and comfortable. I paid extra thinking I would get the best and I felt worse, I even complained to the Manager and all he could say is IMAX is not part of the other regular priced theater which I for one didn't understand if its in the theater it should all be the same especially if I paid good movie well over 100.00 dollars for my family to enjoy 1hr 45 min of being uncomfortable. Next time I will rethink paying extra for IMAX experience and just go to another place","displayName":"Adel","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-09T20:07:37.014Z","updateDate":"2019-07-09T20:07:37.014Z","user":{"userId":"40f5213a-ffee-47a1-a266-8400c2939704","realm":"Fandango","displayName":"Adel","accountLink":null},"score":2.5,"timeFromCreation":"Jul 09, 2019"},{"rating":"STAR_4","review":"Great continuation of the storyline!","displayName":"Kdizzle","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-09T20:07:11.741Z","updateDate":"2019-07-09T20:07:11.741Z","user":{"userId":"4A4F0499-F69C-48F5-B45E-AB1E09804582","realm":"Fandango","displayName":"Kdizzle","accountLink":null},"score":4,"timeFromCreation":"Jul 09, 2019"}]}