{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NTM5MzY0OTYiLCJlbXNJZCI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMDktMjJUMTI6NTU6NTMuNTE3WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzgyODIzODUiLCJlbXNJZCI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMDktMjRUMDE6MTA6MjUuMDYzWiJ9"},"reviews":[{"rating":"STAR_5","review":"Toy story 4 great movie for all ages and the family good story and sad but i love this one because of how it goes and ends.","displayName":"Matt A","displayImageUrl":"https://graph.facebook.com/v3.3/100000465230238/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-24T01:10:25.063Z","updateDate":"2019-09-24T01:10:25.063Z","user":{"userId":"978282385","realm":"RT","displayName":"Matt A","accountLink":"/user/id/978282385"},"score":5,"timeFromCreation":"Sep 24, 2019"},{"rating":"STAR_4","review":"Just when I thought I was done with Pixar movies...again, Toy Story coming back to the rescue!! ","displayName":"Jorge  P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-24T00:12:02.708Z","updateDate":"2019-09-24T00:12:02.708Z","user":{"userId":"978282304","realm":"RT","displayName":"Jorge  P","accountLink":"/user/id/978282304"},"score":4,"timeFromCreation":"Sep 24, 2019"},{"rating":"STAR_3","review":"Didn’t have the heart pull of the others. Disengaged","displayName":"momtaxi","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-23T23:06:37.678Z","updateDate":"2019-09-23T23:06:37.678Z","user":{"userId":"4DF52110-F21E-41FF-B711-3000C23FD052","realm":"Fandango","displayName":"momtaxi","accountLink":null},"score":3,"timeFromCreation":"Sep 23, 2019"},{"rating":"STAR_4","review":"Still lovely movie with nice characters, but it does feel like there are many more stories worth telling about these toys anymore. Hopefully, this is the last one. ","displayName":"Champ T","displayImageUrl":"https://graph.facebook.com/v3.3/1602390588/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-23T23:02:12.246Z","updateDate":"2019-09-23T23:02:12.246Z","user":{"userId":"903811958","realm":"RT","displayName":"Champ T","accountLink":"/user/id/903811958"},"score":4,"timeFromCreation":"Sep 23, 2019"},{"rating":"STAR_2","review":"\"Look at the fluff.\"\n\nWoody and the gang go with their new owner Bonnie on a road trip before she starts kindergarten and adjust to their new comrade Forky.... a toy Bonnie created herself. While on the road Woody runs into Bo Peep who's now adjusted to life as a lost toy.\n\nYeah I'll just.... come out with it here, I didn't like this movie. And aside from Cars this would be the worst Pixar movie I've seen so far.\n\nI'm a massive Toy Story and Pixar fan since 1995. Toy Story changed how I thought, it's THAT kind of movie for me. And I'd be here all day talking about what I love about Toy Story 1, 2 and I'd be here for a week talking about what I love about Toy Story 3 which is a true masterpiece.\n\nToy Story 3 was a PERRRRRFECT ending to the story of Woody and Buzz. They faced death together.... and survived. You can't top that for an adventure.... and they sure don't in Toy Story 4.\n\nIt's not a bad movie just... it didn't do much for me.\n\nI'll tell you one thing that bugged me when it was over was I could count on one hand the number of times I laughed. Where the hell were the jokes in this movie? That bit where the bunny and the chick hatch their plan... get it... but where they go over how they're gonna steal the antique shop owner's key... is one of the funniest gags in ANY Pixar movie. That was the first laugh for me and it was maybe 50 minutes into the movie. That's not the kind of joke/laugh ratio I like.\n\nForky... lemme talk about Forky....... Forky sucks ass.\n\nWhen I saw that character in the trailer I had a feeling that character would be annoying. And he's not annoying it's just... they don't do ANYTHING interesting with him at all. This idea of NEW LIFE and they don't do anything cool with it. It's Frankenstein's monster! The number of directions you can do with the creation of a toy and how they begin life seems infinite and... it felt like they threw all of that away. What a letdown. And they spend the first 20 minutes of the movie with his character, too which sucks.\n\nIt's a decent story, in these movies they've managed to do a great job giving us these takes on life for toys. For some toys it's about being owned and loved by a kid and the idea of being lost or abandoned is a hell without end....... unless you're Bo evidently.\n\nBo is a whole new and great character, living this almost Mad Max in the wasteland existence driving around in a skunk car.... long story that's never explained. And I don't wanna give away where the story goes but they make that an option for some of our characters and it's an interesting place to take the story..... but I've seen WAY more interesting stuff happen in these movies.\n\nI think the biggest problem this movie has is Toy Story 3.\n\nToy Story 3 had everything, a great and HARROWING story, laugh out loud moments every other minute, fantastic new characters, a STELLAR villain in Lotso Huggin' Bear and a climax I don't think Pixar will ever top, frankly.\n\nNot to mention the best opening scene in a Pixar movie with this sort of fantasy that I read as what literally happens for toys when they're played with, they're transported to this other reality where anything is possible. It made Woody's desire to be with Andy make even MORE sense. Who wouldn't want to be a part of adventures like that.\n\nSo I was pretty bummed when Toy Story 4 by the time it was over had nothing in common in Toy Story 3. There IS no villain, no Sid, no Stinky Pete, no Lotso, no life or death stakes.... and wow is that a nice way to make me care less about what happens in an adventure story.\n\nAnd the ending was.... so underwhelming to me. Like infuriatingly underwhelming.\n\nAfter the pitch perfect The End closure in Toy Story 3, they give us a NEW ending that was so left field and lame to me and sent me out of the theater with a bad taste in my mouth.\n\nAnd also as a fan of these movies I was crushed that the characters I grew to love like Jessie, Bullseye, Hamm, Potato Head, Rex... aside from Woody, Buzz and Bo the characters I knew were relegated to almost cameos in their own movie. It's like watching an X-Men movie and the only characters that get scenes are Wolverine, Xavier and Jean Grey..... don't gimme all these new characters when we're not done with the old ones yet!\n\nIt's not the kind of sequel I hate where it makes the other films worse but based on its own merits... aside from Woody and Bo's story and the quality of the animation this movie did nothing for me.\n\nNever mind the Toy Story movies, after incredible works of art like Inside Out and Coco coming out of Pixar this movie just seemed cookie cutter to me.\n\nToy Story 4 is a HUUUUUUGE letdown for me.","displayName":"Kurt F","displayImageUrl":"https://graph.facebook.com/v3.3/760094471/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":true,"createDate":"2019-09-23T22:13:07.460Z","updateDate":"2019-09-23T22:13:07.460Z","user":{"userId":"804534564","realm":"RT","displayName":"Kurt F","accountLink":"/user/id/804534564"},"score":2,"timeFromCreation":"Sep 23, 2019"},{"rating":"STAR_4","review":"well written goodbye to the toys I grew up with. ","displayName":"Karl A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-23T12:04:40.245Z","updateDate":"2019-09-23T12:04:40.245Z","user":{"userId":"977458079","realm":"RT","displayName":"Karl A","accountLink":"/user/id/977458079"},"score":4,"timeFromCreation":"Sep 23, 2019"},{"rating":"STAR_5","review":"This is the FUNNIEST of all the Toy Story movies. This was Amazing!","displayName":"Jackie","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-23T02:36:07.389Z","updateDate":"2019-09-23T02:36:07.389Z","user":{"userId":"7D75E4EC-29BA-48CE-993B-E352D34801C8","realm":"Fandango","displayName":"Jackie","accountLink":null},"score":5,"timeFromCreation":"Sep 23, 2019"},{"rating":"STAR_4_5","review":"near perfect movie I mean come on the animation was amazing so realistic the character development was beyond anything you could expect in a  kids movie the plot was solid nothing but family friendly fun with a few dirty jokes here and their \"they put him in the closet with no one to play with\" the only thing I didn't enjoy was the lack of an antagonist I mean yeah you had the creepy looking dolls that look like Scarface from batman and Gotham but come on nothing to beat or anything the 3rd one had the best villain this had nothing but I love all the characters Woody, Buzz,Forky etc I would recommend it 9 out of 10","displayName":"christopher p","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-22T23:13:12.101Z","updateDate":"2019-09-22T23:13:12.101Z","user":{"userId":"978144575","realm":"RT","displayName":"christopher p","accountLink":"/user/id/978144575"},"score":4.5,"timeFromCreation":"Sep 22, 2019"},{"rating":"STAR_3_5","review":"Not nearly as good as the third, and the comedy is hit-and-miss, but the visuals and emotion is palpable and heartwarming.","displayName":"Jackson T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-22T20:13:13.596Z","updateDate":"2019-09-22T20:13:13.596Z","user":{"userId":"978280010","realm":"RT","displayName":"Jackson T","accountLink":"/user/id/978280010"},"score":3.5,"timeFromCreation":"Sep 22, 2019"},{"rating":"STAR_5","review":" This further substantiate the thematic message of growing up and maturing as seen in part 3. Sometimes the usual path of living with a kid is not the only walk of life. But great adventure awaits out there. Woody just made us realise that even if our purpose is to love and be with someone, we can also help others find their love. And that is meaningful.","displayName":"Adrian B","displayImageUrl":"https://graph.facebook.com/v3.3/100000535337193/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-22T12:55:53.517Z","updateDate":"2019-09-22T12:55:53.517Z","user":{"userId":"953936496","realm":"RT","displayName":"Adrian B","accountLink":"/user/id/953936496"},"score":5,"timeFromCreation":"Sep 22, 2019"}]}