{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzgxOTg4MDkiLCJlbXNJZCI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMTFUMTU6NTA6NDAuOTMzWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzA5ODAxMDUiLCJlbXNJZCI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMTZUMTc6NTY6NTMuMjg4WiJ9"},"reviews":[{"rating":"STAR_5","review":"Toy Story 4 seems like the type of movie that just shouldn't have worked out. The third film is loved by virtually everyone and the fourth film overrides the ending of the last movie. So, why is Toy Story 4 much better than it should've been? Well, before we get to that, let's discuss the obvious problems: Bonnie and the lack of development of old characters. The former has been the butt of jokes on the Internet thanks to her visible neglect of Woody. While this does cheapen the impact of the ending of the last movie, she's still only a 5-year-old girl and neglecting that one toy is normal behaviour for children her age. So calm down, guys. And with regards as to why the toys spend most of the movie literally and metaphorically in the back seat, I think the shorts and TV specials did help the characters go through arcs. That is, if those are even canon anyway. And they weren't completely useless nor were they interchangeable. Now that I've played the devil's advocate to the two things people have complained about, let's get down to talking about why this movie is good. The animation (uh-doy!). At times, you'd swear Pixar was just showing off, especially compared to how outdated the '90s movies look (mostly the first film, but the second film has its more awkward moments despite having much better human designs and outside scenes). And the script still has its share of emotional and comedic moments, helped by the voice acting. And I do like the new characters and am glad to see how Woody has come a long way from being the guy who'd resort to pushing Buzz under a table, out of Andy's line of sight, just so that he can get to go to Pizza Planet. I do find the ending a worthy end to Woody's story, especially considering the override. Still less esoteric than the one from Wreck-it Ralph 2, if you ask me. I enjoyed Toy Story 4 and consider it a worthy, and presumable ACTUAL, conclusion to not just the series but Pixar's \"sequel phase\" given that they have no sequels planned for the next decade...at the time I'm writing this review anyway. I just hope that they'll be able to handle the responsibility of making 2 original movies in 2020 without John Lasseter. Though Soul does have Pete Docter directing it, so I wouldn't be too concerned. Only time will tell if they'll gain \"Inside Out\" levels of acclaim.","displayName":"Jacob B","displayImageUrl":"https://graph.facebook.com/v3.3/1541003829471993/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":true,"createDate":"2019-11-16T17:56:53.288Z","updateDate":"2019-11-16T17:56:53.288Z","user":{"userId":"970980105","realm":"RT","displayName":"Jacob B","accountLink":"/user/id/970980105"},"score":5,"timeFromCreation":"Nov 16, 2019"},{"rating":"STAR_5","review":"Woody is back and about to go on a road trip with his new owner Bonnie and her new favourite toy ‘Forky' a toy she made herself on her first day at nursery.\nWoody takes it upon himself to play ‘Dad' to Forky who considers himself to be nothing but trash and throws himself in a bin at every opportunity.  When Forky escapes Woody goes after him and is re-united with Bo-Peep as well as having to watch out for a pull-string doll named Gaby Gaby who wants his voice box as hers is broken. \nThe ensuing adventure is just as much fun as the previous Toy Story films and is laden with comedy, classic film references and wonderful animation.\nAs well as making audiences laugh, Pixar are masters at pulling heart strings,with some very emotional moments and the ending is particularly bittersweet. Toy Story 4 is a wonderful ending to the exceptionally brilliant Toy Story saga.","displayName":"Ben T","displayImageUrl":"https://graph.facebook.com/v3.3/463762814420342/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-16T17:39:49.281Z","updateDate":"2019-11-16T17:39:50.688Z","user":{"userId":"978138218","realm":"RT","displayName":"Ben T","accountLink":"/user/id/978138218"},"score":5,"timeFromCreation":"Nov 16, 2019"},{"rating":"STAR_3_5","review":"Pixar made me cry again..... sigh. Beyond that, it was fun, but Toy Story has never been one of my faves. I liked it, but it still didn’t quite stack up to 3. I don’t really feel like I need to see anymore. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-16T06:20:45.981Z","updateDate":"2019-11-16T06:20:45.981Z","user":{"userId":"817591269","realm":"RT","displayName":null,"accountLink":"/user/id/817591269"},"score":3.5,"timeFromCreation":"Nov 16, 2019"},{"rating":"STAR_2_5","review":"If you never knew what Toy Story was, then it is a great film. However, after growing up with Toy Story I was a little disappointed that this is how it ended - I wanted more Woody and Buzz rather than new characters that never really needed to be there. Jessie didn't get the screen time she deserved, nor did the rest of the original gang.\n\nNevertheless, I enjoyed it - but if I ever need my Toy Story fix, I won't be reaching for this one, I will going straight for Toy Story 1 ‘and [not] beyond'.","displayName":"Georgeous S","displayImageUrl":"https://graph.facebook.com/v3.3/10157718708776424/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-15T20:58:06.582Z","updateDate":"2019-11-15T20:58:39.955Z","user":{"userId":"978390552","realm":"RT","displayName":"Georgeous S","accountLink":"/user/id/978390552"},"score":2.5,"timeFromCreation":"Nov 15, 2019"},{"rating":"STAR_4_5","review":"Great addition to such an iconic series that changed animated films. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-15T09:47:10.671Z","updateDate":"2019-11-15T09:47:10.671Z","user":{"userId":"260246891","realm":"RT","displayName":null,"accountLink":"/user/id/260246891"},"score":4.5,"timeFromCreation":"Nov 15, 2019"},{"rating":"STAR_4_5","review":"I want to start this off by saying that I am a huge Pixar fanboy but I was skeptical about the notion of making another Toy Story after the way Toy Story 3 left the series. Plus adding on to another already stellar trilogy is cause for concern. Now, sitting here writing this, I believe this is my favorite out of the four. The animation is the best in Pixar's relatively short history and the writing is almost as good. For some reason they left buzz on the back burner. Woody once again is sent through a life changing struggle that ultimately ends in a way I felt Toy Story 3 could have gone. However, the best character of the entire film is Forky, an innocent but thought provoking spork that just wanted to be trash. Once again, Pixar perfected what Disney was could not to do (looking at you olaf).","displayName":"Kenton V","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-15T01:21:00.060Z","updateDate":"2019-12-31T18:26:46.672Z","user":{"userId":"978387328","realm":"RT","displayName":"Kenton V","accountLink":"/user/id/978387328"},"score":4.5,"timeFromCreation":"Nov 15, 2019"},{"rating":"STAR_5","review":"Have to admit I like all the Toy Story movies","displayName":"David C","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-13T05:29:28.435Z","updateDate":"2019-11-13T05:29:28.435Z","user":{"userId":"3b293728-7604-4e5f-925f-e7e751a857f9","realm":"Fandango","displayName":"David C","accountLink":null},"score":5,"timeFromCreation":"Nov 13, 2019"},{"rating":"STAR_5","review":"Watch it on the plane. \nI'm happy for everyone that they find their own path in the end even though it's separate.","displayName":"Jia Z","displayImageUrl":"https://graph.facebook.com/v3.3/719533528557870/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-12T18:17:49.413Z","updateDate":"2019-11-12T18:17:51.452Z","user":{"userId":"978386056","realm":"RT","displayName":"Jia Z","accountLink":"/user/id/978386056"},"score":5,"timeFromCreation":"Nov 12, 2019"},{"rating":"STAR_2_5","review":"The Joker is a 2019 Drama/Thriller featuring the talents of Joaquin Phoenix and co. I personally really enjoyed this movie. From the amazing cinematography to the Oscar-worthy Score, this movie is one of the best to come out this year. Joaquin Phoenix's performance is one of the most mesmerizing performances I've ever seen on screen, the way he depicts his character is not realistic, but also deeply dark and disturbing to viewers. This man is able to creep out and disturb the audience just by laughing. No music or special effects needed. The plot, though flawed and at times unrealistic, is very, very dark and disturbing. I wouldn't recommend this movie to young audiences. To everyone else, though, this is a must-watch to not only become aware of many difficulties of the mentally ill, as well as why horrible things like what happens in this movie happens in real life.","displayName":"HaHa S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-12T10:01:33.681Z","updateDate":"2019-11-12T10:01:36.746Z","user":{"userId":"978385558","realm":"RT","displayName":"HaHa S","accountLink":"/user/id/978385558"},"score":2.5,"timeFromCreation":"Nov 12, 2019"},{"rating":"STAR_5","review":"Fun for the whole family with many jokes.","displayName":"Zach M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-11T15:50:40.933Z","updateDate":"2019-11-11T15:50:40.933Z","user":{"userId":"978198809","realm":"RT","displayName":"Zach M","accountLink":"/user/id/978198809"},"score":5,"timeFromCreation":"Nov 11, 2019"}]}