{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAzMDg4MTkiLCJlbXNJZCI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMDctMjlUMTY6NTI6NTYuODkxWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb19BRDU2RDIyOC1CMUU0LTREMkQtQUEzNy1FMDFCQkY4MzFFMjAiLCJlbXNJZCI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImUwYjI1YTZlLTJkNGYtMzY4OC1hZjI4LTQ5ZGY5NzhmNGE5NF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMDctMjlUMTk6NTE6NDMuNzkzWiJ9"},"reviews":[{"rating":"STAR_3_5","review":"very Entertaining. I have not seen all the TS movies but the story is self-contained enough so that did not matter.  Some of the younger children I went with thought some parts were a little boaring but I think that was due to some of the more mature themes that are in a lot of Pixar films.","displayName":"First L","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-29T19:51:43.793Z","updateDate":"2019-08-19T21:26:33.623Z","user":{"userId":"AD56D228-B1E4-4D2D-AA37-E01BBF831E20","realm":"Fandango","displayName":"First L","accountLink":null},"score":3.5,"timeFromCreation":"Jul 29, 2019"},{"rating":"STAR_5","review":"Pixar’s animation is SCARY good. Combine this with a heartfelt story and you get Toy Story 4. This installment has the same charm and wit as the previous three. This is a fantastic movie for children and adults alike.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-29T19:33:24.797Z","updateDate":"2019-07-29T19:33:24.797Z","user":{"userId":"260308850","realm":"RT","displayName":null,"accountLink":"/user/id/260308850"},"score":5,"timeFromCreation":"Jul 29, 2019"},{"rating":"STAR_5","review":"Shocked, sad and happy and beyond wowed by it.","displayName":"Cristian","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-29T19:30:55.166Z","updateDate":"2019-07-29T19:30:55.166Z","user":{"userId":"73CF9E85-016A-4359-A11D-EB42D462299A","realm":"Fandango","displayName":"Cristian","accountLink":null},"score":5,"timeFromCreation":"Jul 29, 2019"},{"rating":"STAR_3","review":"Weird story. An evil doll reminiscent of Chucky commands a strange army of other evil toys.  Then, the evil toy dreams of mutilating other toys to suit an obsession.  Ummmmmmm.   Ok.   \n\nThe whole story was a poor end to a series.  Honestly, maybe the whole thing shouldve stopped after 1.","displayName":"KYDad90","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-29T18:45:48.752Z","updateDate":"2019-07-29T18:45:48.752Z","user":{"userId":"f5a01a49-9a06-4339-9df4-cfd50584a1fe","realm":"Fandango","displayName":"KYDad90","accountLink":null},"score":3,"timeFromCreation":"Jul 29, 2019"},{"rating":"STAR_3","review":"The comedy between Ducky and Bunny was great. The theme the movie pushed was too on the nose and felt forced. ","displayName":"James Q","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-29T18:24:06.308Z","updateDate":"2019-07-29T18:24:06.308Z","user":{"userId":"978009550","realm":"RT","displayName":"James Q","accountLink":"/user/id/978009550"},"score":3,"timeFromCreation":"Jul 29, 2019"},{"rating":"STAR_5","review":"Love it it made me laugh and it made cry this is the best one yet","displayName":"Lisa Marie  S","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-29T18:22:00.933Z","updateDate":"2019-07-29T18:22:00.933Z","user":{"userId":"4899ebb4-3500-423e-80f8-ea3819d7e017","realm":"Fandango","displayName":"Lisa Marie  S","accountLink":null},"score":5,"timeFromCreation":"Jul 29, 2019"},{"rating":"STAR_5","review":"loved. that moment with the lost girl was great. it was a great conclusion to Woodys story. I was really impressed with the whole lost toys story. it was all so great. ","displayName":"Jonathan B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-29T17:44:14.490Z","updateDate":"2019-07-29T17:44:14.490Z","user":{"userId":"969196593","realm":"RT","displayName":"Jonathan B","accountLink":"/user/id/969196593"},"score":5,"timeFromCreation":"Jul 29, 2019"},{"rating":"STAR_5","review":"Super cute. Lots of laughs for adults and kids. Great family movie","displayName":"Jennifer Rosenstein","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-29T17:35:33.631Z","updateDate":"2019-07-29T17:35:33.631Z","user":{"userId":"707ea208-effe-48ad-a552-0f71ab834b15","realm":"Fandango","displayName":"Jennifer Rosenstein","accountLink":null},"score":5,"timeFromCreation":"Jul 29, 2019"},{"rating":"STAR_4_5","review":"Just when you think a beloved story has reached the end, completed with a perfectly polishing bookend, there is surprisingly another chapter that takes it further; although questioned whether it is necessary and will it take it further to a new impactful direction – only if it still can be impactful if the franchise is not tired yet. The groundbreaking original \"Toy Story\" explored the relationship between inanimate object and children, only to discover the former, in plural, that the toys are alive with accustomed feelings that fuels loyalty and the need to be played with. The sentimental resonance is expressed in different ways after each chapter, including the shorts, and the supposedly concluding chapter \"Toy Story 4\" justified the further continuation with the emotional meaningfulness still ever intact for a more solidifying finale.\n\nEver since being donated to Bonnie, Andy's former childhood toys are much happier from livelier playtime with the little girl. Woody's rebooted bond with a new kid is instant as he always believes that a toy is always there for the kid, which led him to witness Bonnie's newly-created, crafted toy Forky capturing her young imaginative eyes, but the self-proclaimed trash declared otherwise when refused to be played as a toy. As the family went on a road trip with Bonnie taking the whole gang, it is up to Woody to show Forky the important role he now plays and why he should embrace the new status, but gets soon sidetracked into reuniting with his long-lost friend Bo Peep whose life on the road made her more daring and provides a new insight that will open Woody's eyes.\n\nAfter how the predecessor ended in remarkable perfection, a continuation would be met with initial doubt. Besides the treated bonus shorts released over the years afterwards in delivering more into the beloved characters' new life, a feature would need to be the final thread to the thematic core. Albeit feeling the somewhat little muddling narrative that fourth chapters tend to pace with in comparison to the previous entries and following up the best, the writing team managed to form ideas and wholesomely delivered, as well in particularly further expressing the relationship between a child and a toy from building to [fully] losing one and a toy finding its purpose. After this film, it has pretty much covered everything over the subject across the span of four films.\n\nLike each film being a toy line's latest series, it welcomes new likable characters that fits into the already-existing assortment, adding additional energy to the original. Joining the gang is Forky with Tony Hale providing much comic relief to the toying definition as well searching for the purpose with uncertain acceptance. Then around Bo Peep's clan is Giggle McDimples vocally lend by Ally Miki, Duke Caboom being another reviving brick for Keanu Reeves' stardom, hanging duo Ducky and Bunny channeling \"Key & Peele\" antics nicely for predicted amusement, and collecting dust in an antique store is Christina Hendricks' Gabby Gabby with a sympathetic depth. The new characters and additional cast easily becomes part of the series' fun soulfulness that the original cast been building from their in-synced charismatic performances since the beginning, which is in another way of looking at their efforts is functioning the heart and resonating emotional value while providing clever humor.\n\nNow this film would have been rated at four stars for the series' new low considering some decisive turns that could have been better polished than being utterly nonsensical, even if they were sources for needed plot motivation in order to reach the destined point, but \"Toy Story 4\" again marks how much computer-generated animation has technologically evolved as seen in detailed glaring reflection and facial expressions being more stretched out. It fuels the emotional range by diegetic perspective, which is where the tears started being drawn near the end for an unexpected game-changing decision for one character's truly epic journey. Imperfectly heightened to only be ranked the second best, and furthermore not at the same level nor greatly praised as \"The Hidden World\" being this year's top contender for Best Animated Feature over this one, it is nonetheless a solid chapter under final narrative assumption with justified continuation and ever loving heart to be another Pixar masterpiece – in honor to their groundbreaking achievement that has reached infinity and beyond. (That probably sounded corny). (A)","displayName":"Kyle M","displayImageUrl":"https://graph.facebook.com/v3.3/100001513380747/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-29T17:04:23.222Z","updateDate":"2019-07-29T17:04:23.222Z","user":{"userId":"907803058","realm":"RT","displayName":"Kyle M","accountLink":"/user/id/907803058"},"score":4.5,"timeFromCreation":"Jul 29, 2019"},{"rating":"STAR_3","review":"Good movie but my least favorite of the toy story franchise. TS4 didn’t incorporate the other characters as well but still came up with a good storyline. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-07-29T16:52:56.891Z","updateDate":"2019-07-29T16:52:56.891Z","user":{"userId":"260308819","realm":"RT","displayName":null,"accountLink":"/user/id/260308819"},"score":3,"timeFromCreation":"Jul 29, 2019"}]}