{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNTI1MDYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDFUMDk6NTE6NDAifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNTI1NDUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDFUMTA6MTc6NTkifQ=="},"reviews":[{"rating":"STAR_5","review":"This is one the greatest most well put together films I have ever seen. So many movies before it had trouble juggling too many characters such as Spiderman 3. And the amazing Spiderman 2. And even the justice league. And I've noticed a lot of people don't seem to understand that these films are a series all leading up to one main story line. So saying you were lost because you didn't watch the other films in the series is like watching the last season of a tv show and complaining or even watching the final Harry potter film and being upset because you dont know what the other 6 films were about. I know a lot of people on here like to talk Shi t about marvel films because unlike a lot of films they're actually good and the give the audience what they want. Not everyone likes them sure the human race cant all be in agreement on one thing I hate the movie avatar yet thats the biggest movie of all time and a lot of people seem to love it I dont deny that avatar is a big film and the cgi is amazing it just wasn't my taste. If you dont like the infinity war movie then just say you didn't like it no need to go crazy and tell people not to see it or say it's a waste of money and people who like it are stupid. It's a matter of opinion you can't be stupid for having an opinion. The majority of people seem to like like film hence the high rating. Also ROTTEN TOMATOES ISN'T AN EVIL COMPANY THAT GIVES HYPE TO MARVEL FILMS JUST BECAUSE. IT'S A WEBSITE THAT POSTS REVIEWS OF FILMS FROM EVERY CRITIC. IF YOU DON'T LIKE ROTTEN TOMATOES GO READ EVERY NEWS PAPER AND EVERY ARTICLE FROM ANY REVIEW FROM ANY CRITIC AND THE OUTCOME WILL BE THE SAME. I DONT UNDERSTAND HOW NO ONE UNDERSTANDS THIS.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/144973313018601/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T10:17:59.000Z","updateDate":"2018-05-01T10:37:16.000Z","user":{"userId":"977252545","realm":"RT","displayName":null,"accountLink":"/user/id/977252545"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"50% fresh on the Tomatometer. Apparently only half of people were blown away by this.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10156618677026686/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T10:16:48.000Z","updateDate":"2018-05-01T10:18:36.000Z","user":{"userId":"977252543","realm":"RT","displayName":null,"accountLink":"/user/id/977252543"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_4_5","review":"Really great! Worth the wait! You'll love it mate! Don't hate, appreciate!","displayName":"Jeffrey M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T10:12:09.000Z","updateDate":"2018-05-11T13:44:51.000Z","user":{"userId":"977130781","realm":"RT","displayName":"Jeffrey M","accountLink":"/user/id/977130781"},"score":4.5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"Not PERFECT but the best Marvel movie ever made. Go see it.","displayName":"Thomas O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T10:09:47.000Z","updateDate":"2018-05-02T16:46:06.000Z","user":{"userId":"977252534","realm":"RT","displayName":"Thomas O","accountLink":"/user/id/977252534"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"This is just the beginning of the culmination of 22 eventual movies concluding in the most spectacular fashion. I hope that these effects felt in infinity war have to be given a great sacrifice in order to achieve victory.","displayName":"David N","displayImageUrl":"https://graph.facebook.com/v3.3/629996135/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T10:06:41.000Z","updateDate":"2018-05-01T10:12:09.000Z","user":{"userId":"796564095","realm":"RT","displayName":"David N","accountLink":"/user/id/796564095"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_3_5","review":"\"It's all been leading to this\" intones Tony Stark ominously in the trailer for Marvel's latest big budget extravaganza. It's true that all trailers try to build up the importance of the film they are advertising but this time around these words hold extra significance. After 10 years and 18 separate movie releases this really does feel like the end of an era. (Or at least the beginning of the end. A yet-unnamed sequel to Avengers: Infinity War is due for release next summer). It feels fitting that this line is uttered by the same man who started us off on this path with the first Iron Man movie, the surprise summer hit of 2008.\n\nNo-one is under the illusion that Marvel Studios will simply dissolve after this two-part epic. However they have been keen to stress that these films are the apex of the massive three phase arc that each film has been a complimentary chapter of up until this point. There will continue to be Marvel films released after 2019 but what form they may take is anyone's guess at this point. We have been promised the largest and most ambitious crossover event in cinema history (inspiring a running meme on Twitter no less) and we have been led to expect the biggest cast ever assembled, action on an unprecedented scale and some shocking twists including the deaths of some fan-favourite characters previously protected by Vibranium strength plot armour. To say this film is heavily anticipated would be something of an understatement.\n\nIt's nearly impossible to judge a movie like Avengers: Infinity War as a standalone film as it is in no way standalone and never attempts to be. There simply hasn't been a movie release like this before. In some ways it feels like the typical climax movies of previous large fantasy series like Star Wars or Harry Potter but even then those films had a simple through-line of following a couple of central characters on a single voyage towards a foreshadowed ending. In other ways it more resembles those classic disaster movies of the 70s like The Towering Inferno or Earthquake where a immense cast of famous faces would be brought together to deal with an unexpected threat together. Outside of film, what it most feels like is the season finale of a large budget TV show where fans are given the full stop on various stories that have been building over hours of previous screen time in a way that feels like a reward to those watching religiously while utterly baffling to the casual viewer.\n\nWhat Marvel have achieved over the last decade cannot be overstated. They have taken characters like Iron Man and Black Panther which were previously only known to comic fans and turned them into household names at the centre of our cultural conversation. They have straight into tonally riskier material such as the potentially po-faced moralising of Captain America, the overtly-Shakespearian mythology of Thor and the self-ridiculing daftness of Guardians of the Galaxy and have not just made each work effectively but to sing. In direct contrast to the mostly grimy, muddled and unpleasant atmosphere of the DCEU, Marvel have managed to have some fun with their worlds, always ready with an arched eyebrow and a sarcastic quip about their own inherent silliness, but importantly have never done so at the expense of their characters who remain strong, consistent and often surprisingly complex considering the stories they exist within.\n\nWhen the first Avengers movie (named Avengers Assemble in the UK) was released in 2012 is was awaited with consternation. How could one film simultaneously act as a sequel to five separate standalone origin stories with their own complicated backstories and unique mood? Somehow Joss Whedon's masterful film managed to successfully feel like the sum of it's parts, giving each character their own moments in the centre of frame while gaining both drama and deep laughs from their clashing personalities. It even found time for a propulsive plot featuring some of the best action of the series to date. It's still an impressive highpoint in the MCU's various achievements. The second Avengers film (Avengers: Age of Ultron) sadly did fall prey to many of the issues that were expected of the first. Introducing yet more characters, settings and mythology into the mix, Age of Ultron became bloated and unwieldy under the strain, stranding characters in their own standalone arcs which seemed to exist solely in service of the various convoluted beats of the plot required to not just continue that film but also start setting up the next one. This raises many questions for Infinity War which boasts a cast larger than both previous Avengers movies combined and makes them look almost quaint in comparison to it's sheer magnitude.\n\nThe big question then is whether the actual film can live up to this hype. The answer to that thankfully is yes, it will, but at what cost? The scale is suitably massive. The stakes are higher than they have ever been in any superhero film in recent memory, the action jumps all over the universe to scenes on various different, and visually diverse, cosmic locations (including, amusingly, Edinburgh, where a 'We Deep-fry Kebabs' sign is clearly visible in a background takeaway window at one point!) and there are so many characters crammed in here you'd think the film would fail to send.\n\nThe film is directed by the Russo brothers who impressed with their deft work on the 2nd and 3rd Captain America movies (which both contain some of Marvel's better moments) and the script is by Christopher Markus and Stephen McFeely who wrote all three Cap movies (as well as the muddled, disappointing 2nd Thor film). These seem sensible choices and for the most part they succeed in balancing the various disparate elements required to make the story work. Not a single frame of this film is wasted and the pacing is breakneck, thrusting us from one dramatic confrontation to another with barely a chance to breathe until the credits finally roll over two and a half hours later. The concern, however is that they have traded scope for depth as we don't get any real downtime with which to take stock of previous events or remember the personal and emotional stakes behind all this talk of world-ending destruction. For a film that is so epic and so mercenary with it's character's mortality it feels oddly lightweight. This is a film which puts popular franchise characters at risk constantly and expects you to feel scared for them purely based on connections you have made in previous films as it simply does not have time to remind you why you should care about them a second time. Whether this gamble pays off really depends entirely on how personally invested you are in the previous films leading up to this one.\n\nBased on audience reactions this was a smart move. The crowd at my screening whooped and cheered (some people literally fist-pumped with excitement at one moment) and audibly gasped in horror at various plot points in amongst the laughter. And there was a lot of laughter. Despite the dark subject matter and increased lethality, this somehow still manages to be one of the MCU's funniest films. Character interactions have always been the MCU's greatest superpower which they employed with full force here as they keep finding new and interesting pair-ups to create awkward buddy comedy with.\n\nIn keeping with the studio's history, much of the heavy lifting is given over to Iron Man (Robert Downey Jr.). Tony Stark has always been the most nuanced and compelling of the Marvel leads and has had the most intricate character arc over the course of his various appearances. Having mostly overcome his vices of arrogance, indifference and an inability to concede control or respect authority in his previous adventures, this film requires him to relapse back into his worst traits to create the necessary tension to drive his story home. The film smartly strands him alone with Peter Parker (Tom Holland) and Dr Strange (Benedict Cumberbatch) for the majority of his scenes: the precocious Spider Man representing Stark's intentions to retire into a much less cavalier mentor role while the Sorcerer Supreme (another vainglorious man of power and privilege) feels like a mirror image of Tony's younger, still egocentric self. Importantly he is also kept apart from Pepper Potts and Steve Rogers who have each acted as his better angels in the past. Knowing the world is at risk it feels natural that he would feel like the only man capable of saving it. (Hilariously, just as Stark and Strange are starting to overcome their initial disdain for each other, they are introduced to Chris Pratt's Star Lord: possibly the only man in the universe more cluelessly self-important than they are).\n\nHowever it would be wrong to describe Iron Man as the film's central character. The focus is constantly shifting between the film's huge ensemble. If anyone has a chance of being a classic lead it would actually be Thanos (Josh Brolin). The villains of Marvel films are often their weakest link but this has been a trend they've been improving of late. It's a clever move on their part then to make Thanos into a sort of villain protagonist which allows him the required screen time to build character while each of the series' erstwhile heroes act simply as obstacles in his path. The Mad Titan could have come across as yet another cackling megalomaniac but is instead imbued with a sense of doleful determination. Thanos takes no pleasure in his genocidal actions but instead sees his murderous goal as some kind of tragic burden. Blaming the universe's various problems on overpopulation, he treats humans (and the various humanoid aliens) as if they are wild animals of which half the population must be culled for the good of the herd. It's a compelling argument (and sadly one often genuinely argued by various psuedo-intellectuals in the real world). Although grotesque and monstrous in action, Thanos, as a character, appears almost admirable in the grit with which he executes his grim task.\n\nThe moustache-twirling moments are instead given over to his henchmen. Based on The Black Order from the comics (here renamed the Children of Thanos) they do most of the sneering and stabbing on his behalf. Despite one of them (the awesomely named Proxima Midnight) being played by the brilliant Carrie Coon (Fargo, The Leftovers) they dont make too much of an impression apart from maybe Tom Vaughan-Lawlor's Ebony Maw who slithers through his scenes with impressively slimy condescension. In general, the film's villains are better than they need to be for the film to work and are above average compared to Marvel's spotty track-record but no-one comes close to the haunting, charismatic power of Michael B. Jordan's Killmonger from this February's Black Panther.\n\nOther classic Avengers characters are given a shorter shrift of the overloaded screen time. Both Captain America (Chris Evans) and Black Widow (Scarlett Johansson) inspire cheers when they first swagger on screen but neither gets more than a handful of lines to play with. Many of the films heroes don't get much to do beyond simply being heroic. Although I'll admit there's a certain subversive thrill to watching Steve Rogers, the walking embodiment of American values and decency, stripped of his stars and stripes, at odds with his corrupt government and standing shoulder to shoulder with Black Panther (Chadwick Boseman) in the fight against a fascistic despot. Although his new beard and dark uniform act as visual metaphors for his switch from the American military's champion to it's pariah, you can't help but cynically suspect that this (as well as his ally Black Widow's new blonde bob) is intended more to make Infinity War action figures stand out against previous models than to act as a symbol of character development.\n\nThor (Chris Hemsworth), humbled and hurt by the events of last year's Thor: Ragnarok, spends much of the film separated from his Avengers teammates acting more like a noble, classical hero setting out on a solo mission. Thankfully the film pairs him up with the Guardians of the Galaxy which gains a lot of chuckles at their contrasting reactions to having a literal god join their team and allows Rocket Racoon (Bradley Cooper/Sean Gunn) to build on the deepening of his character at the end of last year's Guardians of the Galaxy Vol. 2. (Thor's storyline also includes the surprise appearance of another popular TV actor whose reveal I won't spoil in this review.)\n\nThe characters' given the most melodramatic of plot lines are surprisingly Vision and Scarlett Witch. Being a walking, breathing avatar of one of the Infinity Stones (the much sought after McGuffins that Thanos seeks in order to complete his plan) it makes sense that Vision would be more at risk than any of our other heroes but the previous films have done little to make us care at all about his wellbeing or even clarify the existence of the apparently quite intense relationship he shares with Scarlett Witch. Thankfully both Paul Bettany and Elizabeth Olsen are talented actors and they do just enough to make their scenes engaging even without the prior build-up to make them truly powerful. Speaking of the Infinity Stones, they have often seemed fairly dull bits of fan-service thrown into previous Marvel films solely to hint towards their inevitable appearance in this one. Sadly they haven't become any more interesting by this film's release and are still fairly bland plot devices. Thankfully, like in their previous appearances, they simply serve the purpose of kicking things into action so we can enjoy the ride.\n\nAnd the ride is enjoyable. The banter remains as pointed as ever and the film's signature moves: namely A) gaining laughs from their heroes clashing personalities and reactions to each other's ridiculousness, B) character's revealing how petty and human they are despite their preternatural abilities and C) action scenes cleverly built on our warriors combining their powers and skills in inventive ways; never get boring no matter how many different variations on a theme the film manages to trade in on. It's sharply written stuff and endlessly entertaining. The film is not without it's flaws but it's unlikely any of them will matter to it's core audience.\n\n\"This film was made for fans, not critics\" is a common refrain on internet message boards and is always trotted out every time a new release based on a property with a particularly strong or geeky fandom fails to live up to expectations. It's generally a nonsense phrase which is both unfair to critics (by suggesting that they are incapable of being fans themselves) and the fans (who it suggests are incapable of real critical thought or undeserving of better quality filmmaking). However Avengers: Infinity War may be the one case where it's an accurate assessment. It's shockingly overstuffed, chaotic, muddled and somehow feels both too long and far too short for it's knotty but weightless plot. However it's purpose is to give fans the long awaited crowning glory crossover that they have been promised in some shape or form since Samuel L Jackson's brilliant surprise cameo at the end of Iron Man 10 years ago assuring bigger things to come and there is no denying that it delivers exactly that. It's a smart, bold, risky piece of filmmaking and it mostly works but most importantly it will take it's biggest fans on a journey that will inspire thumping hearts, tears, giggles, spontaneous applause and finally stunned silence at the startling power of it's brave, shocking cliffhanger ending. For the devotees in the crowd with their bodies clad in Marvel merchandise and their hearts in their throats the Avengers will have triumphed over adversity yet again. But in the eyes of this dastardly critic, maybe old Thanos has a point, and the excision of half of the Marvel Universe might just make what's left just that little bit more efficient.\n\nFrom MOGULAMANIA Blog:\nhttps://mogulamania.blogspot.co.uk/2018/04/new-release-review-avengers-infinity-war.html","displayName":"Das M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T10:05:46.000Z","updateDate":"2018-05-08T10:36:24.000Z","user":{"userId":"977226605","realm":"RT","displayName":"Das M","accountLink":"/user/id/977226605"},"score":3.5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"The best movie in the univere, i like the villain, i love thanos is the BETTER.aguante nicolas amelio ortiz. suscribite zepfilms-.","displayName":"Santiago M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T10:00:43.000Z","updateDate":"2018-05-01T10:03:42.000Z","user":{"userId":"977252521","realm":"RT","displayName":"Santiago M","accountLink":"/user/id/977252521"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"Giant Masterpiece!!!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1847391578645549/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T09:57:34.000Z","updateDate":"2018-05-01T09:59:29.000Z","user":{"userId":"977252516","realm":"RT","displayName":null,"accountLink":"/user/id/977252516"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"My boo and I saw Avengers: Infinity War yesterday and it was action packed from beginning to end. Best Avengers movie yet! It leaves you in suspense at the end too. Can't wait for the second one. We must see it again because so much happened that it's possible to have missed some things the first time around. Yeah...definitely seeing it again. Thanks to all the staff, cast, and the Russo brothers for a great movie. Can't wait to see whatcha guys gonna do in the next one. I hope you add more Marvel characters along with the return of Ant-Man and Hawkeye. But one things for sure whatever you do I just know that it's gonna be AWESOME! I can't wait!!!??","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/804983036366988/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T09:53:11.000Z","updateDate":"2018-05-01T10:12:52.000Z","user":{"userId":"977252511","realm":"RT","displayName":null,"accountLink":"/user/id/977252511"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"Filme ótimo , momentos emocionantes , uma montanha russa de emoções melhor dizendo .","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/309752949555870/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T09:51:40.000Z","updateDate":"2018-05-01T09:52:18.000Z","user":{"userId":"977252506","realm":"RT","displayName":null,"accountLink":"/user/id/977252506"},"score":5,"timeFromCreation":"May 01, 2018"}]}