{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAxMjMxMjYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMTY6NDM6MTguMDMxWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY5MzQwNDAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMTY6NTU6MzUifQ=="},"reviews":[{"rating":"STAR_5","review":"It drops everything you know about super hero movies, it has a slow build up that leads to a beautifully saddening ending that's changed my perception of marvel all together","displayName":"Gabe S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T16:55:35.000Z","updateDate":"2018-04-28T16:56:56.000Z","user":{"userId":"976934040","realm":"RT","displayName":"Gabe S","accountLink":"/user/id/976934040"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Stunning movie. Remember, if you're disappointed with the ending, THERE IS A FOLLOW UP MOVIE! #CaptainMarvel","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10155894650144844/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T16:54:39.000Z","updateDate":"2018-04-28T16:56:37.000Z","user":{"userId":"977246806","realm":"RT","displayName":null,"accountLink":"/user/id/977246806"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4_5","review":"Being pulled and pushed from action intensive scenes with just the right amount of (dark) humor was a joyous experience that had me smiling nearly the whole time. It was like being a kid again, and that's what I think appeals to me the most about these films. They are fun and entertaining on a basic level that is just simply satisfying. And then they went and ended the movie in a way that appeals to my adult side, the one who is tired of trite conclusions to predictable movies!\n\n(fanboy mode: engage; skip ahead if necessary)\n\nThor finally gets a great character arc! He is far too underrated in the MCU and Chris Hemsworth does not get nearly enough credit for his talents. \n\nSo in conclusion: I know you're already watching, have a ticket, or picked a day and time to go see it. So enjoy!\n\n(If you aren't sold on the film's premise, then I encourage you to just go, turn off your brain, and let the cathartic energy of brilliant colors and ka-booms guide you through a simple, if frantic, movie that knows how to have fun.","displayName":"Matt H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T16:53:37.000Z","updateDate":"2018-04-28T17:07:38.000Z","user":{"userId":"906892407","realm":"RT","displayName":"Matt H","accountLink":"/user/id/906892407"},"score":4.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_3_5","review":"Since this movie is to judged on it's own (according to the filmmakers), we wound up being very disappointed.  If this was Part 1 with Part 2 coming next year, we would understand better and would rate the film higher.  However, be that as it may, to understand what is going on you do need to watch the first 17 films of the MCU because there is no storyline it establishes.  The opening scene near the end of the first battle which includes the death of a beloved character, and the battles rage on without any kind of supporting story for the film.  We have seen most of the infinity stones Thanos is collecting but there is 1 not previously featured and at least one that has a power never previously discussed or demonstrated.  Yes, it was great seeing that many super-heroes together but at the end of the film, we were left questioning what kind of film will Marvel have in 2019 when the next Avengers film is to be released.  We saw characters fall apart into what looked like leaves and drift into the air but what was it and what caused it?  And because of that it also makes us wonder how some of those characters are going to have their own movie within the next few years as we were told they would.  As a Marvel Studios movie goes, I don't think it was up to the Marvel standard when the results are Avengers=0, Thanos=100.","displayName":"Pete 'n Eddie D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T16:53:35.000Z","updateDate":"2018-04-28T17:04:42.000Z","user":{"userId":"977228113","realm":"RT","displayName":"Pete 'n Eddie D","accountLink":"/user/id/977228113"},"score":3.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"10 Years Ago, Kevin Feige Started A Universe of Marvel's Most Beloved Superheros & He Made A Promise With Us That To Bring A Culmination of The Entire MCU That Has Never Seen Before.\nHe Did It....!","displayName":"Sherry S","displayImageUrl":"https://graph.facebook.com/v3.3/1004417272976129/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T16:52:01.000Z","updateDate":"2018-05-17T07:53:38.000Z","user":{"userId":"974422487","realm":"RT","displayName":"Sherry S","accountLink":"/user/id/974422487"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"It was one of the most interesting Marvel movies that I've seen. It is a combination of action and emotional scenes that are sure to make you amazed on all the action-packed fights. At the same time you'll tear up from all the major character deaths. The movie was certainly the full package when it came to the action scenes througout the movie and with a lot of people even crying in the theater through the movie.","displayName":"Benedict C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T16:49:43.000Z","updateDate":"2018-04-28T17:03:57.000Z","user":{"userId":"977246793","realm":"RT","displayName":"Benedict C","accountLink":"/user/id/977246793"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_2","review":"Worst Avengers...hated the movie","displayName":"Andrew M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T16:49:02.000Z","updateDate":"2018-04-28T17:01:37.000Z","user":{"userId":"977246788","realm":"RT","displayName":"Andrew M","accountLink":"/user/id/977246788"},"score":2,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4_5","review":"Avengers Infinity War is an amazing film with high stakes and meaningful character arcs. The ending was unexpected, but I loved it nonetheless. The film looks fantastic and is all around visually stunning, but some of the cgi characters (especially Proxima Midnight) look fake. This, while not ruining the movie all together, was distracting and took me out of the experience. The focus on character instead of action was brilliant, even more so when you remember that this is a superhero flick. I give this epic and marvelous film a 4.5 out of 5.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T16:45:27.254Z","updateDate":"2018-04-28T16:45:27.254Z","user":{"userId":"977103652","realm":"RT","displayName":null,"accountLink":"/user/id/977103652"},"score":4.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4_5","review":"After 6 years of build up this movie gives a great pay off. The characters are well juggled while some, who have been around since Phase One were under-minded, but while some characters are left slightly famished in content others are over stuffed. Like Thanos, the mostly arguably greatest Marvel Villain ever is an amazing character, as well as Thor, who is given real emotions compared to Thor Ragnorok where he is put in for 12 punchlines, another great character is Gamora, who finally for the first time in a while genuinely reacts to the attack of Thanos the right where, and has a great end to an arc. Overall this movie does a lot of good with the characters, while some are under fed the characters are great. The plot is very generic though. Except for the end which if you're a comic book fan then you won't be impacted. The plot is several McGuffins put together, but the only difference of the other plots like  this is that the villain succeeds. Although if you think about it Teenage Mutant Ninja Turtles: Out of The Shadows has the same plot, except that the villain is stopped in the same movie. So to sum it up, amazing characters, mostly, but a very different plot that isn't horrible, but isn't 100% original. The plot is a mixture of Empire Strikes Back, and any movie with a McGuffin.","displayName":"Supa C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T16:45:27.000Z","updateDate":"2018-05-30T14:39:54.000Z","user":{"userId":"977246776","realm":"RT","displayName":"Supa C","accountLink":"/user/id/977246776"},"score":4.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4_5","review":"The movie was fantastic! Only knocked off half a star because the ending will drive me insane until next May when the next movie is released. Awesome acting and effects. Will probably see it again in theaters. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T16:43:18.031Z","updateDate":"2018-04-28T16:43:18.031Z","user":{"userId":"260123126","realm":"RT","displayName":null,"accountLink":"/user/id/260123126"},"score":4.5,"timeFromCreation":"Apr 28, 2018"}]}