{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY2MzgyMTkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDMtMDNUMDU6MjM6MTMifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Mjc4NDE2MDQiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDMtMTJUMTQ6MjA6NDAifQ=="},"reviews":[{"rating":"STAR_5","review":"WOW this movie blew me away. I wanted this movie to be great and they exceeded my expectations","displayName":"Payton S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-12T14:20:40.000Z","updateDate":"2018-10-12T21:19:38.000Z","user":{"userId":"927841604","realm":"RT","displayName":"Payton S","accountLink":"/user/id/927841604"},"score":5,"timeFromCreation":"Mar 12, 2018"},{"rating":"STAR_5","review":"Infinity War is a breathtaking experience that effortlessly balances a numerous amount of characters and storylines building in the MCU since the first Iron Man back in 2008. It's scope and scale is of the likes of a Lord of The Rings film. And it features one of the best villains put to screen,  Thanos stands next to the likes of Darth Vader, and The Joker with confident and motivated ease.","displayName":"Zechariah H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-12T11:44:43.000Z","updateDate":"2018-07-02T14:24:30.000Z","user":{"userId":"933336010","realm":"RT","displayName":"Zechariah H","accountLink":"/user/id/933336010"},"score":5,"timeFromCreation":"Mar 12, 2018"},{"rating":"STAR_3_5","review":"While Infinity War was not the best Marvel movie to date, it certainly was a brilliant humourous but serious film. In the first half, there were many different characters and story lines and it was like waiting twenty minutes for that character to appear again because of everything they had to cover. However, the scenes were still very good and very humouring especially with the scenes of Thor, the Guardians and Spider-Man. It picked up its pace in the second half, with intense battles and a surprising ending. This film has absolutely demolished DC-lovers complaints about poorly written villains and no real stakes. This is a must-see for anybody, but Marvel fans will be the only ones to fully understand the complexity, story lines and characters of the film.","displayName":"Mystic M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-09T19:39:57.000Z","updateDate":"2018-04-29T02:43:01.000Z","user":{"userId":"977156251","realm":"RT","displayName":"Mystic M","accountLink":"/user/id/977156251"},"score":3.5,"timeFromCreation":"Mar 09, 2018"},{"rating":"STAR_4_5","review":"Im going to see it again and it will be IMAX. It was everything I was hoping for and more. So many people were laughing, screaming and sobbing. If you care about the MCU you may too.","displayName":"Byron S","displayImageUrl":"https://graph.facebook.com/v3.3/601087568/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-07T14:34:42.000Z","updateDate":"2018-04-30T14:33:31.000Z","user":{"userId":"870994731","realm":"RT","displayName":"Byron S","accountLink":"/user/id/870994731"},"score":4.5,"timeFromCreation":"Mar 07, 2018"},{"rating":"STAR_5","review":"I absolutely loved it. The storyline was not hard to follow for those who were previously familiar with the characters and it was both sad and humourous, setting up avengers 4 perfectly.  It was not hard to sit for 160 minutes at the cinema asi it felt like i was only there for an hour at the most..yhats how intriguing the plot was for a regular old marvel junkie like me.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1791196010944200/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-07T06:47:15.000Z","updateDate":"2018-04-27T12:39:41.000Z","user":{"userId":"977151998","realm":"RT","displayName":null,"accountLink":"/user/id/977151998"},"score":5,"timeFromCreation":"Mar 07, 2018"},{"rating":"STAR_5","review":"Wow. AVENGERS: INFINITY WAR is a movie like no other. It is definitely a movie 10 years in the making with real consequences and a badass, well-thought-out villain. Some Avengers do shine brighter than others, but all have a moment to shine. The Guardians work perfectly with the now hilarious Thor and the Iron Man, Spider-Man and Doctor Strange trio. The battle scenes in this movie are amazing to watch and Thanos is definitely a highlight and stands out. This movie is best seen by avoiding ALL spoilers, as it will give you the most shock and awe. 'Avengers: Infinity War' is a must see and is worth every bit of your time.","displayName":"Leo L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":true,"createDate":"2018-03-06T02:48:27.000Z","updateDate":"2019-12-01T10:02:04.868Z","user":{"userId":"976130346","realm":"RT","displayName":"Leo L","accountLink":"/user/id/976130346"},"score":5,"timeFromCreation":"Mar 06, 2018"},{"rating":"STAR_3","review":"In the Marvel world, this one was a tuff watch. You feel compelled to watch, but it was a tuff watch.","displayName":"Kristen M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-05T19:40:59.000Z","updateDate":"2018-05-19T15:52:42.000Z","user":{"userId":"976919484","realm":"RT","displayName":"Kristen M","accountLink":"/user/id/976919484"},"score":3,"timeFromCreation":"Mar 05, 2018"},{"rating":"STAR_4","review":"This film is too much, too soon. Even with 10 years and 19 films to prepare, Infinity War feels rushed with too much happening and too many characters to service. There are several heroes who have little to nothing to do and who's absence would not affect the film in any way and unfortunately, this includes some of the MCU's most iconic characters. This is exacerbated by the detail placed on the films villain Thanos. Thanos is a great addition who has his origins, motivation and true power all introduced into the movie. Unfortunately, whilst these are some of the strongest moments in the film, it gives even less time to the heroes and more specifically the titular team, the Avengers. This film should have been restructured as a Thanos film and once he is introduced, then a follow up Avengers film, one which focuses on the heroes, not on Thanos. \nThe CGI in this film also ranges from good to awful but I never found myself saying wow. The opening scene shows Thanos and his minions and the CGI on the minions threw me out of the film immediately, it was just bad. The CGI on certain heroes also looked bad. For example, Iron Man's suit looks worse than in his debut solo film 10 years ago, how can this be? There is an overabundance of CGI as most of the film relies on action over story. There are too many actions scenes which have funny looking CGI people fighting other funny looking CGI people and this is all made worse by the choppiness of the filming. The film insists on cutting to another angle everyone and a half seconds and this is not a problem limited to Infinity War, but it has been used in the MCU for far too long now. Where are the Daredevil-esque one shot fight scenes?\nThe humour has long been a problem for me as well. Humour works in comic book movies, it adds light to a genre that could otherwise be so dark and gloomy, however with so many forced, child friendly jokes, this film (again, along with the rest of the MCU) feels too light for the gravity of this world ending situation. The odd joke or two would not go amiss but it just takes the humour too far. \nUltimately with little story, too many characters and poor CGI, this film was a disappointment and not worth the wait. It far from gets me excited for the next Avengers film. Instead I'm left wondering if I'll even bother going to see the next film in the cinema or just wait for a Blu Ray release. It has really hit home that I am tired of the same formula, humour and action which has become expected of the MCU and this film sums up my boredom with the franchise. It needs to spread its wings a bit and go for something different.","displayName":"Michael T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-05T15:09:00.000Z","updateDate":"2019-02-20T01:58:37.000Z","user":{"userId":"928167876","realm":"RT","displayName":"Michael T","accountLink":"/user/id/928167876"},"score":4,"timeFromCreation":"Mar 05, 2018"},{"rating":"STAR_5","review":"BEST MOVIE EVERRRRRRRRRRRRRRRRRRRRRRRR","displayName":"Justin R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-04T21:00:32.000Z","updateDate":"2018-06-03T19:33:42.000Z","user":{"userId":"977088634","realm":"RT","displayName":"Justin R","accountLink":"/user/id/977088634"},"score":5,"timeFromCreation":"Mar 04, 2018"},{"rating":"STAR_5","review":"So damn good. Blew my expectations.","displayName":"Justin S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-03T05:23:13.000Z","updateDate":"2018-07-06T19:57:11.000Z","user":{"userId":"976638219","realm":"RT","displayName":"Justin S","accountLink":"/user/id/976638219"},"score":5,"timeFromCreation":"Mar 03, 2018"}]}