{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NTczNjIxNDAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMDM6MzQ6NDYifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAxMjE1ODkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMDM6Mzk6MDUuODIxWiJ9"},"reviews":[{"rating":"STAR_3","review":"Tony Stark dies Spoiler alert:","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:39:05.821Z","updateDate":"2018-04-27T03:39:05.821Z","user":{"userId":"260121589","realm":"RT","displayName":null,"accountLink":"/user/id/260121589"},"score":3,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"This movie is probably the movie of the decade. It's seriously amazing. One of the best, if not, the best movie I have ever seen.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/779984292211560/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:38:25.000Z","updateDate":"2018-04-27T03:40:54.000Z","user":{"userId":"977241811","realm":"RT","displayName":null,"accountLink":"/user/id/977241811"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"As a comic and movie fan all I can say is thanks marvel... go watch it you will love it","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:38:21.423Z","updateDate":"2018-04-27T03:40:47.192Z","user":{"userId":"260004329","realm":"RT","displayName":null,"accountLink":"/user/id/260004329"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Best Superhero film Ever!!!!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:37:32.441Z","updateDate":"2018-04-27T03:37:32.441Z","user":{"userId":"260121587","realm":"RT","displayName":null,"accountLink":"/user/id/260121587"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Well done, well done, well done...I am in awe and can't find word beyond, I can't these and next year can't come soon enough.","displayName":"Ravie R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:37:19.000Z","updateDate":"2018-04-27T03:40:31.000Z","user":{"userId":"976870609","realm":"RT","displayName":"Ravie R","accountLink":"/user/id/976870609"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Epic...Just watch it and I think that it is beyond comparable to those of any other marvel movie.\nThe visuals are worth watching and it is a combination of twist, emotions, and actions. Overall it is a  movie which you find that your money is not wasted, \nso watch this epic saga .","displayName":"Vaibhav R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:37:00.000Z","updateDate":"2018-04-27T03:43:56.000Z","user":{"userId":"977241809","realm":"RT","displayName":"Vaibhav R","accountLink":"/user/id/977241809"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Beat marvel movie ever. Great ending","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:36:31.930Z","updateDate":"2018-04-27T03:36:31.930Z","user":{"userId":"976337748","realm":"RT","displayName":null,"accountLink":"/user/id/976337748"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"OMFG! Marvel what did you do?","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:35:12.915Z","updateDate":"2018-04-27T03:35:12.915Z","user":{"userId":"260121583","realm":"RT","displayName":null,"accountLink":"/user/id/260121583"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"This movie was a ride of emotions, action, spectaculous CGI and plot twists. As a MCU fan, you will like this movie, as a comic book fan you will PRAISE this movie, as a normal movie goer you will like it too. I was sceptic at first because i was thinking each character will have a few lines of dialogue, some humour and action, but Marvel prooved me wrong. They got me so hard with the story, i think i wasn't paying attention all the time because i was thinking and analyzing some good parts in the movie while watching it, that's how good it was! My honest opinion is that this is the best comicbook movie ever done, The Dark Knight it's a comicbook adaptation, but they are pretty equal. Villain well done, character development well done, action scenes incredibly well done! Go watch this movie, you won't regret it.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1662449773830093/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:34:46.000Z","updateDate":"2018-04-27T03:45:17.000Z","user":{"userId":"976788894","realm":"RT","displayName":null,"accountLink":"/user/id/976788894"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"Avengers: Infinity War (Spoiler Review)\n. \n.\n.\nWarning: This review contain a LOT of spoilers, if you haven't seen AIW...Do Not Click \"See More\"...But If you already saw the movie, you are very welcome to read. :)\n.\n.\n.\nOk!...Ok! Now where do we start?\nOhhh! Hulk fought Thanos in the beginning, and it was...It was a fast scene. :D Thanos beat the living gamma radiation out of the Hulk. Hahaha! My friends and I did not expect what was coming...Thanos acquired the Power Stone off-screen, it was not shown in the film how he got it, then Loki surrendered the Space Stone to him...Oh Loki! Why did you have to do that?...Loki had a plan of stabbing Thanos on the neck without him noticing, but unfortunately he failed. Thanos saw that coming a mile away and after that stunt by Loki, Thanos asphyxiated him without a doubt...And that was the intense introduction. Haha!\n.\nMoving on! on how we felt while watching the Avengers: Infinity War...This was a huge blast, people were so invested in this, the cinemas were completely sold out. We had to spent a little money in order for us to have a reservation for our seats, because every seat that was best for our viewing taste were taken. And we had to take a reservation as soon as possible, because we needed to see this film on the first day it was released. And you know what? It had the best audience reactions in a movie theater that we've ever experienced. \n.\nI have to be honest, this is a heavy film...I mean you can't fit all of these characters perfectly together in a single movie...But I have to praise and give my respects to the directors who gave their best for us to be entertained at a higher level of emotion...\n.\nThis movie is about Thanos, the main villian in the movie, you could see and at least understand why he wants to wipe out half of the population in the universe. He thinks that he is the hero in his own story, and that's what makes him a good antagonist in the MCU.\n.\nNow! let's talk about, who is the best villain in the whole MCU so far?. For me, the best antagonist is Zemo in \"Captain America: Civil War\". If you still can remember the story, Zemo's revenge for the Avengers has a strong reason why he wanted the superheroes gone, 'cause while the Avengers were fighting Ultron in Sokovia, many civilians died in the battle including Zemo's family, because of that, he embraced the power of vengeance...Second best villain in the MCU is none other than Killmonger from \"Black Panther\", Do I need to explain why he's my second favorite villain in all of the MCU films?, Nope! :D \nAnd of course, Thanos is my third most favorite villain in the MCU...\n.\nAnd what makes the Avengers: Infinity War so good and entertaining? It's so awesome! you will leave the theater with a freaking jaw-drop...Because Avengers: Infinity War is unlike anything we've ever seen before, it's all of these characters, all of these movies with different stories and arcs, all of it leading up to this. This is the combination of the 10 marvelous years that \"Marvel Studios\" created. In short, this is the climax event we've all been waiting for...\n.\nWhat are you're favorite scenes in the movie?...I have 3, first is the New York scene, where Tony Stark introduced his nano tech suit and fought Black Dwarf and Ebony Maw, and Dr. Strange's chemistry with Stark as they fought the members of the Black Order...My second favorite was Thor's entrance to the Battle for Wakanda, Oh My Goodness! people in the cinema applauded for that scene...And my third most favorite was Thanos vs. Iron Man, Dr. Strange, Spider-Man, Mantis, Drax, and Star Lord scene. \n.\nLet's talk about the ending shall we?! :D\nAll of the people...All of us in the movie theater, could not believe that just happened...As the Avengers fought Thanos in the end to destroy the remaining Infinity Stone, The Mind Stone...Captain America, Bruce Banner, Black Panther, Black Widow, Winter Soldier, Falcon, War Machine, Scarlet Witch, and The Vision. All of them were prepared to sacrifice themselves just to save half of the population in the whole universe, that scene was riveting, I mean an edge-of-the-seat kind of scene, you could feel the stakes as Thanos tried to take a step closer to The Vision to take the last remaining Infinity Stone for his Gauntlet. In order for him to snap his fingers and wipe out half of the population...And of course, what did we not expect?...Thanos succeeded in his mission. :D Because It is Star Lord's fault, and Thor was too confident that he thought he could stop Thanos from snapping his fingers...Then Boom! Half of the Avengers turned to ashes...including Black Panther, Dr. Strange, Winter Soldier, Scarlet Witch, The Guardians of the Galaxy (except Rocket), and Spider-Man...Oh come on!...and Thanos finally retired from his mission and it did put a smile on his face.\n.\nBut Don't Worry!...It is not over yet, Captain Marvel to the rescue! :D\n.\nWhoo! Too much to talk about here! :D \n.\nTo keep it short and readable, I will give my honest rating of the movie...This movie! I almost, almost rated it a perfect 10 out of 10...But it was not a stand-alone film, it means, you really need to see all of the previous MCU films for you to understand and for you to feel the same way that we felt as we saw the movie...In short, you need to be a fan in order for you to love this film...\n.\nAvengers: Infinity War deserves a 9.5 out of 10 :)\n.\n.\n.\nMCU Movies that I rated a Perfect 10!\n\"The Avengers (2012)\" and \"Captain America: Civil War\"\n.\n.\n.\nAnyways, Thank you for reading! :)","displayName":"Marlo Andreo M","displayImageUrl":"https://graph.facebook.com/v3.3/100006151512425/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:34:46.000Z","updateDate":"2018-05-07T05:48:42.000Z","user":{"userId":"957362140","realm":"RT","displayName":"Marlo Andreo M","accountLink":"/user/id/957362140"},"score":4.5,"timeFromCreation":"Apr 27, 2018"}]}