{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Njc5NTA3NDIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDFUMDc6MjQ6MjQifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzQwNzM2NDciLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDFUMDg6MTc6MjkifQ=="},"reviews":[{"rating":"STAR_4","review":"Thanos: Infinity War is a masterpiece about how Thanos collect all the infinity stone, with an awkard ending, where I think most of the people searching for the next episode release date right after the movie ends.","displayName":"Lau H","displayImageUrl":"https://graph.facebook.com/v3.3/10153960214475428/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T08:17:29.000Z","updateDate":"2018-05-01T08:20:39.000Z","user":{"userId":"974073647","realm":"RT","displayName":"Lau H","accountLink":"/user/id/974073647"},"score":4,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"Avengers infinity War is and epically tragic movie with great action twist and plenty of tears to go along the way. This is not just a movie, it's an event. You do not want to miss this one. The marvel universal will never be the same.","displayName":"Chris W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T08:16:25.000Z","updateDate":"2018-05-01T08:17:43.000Z","user":{"userId":"977252394","realm":"RT","displayName":"Chris W","accountLink":"/user/id/977252394"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"Holy cow.  They delivered in spades.  It took the best of their movies and characters and packed it into one epic, entertaining, intense movie, but with lots of funny parts too - that is an amazing balance to strike.  The artwork - CGI, costumes, cinematography - was at a very high level.  The script and dialog was very good (ok we are in comic book movie land so everything is relative!).  This was an amazing culmination of so many great movies - spider-man, dr strange, guardians 1 and 2, black panther, a little lighter on the avengers movies - which was great because those movies were probably the least good out of that list, meaning avengers 2 and civil war.  but the strengths of all the other movies - humor, unique characters and powers, lots of great humor, their back ground and stories - all played a part and wove together so well.  it really was epic like no other MCU movie has been.  thanos was really amazing powerful badguy.  he looked great on screen, which was no small feat, and he was acted really well.  that, from an art perspective, was quite an achievement, as well as from an acting and script perspective.  props.  props.  i want to see it again for sure.  so impressed:)","displayName":"Calvin E","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T08:11:05.000Z","updateDate":"2018-05-01T08:17:11.000Z","user":{"userId":"963844334","realm":"RT","displayName":"Calvin E","accountLink":"/user/id/963844334"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"A blockbuster 10 years in the making !","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/2085718568383913/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T08:03:40.000Z","updateDate":"2018-05-01T08:04:53.000Z","user":{"userId":"977252370","realm":"RT","displayName":null,"accountLink":"/user/id/977252370"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"Perfect, an actual story with character development and no political cheap shots.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T07:47:24.986Z","updateDate":"2018-05-01T07:47:24.986Z","user":{"userId":"914583309","realm":"RT","displayName":null,"accountLink":"/user/id/914583309"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"Amazing. Simply amazing. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T07:35:58.657Z","updateDate":"2018-05-01T07:35:58.657Z","user":{"userId":"829101786","realm":"RT","displayName":null,"accountLink":"/user/id/829101786"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"Fantastic movie.  Emotion, fun, and some remarkable takeaways.  Josh Brolin delivers an inspired performance and the music score is simply top shelf.  I would be stunned if this score doesn't garner major academy interest.  Marvel delivers on what they have been promising.  Jack Kirby would be proud!","displayName":"D G","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T07:30:56.000Z","updateDate":"2018-05-01T11:39:10.000Z","user":{"userId":"977252337","realm":"RT","displayName":"D G","accountLink":"/user/id/977252337"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"It is important to note that my high rating is partially due to my viewing experience here in India. People were cheering when a beloved character steps on the big screen for the first time or when something incredibly awesome happens. Which happens a lot; let me tell you this right up front. They were thoroughly engaged in every emotional moment sprinkled throughout the movie. This goes to show that the filmmakers managed to hit most, if not every, emotional beat they set out to hit. \nI never expected this kind of euphoria and energy in India, but it unexpectedly enhanced my viewing experience and made it a very special one that I won't forget so easily. \n\nThe movie itself is, in short, entertainment at its finest. Infinity War has a runtime of around 2  1/2 hours and it never had a dull moment. Even on my second viewing, I was still in for the whole ride and had just as much fun. Every character we know and love has their moment to shine. Some shine longer and brighter than others, but they all shine nonetheless. And the filmmakers confirmed that the ones who didn't have that much screen time than others will get more in the conclusion of everything Marvel has built up for the last 10 years in Avengers 4 next year. It's great to see the interaction between all the different superheroes, especially if they haven't previously met such as the Avengers and the Guardians. The banter and the humor are there, and most of the jokes hit their mark. As always Drax steals the show in that regard for me. Who would've thought that Dave Bautista could possess such comedic prowess?\n\nA common complaint I'm reading on the Internet is that there is a lack of character progress, which to me sounds like someone missed the point of the entire movie. This movie was never intended to deepen the character or personalities our beloved heroes because we have 10 years and 18 movies of such progression. This movie had only one goal and storyline in mind: Thanos wants to collect the six Infinity Stones to wipe up half the Universe and our heroes need to assemble in order to stop them. No character progression is needed and the focus instead lies solely on the eponymous war. Infinity War needs to have a fast pace in order to keep track of everything that's happening and of every character involved. And it absolutely succeeds in this regard as well. We are jumping from planet to planet, group to group and even back in time to establish the big, bad and mad Titan that is Thanos. All this happens in a way that doesn't get confusing, which is hard to do. We always know where we are and what is happening. The transitions between each location are seamless and because of that it lets the plot progress at just the right pace.\n \nNow, let's talk a little more about Thanos. In recent years, Marvel has really improved upon their villains, which was always a valid complaint in most of the MCU movies. Besides Loki, there was no other compelling villainous character. With Vulture in Spider-Man: Homecoming and Killmonger in Black Panther, they finally managed to address this issue. Thanos is another step in the right direction. Sure, he is a psychopathic, genocidal, madman, but the storytellers do a really good job at establishing his background and motives to such an extent that we somewhat can understand where he is coming from. Except for one scene maybe, we are never sympathetic or empathetic towards him or his goals, but it is still better than having just a bad guy who does bad stuff because that's bad guys do. He is also flawlessly portrayed and voiced by Josh Brolin.\n\nMy personal biggest issue with every single Marvel movie was always the lack of consequences. Whatever happened in the movie would somehow be resolved by the end and nothing really changes in a negative way. There are some exceptions like Captain America: Civil War, but even back then I was fully aware that this would be just a little punch-out compared to the real (Infinity) War that would be coming soon.\n\nIn Avengers: Infinity War this changes. There are consequences and actions have reactions. What we have to keep in mind is that this is the first part of a two-part conclusion, so everything that happens by the end here can be altered/changed/remedied by the end of Avengers 4. But still, the emotional impact that some of the scenes or moments had were executed really well. For the first time, I had the feeling that there were consequences and that these, in turn, would usher in the new era of Marvel movies. In particular, one character moment at the very end was truly heartbreaking. It was even \"worse\" on my second viewing because I knew what was going to happen.\n \nAll in all, I think that the Russo Brothers did a remarkable job of bringing every character together in some of the greatest battle scenes seen in a Marvel movie. There were big \"Fuck Yeah!\" moments, followed closely by \"Fuck... No...\" moments. Add to that the right amount of humor and you have the essence of what makes a truly entertaining Marvel experience. \n\nIs it a perfect movie due to my score? Of course not! No movie is perfect, regardless of how beloved it is. I mean, Indiana Jones and Back To The Future are some of my favorite movies of all time and I could still plenty of faults in every single one of them. What makes them so great is the cinematic roller coaster they put you on and the way they make you feel. Marvel is very special and dear to the hearts of Millions of people out there. Not just as popcorn blockbuster fun entertainment, but as something that can have a positive impact on people's personal lives, especially those of kids. We all have our heroes, whether they are in books, movies or video games and sometimes we need their shining example in our desperate times. This is what Indiana Jones is for me and this is what Marvel is to our current generations. The movies, just like the characters, have plenty of flaws, but this all doesn't matter, if you love them so dearly, not despite their flaws, but because of them.","displayName":"Benni B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T07:30:41.000Z","updateDate":"2018-05-01T07:30:42.000Z","user":{"userId":"908418437","realm":"RT","displayName":"Benni B","accountLink":"/user/id/908418437"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"This movie was amaizing!!!! Just when you try to get your breath back they blow it away again...this movie was just too good.","displayName":"Dylan K","displayImageUrl":"https://graph.facebook.com/v3.3/678608602332212/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T07:29:54.000Z","updateDate":"2018-05-01T07:31:14.000Z","user":{"userId":"976468295","realm":"RT","displayName":"Dylan K","accountLink":"/user/id/976468295"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"Possible one of the best movies of all time...","displayName":"Will M","displayImageUrl":"https://graph.facebook.com/v3.3/1279175795/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T07:24:24.000Z","updateDate":"2018-05-01T07:25:12.000Z","user":{"userId":"967950742","realm":"RT","displayName":"Will M","accountLink":"/user/id/967950742"},"score":5,"timeFromCreation":"May 01, 2018"}]}