{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NjQxOTMyNTgiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMzFUMjA6NTc6NDkifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzUxNjE4NzYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDYtMDFUMDY6MTU6NDIifQ=="},"reviews":[{"rating":"STAR_4_5","review":"Here stands a film that, regardless of your opinion on it, is unarguably a monumental piece of filmmaking. Ten years of storytelling, a brethren of beloved characters and a film that has the hardest job of impressing its hungry fan base. The end product of Avengers: Infinity War is, in my opinion, about as good as a movie of this kind and this colossal scale could be. Complaints have been thrown at the movie for its lack of character development or plot structure; but, let's face it, we've had 18 movies worth of storytelling here... this whole movie would be endless exposition if we had to explain all that has happened in the MCU up until now! The film does not stand on its own, it is necessary to admit, and you have to have watched your fair share of particular Marvel movies to even have a real clue of what's going on (though action thrills may be enough for some cinemagoers). If you have seen at least 5 of the most important Marvel movies, you will get an impact from Avengers: Infinity War. If you have seen all 18... well, you have the full, untarnished impact of blockbuster entertainment at its most astounding.\nAvengers: Infinity War is no masterpiece of intelligent filmmaking; there are no hidden messages, there is no character depth (mostly) and there is also little by way of plot. But, it's critical to look at this film as it is; it cannot be reviewed like any other film, due to the sheer scope of it and the build up of a universe that it culminates a phase of. Infinity War is a reward for Marvel fans for 10 years of loyalty; it's a thrill ride of Easter eggs, nerd-gasms and action mayhem. And, for those who are not Marvel fans, it acts as a brilliant popcorn movie, fun, loud and, above all, grandiose.\nThe story follows the Avengers, also joined by the Guardians of the Galaxy, as they come together to defeat the almighty Thanos, who plans to wipe out half the universe by acquiring the six omnipotent Infinity Stones. The film, for the majority, successfully juggles its huge cast; some characters may feel underused, but the problem is solved by our main player being the purple perpetrator, Thanos. It's Thanos who the movie focuses on and it's Thanos who gets the arc; the character is actually one of my favourite parts about the film. Josh Brolin's performance is scene-stealing, even in motion capture, the CGI is utterly faultless and the character of Thanos himself is a complex amalgamation of madness and disturbing logic. Other beloved characters may take more of a backseat in the movie in favour of Thanos, but many have memorable moments; Benedict Cumberbatch and Robert Downey Jr are perfect in dry wit as Dr Strange and Iron Man and Tom Holland is only warming the hearts of his fan base further with his savvy comedic timing and sudden spin into heart-breaking emotion (no spoilers here). Chris Hemsworth's Thor has some great scenes with Marvel's misfits, the Guardians of the Galaxy and Zoe Saldana delightfully reveals how much she has held back her skills as an actress in the last two Guardians movies. In an ideal world, we'd have more Captain America and Black Panther, but considering the difficulties the film faces in balancing an unusually large ensemble of icons, the end result in the cast is not half bad.\nInfinity War is first and foremost an action flick. Unlike Captain America: Civil War which ended up being more Captain America: Civil Small-Disagreement, Infinity War goes all out in its battles and action sequences, so much that a solid 50% of the movie could be \ncalled a climax. The action is mostly great though, not excessively banal, accompanied by a booming score by Alan Silvestri and some memorable superhero tropes which would make Deadpool squirm. The action manages to remain entertaining however, even if it isn't intelligent; some deeper, quieter scenes between Gamora and Thanos balance out the noise. This is a romping superhero flick, unashamedly bold and action-packed... and that thoroughly works, for me. \nIf I have to nitpick, for me, a couple of subplots in the movie didn't quite work, Not that they made the movie feel to long (a close to 3hr run time breezes by), but they did verge on being a bit of a bore, detracting from the thrill of the other storylines. However much you love Peter Dinklage, that Thor-essentially-heats-up-a-massive-oven bit went on a tad too long. Overall, however, the film is mercilessly fast-paced and largely thrilling in its action.\nNow, to turn to the ending, a touchy subject for many. No spoilers here, but I found the ending to be a bold way to climax the film; regardless of the long-term stakes, a film that sees an unexpected triumph for the \"wrong\" character is still admirably ballsy... whether you liked it or not, you certainly didn't see it coming.\nOverall, Avengers: Infinity War is as unique a cinematic experience, as it is a piece of filmmaking. This is an impressive feat; 10 years in the making, the challenges that this film faced were colossal, but it largely delivers, both as a homage and enriched reward for Marvel fans and as a sizeable popcorn movie for the masses. Whatever you think of the film, it should be appreciated if just for its sheer scope and undoubtable success as proper entertainment.","displayName":"Isaac J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-01T06:15:42.000Z","updateDate":"2018-06-01T06:15:46.000Z","user":{"userId":"975161876","realm":"RT","displayName":"Isaac J","accountLink":"/user/id/975161876"},"score":4.5,"timeFromCreation":"Jun 01, 2018"},{"rating":"STAR_4_5","review":"Had to see this twice in the cinema I enjoyed it so much.  Looking forward to part 2.","displayName":"L W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-01T04:40:59.000Z","updateDate":"2018-06-01T04:41:27.000Z","user":{"userId":"976980318","realm":"RT","displayName":"L W","accountLink":"/user/id/976980318"},"score":4.5,"timeFromCreation":"Jun 01, 2018"},{"rating":"STAR_4","review":"It was really well done. Thanos (Josh Brolin) was great!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-01T04:03:15.304Z","updateDate":"2018-06-01T04:03:15.304Z","user":{"userId":"944376992","realm":"RT","displayName":null,"accountLink":"/user/id/944376992"},"score":4,"timeFromCreation":"Jun 01, 2018"},{"rating":"STAR_3","review":"It was okay. I'm not a huge fan of Marvel movies, but I took my son who had a blast. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-01T02:38:25.396Z","updateDate":"2018-06-01T02:38:25.396Z","user":{"userId":"837031909","realm":"RT","displayName":null,"accountLink":"/user/id/837031909"},"score":3,"timeFromCreation":"Jun 01, 2018"},{"rating":"STAR_3_5","review":"The way it ended killed me! 😩","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-01T01:27:11.685Z","updateDate":"2018-08-09T22:10:58.598Z","user":{"userId":"260040036","realm":"RT","displayName":null,"accountLink":"/user/id/260040036"},"score":3.5,"timeFromCreation":"Jun 01, 2018"},{"rating":"STAR_5","review":"I love all Avengers films! This was always amazing, great overall. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-31T23:19:09.512Z","updateDate":"2018-05-31T23:19:09.512Z","user":{"userId":"260141541","realm":"RT","displayName":null,"accountLink":"/user/id/260141541"},"score":5,"timeFromCreation":"May 31, 2018"},{"rating":"STAR_5","review":"The best movie of all time. Insane plot twists","displayName":"Yonatan V","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-31T23:16:50.000Z","updateDate":"2018-05-31T23:17:35.000Z","user":{"userId":"977300990","realm":"RT","displayName":"Yonatan V","accountLink":"/user/id/977300990"},"score":5,"timeFromCreation":"May 31, 2018"},{"rating":"STAR_5","review":"10 years of hype, 10 years of teasing us with what's to coming, 18 different movies gradually leading up to this moment, was it worth it? ABSOLUTELY!!! For me it lived up and blew past any expectations that I had, words cannot express how well done this movie was, Marvel currently are doing the unthinkable with brining so many characters together in one film and making each one of them stand out and have something to offer. There were so many moments that I'd like to talk about, but won't because I don't want to spoil the movie. I truly believe that this is going to go down as a historical best cinematic achievement for a superhero movie and be a template for others to follow and attempt better, but that will be damn near impossible. From top to bottom, this movie had me hooked and engaged more so than any other Marvel movie to date. This movie will take you on a rollercoaster of emotions, and even more so for those that are so invested in these characters which makes this movie so personal since 90% of the Marvel universe is in this movie. I feel like if you leave from this type of movie and your hands are sweaty, feet are cold, and have goosebumps, then the studio has done it's part. I cannot stress enough how well put together and how well executed this film was, the music, the cgi, the tone, the story arc, and of course, the characters. It's going to be a painful wait until next year for Avengers 4, but if it's anything like this movie, it's going to be well worth the wait. If you like this review, please follow me on facebook @ontheflyreviews","displayName":"Brian K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-31T23:10:58.000Z","updateDate":"2018-05-31T23:11:23.000Z","user":{"userId":"929970340","realm":"RT","displayName":"Brian K","accountLink":"/user/id/929970340"},"score":5,"timeFromCreation":"May 31, 2018"},{"rating":"STAR_5","review":"I loved every minute of it.  I would not take young kids to see this.","displayName":"Matthew G","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-31T21:55:56.000Z","updateDate":"2018-05-31T21:56:14.000Z","user":{"userId":"976943807","realm":"RT","displayName":"Matthew G","accountLink":"/user/id/976943807"},"score":5,"timeFromCreation":"May 31, 2018"},{"rating":"STAR_2_5","review":"Just went to see this because i thought it would give meaning to 10+ years of marvel movies... And well, i'm really disappointed, the disney hand is so visible as on the last 3+ marvel movies, Disney is (i hope) pressing to make family friendly movies to cover a wider audience, i think this will be my last marvel movie.","displayName":"cesar p","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-31T20:57:49.000Z","updateDate":"2018-05-31T21:01:02.000Z","user":{"userId":"964193258","realm":"RT","displayName":"cesar p","accountLink":"/user/id/964193258"},"score":2.5,"timeFromCreation":"May 31, 2018"}]}