{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzYyOTcxNjIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMTA6NTA6NTYifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNDI5NDUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMTA6NTg6NDkifQ=="},"reviews":[{"rating":"STAR_5","review":"Transcendent superhero movie that takes you through the entire spectrum of emotions.","displayName":"Niel S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T10:58:49.000Z","updateDate":"2018-04-27T10:59:52.000Z","user":{"userId":"977242945","realm":"RT","displayName":"Niel S","accountLink":"/user/id/977242945"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"The Russo Brothers did a goodjob at juggling all the different heroes and cast members. The first half of the movie was just serious enough but still comedic, the second half however goes for a darker tone with the comedic quips and the jokes contradicting the overall darker tone they try and imply.\nI must say I think this movie due to it having so much in it. needs to be seen twice. Very well done, hoping Marvel can make some bigger hero sacrifices in Avengers 4","displayName":"Jake D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T10:58:43.000Z","updateDate":"2018-04-27T11:51:34.000Z","user":{"userId":"976336925","realm":"RT","displayName":"Jake D","accountLink":"/user/id/976336925"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Pros: Thanos was a surprisingly compelling villain. In the comics and other media, he's kind of a \"generic space bad guy\", but in this, he's truly scary, menacing and kinda sympathetic all at the same time.  If someone would have told me ten years ago that a Marvel Movie would make an interesting character out of Thanos, I wouldn't have believed it.  I was prepared and happy for Generic Space Bad Guy., so actually making me care about him is quite a treat. Kudos to the writers and Josh Brolin.\n\nLike the first Avengers film, each character (with few exceptions) gets a truly outstanding moment, whether it's in terms of action, comedy or drama. Chris Hemsworth (as Thor), in particular, has a scene as Thor that proved to me once and for all that the guy deserves to be a star. That dude has wowed me with action, made me laugh and now has brought me near to tears.  If he can pull off a dance scene and sing well in a movie, I'll be convinced he's the whole package.\n\nBest Dr. Strange scene so far.  Best Battle scene in any movie I have personally seen.\nSo much more I like, but...spoilers.\n\nCons:  Some of the humor goes on a little longer than I would prefer. Not by much; just a little.\n\nThe other side villians (The Black Order. Look them up if you don't know) could have used a bit more introduction. I don't remember them even being named clearly in the body of the film.\n\nI can see how, if you're not a comic book fan or someone who has followed the Marvel movies as closely as others, one could be left confused by this movie. It's not a movie one just goes to see without some kind of prior knowledge. It's the penultimate chapter in a ten-year long story. Not really a \"Con\", but something to keep in mind. If you have little to no experience with the prior films, you may get lost. Fair warning.\n\nOverall: I still want to sit with it some and maybe see it again (as if I'm not going to buy it and watch it a million times as soon as it's available) but this may be my favorite comic book movie of all time. Maybe my favorite movie of all time. It's not only the near culmination of a ten-year story; it's the culmination of something many of us comic book fans were told for years couldn't happen. A massive, superhero crossover film that is true to the characters (or better) that is good. Kevin Feige is GOD. Other studios 9heck, maybe some also owned by Disney) that are attempting this should be peeking over his shoulder and copying his homework.\n\nGrade: A+","displayName":"Jeremy S","displayImageUrl":"https://graph.facebook.com/v3.3/590530762/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T10:55:19.000Z","updateDate":"2018-04-27T11:39:32.000Z","user":{"userId":"962316384","realm":"RT","displayName":"Jeremy S","accountLink":"/user/id/962316384"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Wow rarely do I go into a movie with high expectations and those expectations are blown away! It was sooo good! Seeing so much more of Thanos and understanding where he was coming made him a compelling villain. Some highlights: Gomora's story, doctor Strange fighting Thanos, Thor's entrance to the battle field had me cheering!, funny jokes , big battles, the power of Thanos, the shock of the ending, etc. a must see film that somehow combines everything the mcu has been building to in a spectacular movie!","displayName":"Brandon P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T10:55:16.000Z","updateDate":"2018-04-27T11:24:26.000Z","user":{"userId":"973203812","realm":"RT","displayName":"Brandon P","accountLink":"/user/id/973203812"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"This movie was phenomenal. Not only funny, but dark. They somehow blended the two, and made an excellent flick.","displayName":"Jason D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T10:54:30.000Z","updateDate":"2018-04-27T10:57:53.000Z","user":{"userId":"906694450","realm":"RT","displayName":"Jason D","accountLink":"/user/id/906694450"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"The best Marvel movie ever!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/286603901811162/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T10:53:00.000Z","updateDate":"2018-04-27T10:54:47.000Z","user":{"userId":"977007268","realm":"RT","displayName":null,"accountLink":"/user/id/977007268"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"Amazing movie!\nI'm still amazed with how far they went with this movie!\nEveryone should go and see it now, cause it's impossible to get disappointed with it.","displayName":"Daniel S","displayImageUrl":"https://graph.facebook.com/v3.3/100006259413988/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T10:52:34.000Z","updateDate":"2018-04-27T11:04:34.000Z","user":{"userId":"969064480","realm":"RT","displayName":"Daniel S","accountLink":"/user/id/969064480"},"score":4.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Avengers Infinity War is the END of the 10 year Journey of the Marvel Cinematic Universe, which Started back in 2008 with Iron Man!!! The Payoff for this Journey was well delivered by Avengers Infinity War, All the Marvel Superheroes Unite Together to fight an Unbeatable Foe THANOS!! Thanos is the BEST VILLAIN I have ever seen in this franchise since LOKI. SPOILER ALERT-\n Not only was he able to collect all the Infinity Stones but he also killed Half the Avengers and Half the universe. no villain ever in Marvel Cinematic Universe was able to accomplish this Task!! \nThe Action Sequences were Great and the Scenes in which Avengers met the Guardians were GREAT!! ALL IN ALL THE BEST MARVEL MOVIE EVER!! I AM ALREADY HYPED UP FOR AVENGERS 4!! CAN'T WAIT FOR IT!! This film is a MUST SEE!! But I would Suggest watching all the preceding Movies so that you all don't get confused in some scenes!!","displayName":"Madisshya S","displayImageUrl":"https://graph.facebook.com/v3.3/100005342885731/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T10:51:54.000Z","updateDate":"2018-04-28T13:02:38.000Z","user":{"userId":"965010497","realm":"RT","displayName":"Madisshya S","accountLink":"/user/id/965010497"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4","review":"A gigantic, monumental film in every aspect, with epic battles, absurd development and spectacular villains, \"Avengers - Endless War\" is not only characterized as the best film of Marvel, the film also presages to be one of the best hero movies already made, and the only reason for not being such, is that in the end, we little believe what we see, because we know, that the situation will be reversed in the second, after all, it's a hero movie. The script that tells the story of Thanos, a kind of man who intends to give mercy to the world killing half of its population, thus ending, with the shortage, Thanos is a hero of absurd development, and beats head-on with Nolan's joker, as being the best villain in the movie of heroes, putting different universes and countless heroes in the same universe, the directors are successful in embedding several stories, not always with a perfect rhythm or the perfect excuse for, but, it does not get boring, nor gets to leave one or the other too much to corner, which is a merit grade. The cruelest thing about the film is that we understand that Thanos wants to end half of the universe, the character does not think of it as genocide, but an act of mercy to the suffering of people, and we can not support it, but we understand its actions, Thanos is not a sovereign and robotic villain, he is human, perhaps and strangely, the most human of the film, and watching coldly, perhaps the hero of the film, this characterization of Thanos and the development of it, is simply brilliant and magnificent. Technically the film is a show of special effects, and directing action scenes, great choreographies and frames, and cleverly putting battles in separate areas, not creating a big mess in a single center with all the heroes, even so, sometimes it seems that something came out in the editing, the transition in many moments is completely inorganic, just like your photo revesa and changes according to the core on screen, although this is not necessarily bad, it's just a touch of visual marking, well adjusted soundtrack, jokes in the right moments and well-balanced drama, Avengers infinite war is a well directed and finished film. The cast is fine, nothing too spectacular, even because no one has a lot of screen space, but they all play their role well, with a small highlight for Robert Downey Jr and Tom Holland, in isolation, \"\" Avengers - Infinite War \"is a spectacular movie , with small problems, it's true, but still spectacular, which does not give him a soul of genius and unique, is that we know that his story will continue, and everything shown so far will change, intrinsically, this disrupts our experience with this but nevertheless, contemplate the best film of Marvel.","displayName":"ANDERSON G","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T10:51:53.000Z","updateDate":"2018-04-27T10:55:06.000Z","user":{"userId":"974807001","realm":"RT","displayName":"ANDERSON G","accountLink":"/user/id/974807001"},"score":4,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"I yelled and cheered so munch during this film, it was magical!","displayName":"Andre R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T10:50:56.000Z","updateDate":"2018-04-27T10:55:49.000Z","user":{"userId":"976297162","realm":"RT","displayName":"Andre R","accountLink":"/user/id/976297162"},"score":5,"timeFromCreation":"Apr 27, 2018"}]}