{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNjUxNjQiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMTFUMjA6MDM6MDIifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNjUyNjAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMTFUMjI6MTA6MTYifQ=="},"reviews":[{"rating":"STAR_5","review":"You will be surprised by what happens but it is good!","displayName":"Kat R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-11T22:10:16.000Z","updateDate":"2018-05-11T22:11:14.000Z","user":{"userId":"977265260","realm":"RT","displayName":"Kat R","accountLink":"/user/id/977265260"},"score":5,"timeFromCreation":"May 11, 2018"},{"rating":"STAR_3","review":"Lots of action; ending is problematic.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-11T22:01:18.834Z","updateDate":"2018-05-11T22:01:18.834Z","user":{"userId":"950524195","realm":"RT","displayName":null,"accountLink":"/user/id/950524195"},"score":3,"timeFromCreation":"May 11, 2018"},{"rating":"STAR_4_5","review":"Avengers: Infinity War is one of the most ambitious, epic, and thrilling superhero films ever made, and is an honorable celebration of the Marvel Cinematic Universe!!!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-11T21:59:17.831Z","updateDate":"2018-10-30T13:01:25.389Z","user":{"userId":"969967671","realm":"RT","displayName":null,"accountLink":"/user/id/969967671"},"score":4.5,"timeFromCreation":"May 11, 2018"},{"rating":"STAR_4_5","review":"Great movie! If you like action and special effects it was a site to see from the very beginning till the very end. Plus, the story line was intriguing all the way throughout. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-11T21:52:04.583Z","updateDate":"2018-05-11T21:52:04.583Z","user":{"userId":"260130526","realm":"RT","displayName":null,"accountLink":"/user/id/260130526"},"score":4.5,"timeFromCreation":"May 11, 2018"},{"rating":"STAR_2_5","review":"There are so many plot holes that a compilation of all logical problems will probably make a term paper.","displayName":"Jany G","displayImageUrl":"https://graph.facebook.com/v3.3/526925523/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-11T21:33:29.000Z","updateDate":"2018-05-11T21:34:42.000Z","user":{"userId":"865986045","realm":"RT","displayName":"Jany G","accountLink":"/user/id/865986045"},"score":2.5,"timeFromCreation":"May 11, 2018"},{"rating":"STAR_5","review":"Absolutely amazing! Exceeded all my expectations!! Bravo Marvel Studios for another gem!!!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-11T20:57:37.564Z","updateDate":"2018-05-11T20:57:37.564Z","user":{"userId":"814366431","realm":"RT","displayName":null,"accountLink":"/user/id/814366431"},"score":5,"timeFromCreation":"May 11, 2018"},{"rating":"STAR_0_5","review":"Facetious farcical frivolity, Avengers: Infinity War is a glittering garish gluttony of a film that fails all the rules of filmmaking. Put it simply, every fractious facet of the film is butter spread too thin on a loaf of bread. Too many bastardized superheroes strut the stage, leaving too little time for character development, creating a convoluted pitious plot so convulsively complex not even a physics major poindexter could crack the riddling riddle. If I could barely understand it, what makes you think you could?\n\nMarvel and Disney ruined my childhood for the last time. Jack Kirby sheds tears from his grave. Only the conscientious cognisanti, the iridescent illuminati; in short, the gifted genius geeks, blessed as the pioneering prophets by the Father Stan Lee, the Son Heath Ledger, and the Holy Ghost Jack Kirby - may God rest his soul, R.I.P. in peace - our destiny as cultural gatekeepers individuates us in spirit from the philandering philistine as do the the genetic differences between Man and Chimpanzee. \n\nThe potholed plot follows as such: a purple titan called Thanatos wants to collect all the Chaos Emeralds so he could rule the universe or something. He kick's Thorin's butt so hard he sends the Nordic god to intergalactic space. Then his minions, Dark Horny Chick, Squidward, and Reptoid Jock - I still hate you, Chad! - invade earth. Two of the Hellenic heroes own a  Chaos Emerald, one each: Dr. Strangelove and Space Englander. They repel the infesting invaders and seek out their comrades, the Space Rangers. \n\nThe Rangers, in turn, rescue a trounced Thorin from deep space, who then visits Gimli to help him forge a new Master Sword. Meanwhile, Thanatos abducts his stepdaughter, the Haitian hottie; he wants her to join him so they could rule the galaxy as father and daughter. Hottie says no, so Thanatos sacrifices her to Loki to get another Chaos Emerald. \n\nMeanwhile, Dr. Strangelove murders poor Squidward with the help of Iron Dude and Peter Pranker, so Dark Horny Chick visits the politically correct utopia Wakanda to exact her revenge. The remaining heroic Hellenes aid the civil rights activist Malcolm X. Panther in defending his homeland in a brave stand that would make the Spartans proud. Dark Horny Chick sends in a million ornery orcs in a suicide squad, but the Hellenes fight them off.\n\nI could no longer stand to watch the movie, so I left early. This malevolent movie is a politically correct nightmare. Why do half of all superheroes have to be women? Why do African Americans need a fake colossal continent when they already have Africa? Why don't I have a Wakanda; you know, somewhere like Wyoming? Watching this movie is abstaining yourself on the pathetic parsimony enervating excuse called the vegan diet. It tastes bad with no payoff.\n\nMy high school literature teacher - who is a wonderful woman, by the way! - taught me that everything in a book or movie was a symbol for something ponderously profound; I was forced to write book reports on To Kill a Mockingbird and Hamlet using her methods. I can also shed some luminescent light on this massive monstrosity of a maddening movie.  \n\nThanatos represents Disney. Just as Thanatos wants to collect all the Chaos Emeralds to turn into a Super Saiyan and control the universe, Disney wants to bureaucratically buy every franchise known to man to control the world. A way better movie than this one, a movie I would totally watch with wonder, would be called Disney Versus Google: Civil War. \n\nAs for other cheap characters, none of them matter. They are cheap cash grabs by Disney, dangling them as protruding puppets, scintillating screenshots, blazing their names as lambent lights to lure the damned dunces, the idiot ignorami, the poor Philistines into losing their hard earned money; just as the flannel of flame leads motley moths to their doom or the barbarous butcher leads the sleepy sheep to slaughter. Disney ruined Star Wars. Hands off my comic book heroes, sneaky skeevy swindling swine!    \n\n- Darius Reilly, Nerd Rage Ranter","displayName":"Darius R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-11T20:45:18.000Z","updateDate":"2018-05-11T21:03:44.000Z","user":{"userId":"977265182","realm":"RT","displayName":"Darius R","accountLink":"/user/id/977265182"},"score":0.5,"timeFromCreation":"May 11, 2018"},{"rating":"STAR_4_5","review":"Another great marvel movie","displayName":"Darryl L","displayImageUrl":"https://graph.facebook.com/v3.3/1377782383/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-11T20:42:07.000Z","updateDate":"2018-05-20T19:09:18.000Z","user":{"userId":"865898419","realm":"RT","displayName":"Darryl L","accountLink":"/user/id/865898419"},"score":4.5,"timeFromCreation":"May 11, 2018"},{"rating":"STAR_5","review":"Can't wait for part 2. Great movie","displayName":"sea o","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-11T20:15:16.000Z","updateDate":"2018-05-11T20:15:52.000Z","user":{"userId":"977265177","realm":"RT","displayName":"sea o","accountLink":"/user/id/977265177"},"score":5,"timeFromCreation":"May 11, 2018"},{"rating":"STAR_3_5","review":"Es una película epica, una experiencia bastante agradable con un montón de personajes, es el tipo de película que entre más veces la ves, más te gusta.\nDesgraciadamente hay varios errores muy notorios y personajes que hacen cosas tontas con tal de que la película termine de la manera en que terminó. Es entendible que ocurra esto ya que una historia de este tipo no es fácil de contar. Es muy difícil llevar a la pantalla grande conceptos como \"el alma\", \"la mente\", \"el poder\", \"la realidad\", \"el tiempo\", \"el espacio\".\nA pesar de esto es una buena película, con varios momentos sentimentales y extraordinarias escenas de acción.\nTodos los que disfrutan del cine de superhéroes deben ver esta película, es \"Una carta de amor de Marvel para los fans\".","displayName":"Yahel V","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-11T20:03:02.000Z","updateDate":"2018-05-11T20:22:02.000Z","user":{"userId":"977265164","realm":"RT","displayName":"Yahel V","accountLink":"/user/id/977265164"},"score":3.5,"timeFromCreation":"May 11, 2018"}]}