{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84MzU0MDIxMDkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMTk6MTE6MzIuMjQ3WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NDQ0NTI2MjUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMTk6MTc6MzYuMjY1WiJ9"},"reviews":[{"rating":"STAR_5","review":"One word describes this movie... WOW! ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T19:17:36.265Z","updateDate":"2018-04-27T19:17:36.265Z","user":{"userId":"944452625","realm":"RT","displayName":null,"accountLink":"/user/id/944452625"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Vamos ter a consciência que eu ja tinha em mente que o filme seria algo estrondoso e grande no patamar ao qual a gente já esperava, o começo do final de uma década de filmes Marvel Studios, a alegria dos geeks, os heróis Marvel um por um virando realidade, tendo sua própria história contada em cada filme.\n\nTudo começa em 2008 com Homem de Ferro, que até então nunca teve UM GRANDE filme ou arco no cinema de super heróis, logo em seguida começa-se uma jornada inteira de filmes que iam de 8 ao 8000, filmes incriveis como os três Cpt. America (PRINCIPALMENTE o Soldado Invernal, que era o melhor filme Marvel antes desse), como Guardiões Vol 1 e 2, Homem Aranha, Pantera Negra, Vingadores e etc. E os um pouco mais problemáticos como Era de Ultron (no qual o problema é a rapidez em que uma 'era' de um vilão tão espetacular acontece tão rápido, e o mesmo erro se repete em Guerra Civil) ou aquela incógnita de filme que foi Thor: Ragnarok.\n\nTodos esses 10 anos, todos nós esperamos por isso. E meu amigo, a espera não só valeu a pena como fez história.\n\nEsse filme é um filme que mostra que filmes de super-heróis podem sim ser industriais, trazer dinheiro e publico e serem bons MESMO ao mesmo tempo.\n\nPra quem cria apego a personagens e histórias como eu, pra quem imerge em uma história como se estivesse ali e conhecesse os personagens, sabe bem então o laço que criamos todos esses anos com esses personagens todos. E meu deus, nunca houve tanta demonstração disso como nesse filme.\n\nVocê chora por eles, você torce por eles, você ri com eles, você os ama, assim como em todos os outros filmes, mas neste, tem-se a consciência de que aquilo ali é algo muito maior.\n\nA trilha sonora nunca foi tão presente ou pelo menos tão perceptível quanto aqui, no qual um violino consegue levantar todos os pelos do seu corpo, em que apenas na abertura você já esta arrepiado.\n\nThanos é simplesmente o melhor vilão já feito pela Marvel e definitivamente vai ficar marcado como um vilão tão carismático a niveis Darth Vader. Quando você ama um vilão, ele faz seu papel. Quanto você odeia um vilão, ele também faz seu papel. Agora quando você ama e odeia... É pq o bagui é louco.\n\nHá momentos em que você ama com tanta força o quão Thanos pode ser simplesmente um personagem com tanta profundidade (o que é foda pra vilões Marvel rs) e outros nos quais você preza apenas pra que ele morra, que tudo aquilo acabe, que eles finalmente consigam acabar com ele.\n\nGamora e Nebulosa tem um destaque emocional nesse filme como nunca antes tiveram, Tony Stark volta a ser amável E amado pelos fãs depois dessas 3 horas, e o Thor finalmente volta a parecer um nórdico ao invés daquele... Cara... Do Thor: Ragnarok (nota-se o desprezo por esse filme, né?)\n\nO que eu quero dizer realmente: Vingadores: Guerra Infinita é fangásmico para todos os nerds e pessoas que criaram laços emocionais com todos aqueles personagens, Vingadores: Guerra Infinita é o filme de todos os filmes, Vingadores: Guerra Infinita supera qualquer expectativa, MESMO que as expectativas sejam altíssimas, Vingadores: Guerra Infinita tem tudo que é de ruim na Marvel Studios e da fórmula jogados no lixo, prevalecendo o que há de mágico nesse estúdio.\n\nVingadores: Guerra Infinita é uma obra prima criada por dois mestres (Irmãos Russo), que em todo esse tempo nesse estúdio, nunca decepcionaram com seus filmes. Por fim, Vingadores: Guerra Infinita é infinitamente épico, e eu definitivamente vou ver de novo. E sentir do mesmo jeito tudo de novo.\n\nOBS: Desculpa, mas se você assistiu esse filme e contou spoilers, você tem doença. Porque tudo que eu conseguia pensar ao terminar era o quanto as pessoas tem que saber DE MENOS sobre esse filme antes de assistir, o que eu senti naquelas 3 horas, todos que vão assistir (e gostam de vdd, não os modinhas) deveriam sentir.\n\nSimplesmente não da pra contar spoiler, é muita falta de respeito (isso pq spoilers ja são falta de respeito. Nesse filme é falta de respeito, de cérebro, de consideração pelo próximo e etc). um bjo pra quem leu tudo <3\n\nNota: Infinita/10","displayName":"Henrique V","displayImageUrl":"https://graph.facebook.com/v3.3/937517123010575/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T19:17:11.000Z","updateDate":"2018-04-29T15:40:22.000Z","user":{"userId":"973507607","realm":"RT","displayName":"Henrique V","accountLink":"/user/id/973507607"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"If I only had one Marvel movie to watch for all eternity, this would be it.  The seamless integration of the GoTG characters and Black Panther world give this movie an edge above the other installments.  The conflict is well-established at the beginning, reminding us where we left off, and (love it or hate it) ends with a stunning conclusion that left people literally crying in the theaters (though I was the one maniacally laughing.)  Doctor Strange is greater in this movie than in his own stand-alone film.  There are a few characters I would have liked to have more screen-time (Captain America) but their limited performance was not a hindrance to the film as there were plenty of characters to follow.  The relationship between Star Lord and Iron Man was an overwhelming success, and some have asked for more films starring these two actors.  In summary, the film is the greatest in the franchise history.","displayName":"Kurtis R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T19:16:49.000Z","updateDate":"2018-05-05T03:56:25.000Z","user":{"userId":"977244067","realm":"RT","displayName":"Kurtis R","accountLink":"/user/id/977244067"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"I can't even feel my legs right now! There are no words for what I just saw.... What the entire phuk.... BEST MOVIE I'VE EVER SEEN IN MY LIFE!! ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T19:15:37.818Z","updateDate":"2018-04-27T19:15:37.818Z","user":{"userId":"867497720","realm":"RT","displayName":null,"accountLink":"/user/id/867497720"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Lives up to the hype. Loved it. Possibly the best MCU movie since Guardians Vol 1.","displayName":"Nick C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T19:14:14.000Z","updateDate":"2018-04-27T19:15:05.000Z","user":{"userId":"907400007","realm":"RT","displayName":"Nick C","accountLink":"/user/id/907400007"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_0_5","review":"WARNING: DO NOT TAKE CHILDREN TO THIS MOVIE\nI grew up with Marvel and have usually enjoyed their movies...until now. This movie is DARK and FULL OF DEATH. There is no happy ending and no heroes that come to the rescue. I can't imagine the impact it will have on children who watch as Spiderman and other \"heroes\" become fearful of their impending death, and soon break apart and vanish into thin air. Frankly, I blame the greedy producers and Disney Studios who simply want to have a sequel and make more money. As for me, Marvel is dead in my book.","displayName":"Bob L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T19:14:08.000Z","updateDate":"2018-04-27T19:21:48.000Z","user":{"userId":"977244185","realm":"RT","displayName":"Bob L","accountLink":"/user/id/977244185"},"score":0.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Everything i wanted it to be. Plus more. It replaced my previous favorite MCU movie that held that title for years without competition.","displayName":"James W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T19:13:39.000Z","updateDate":"2018-04-27T19:15:14.000Z","user":{"userId":"977244189","realm":"RT","displayName":"James W","accountLink":"/user/id/977244189"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Pretty good movie, but why did they have to do that ; (","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/207713843371049/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T19:13:19.000Z","updateDate":"2018-04-27T19:13:47.000Z","user":{"userId":"977244187","realm":"RT","displayName":null,"accountLink":"/user/id/977244187"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Mark's Movie Review - #AvengersInfinityWar (5 Stars) -  An unbelievable experience that is astounding, amazing, fantastic, and so much more. Ten years with these characters have led to a movie that can truly raise the stakes like never before, which means that while the action and comedy are as great as the previous movies, some scenes are the most devastating of any movie I've ever seen. Strong script, a great villain, numerous inspired team-ups doing the movie, while a certain original Avenger almost steals the movie by himself. Marvel went all out with this movie, no choice was too risky, and I can not wait a year from now for the next movie.","displayName":"Mark W","displayImageUrl":"https://graph.facebook.com/v3.3/23708641/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T19:12:49.000Z","updateDate":"2018-04-27T19:41:03.000Z","user":{"userId":"799904196","realm":"RT","displayName":"Mark W","accountLink":"/user/id/799904196"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4","review":"The loooooooong awaited arrival of Thanos is an exhilarating, albeit overstuffed epic that will frustrate some viewers, and leave others completely enthralled. It's not the best MCU has ever brought to us, but seeing Earth's Mightiest Heroes team up (sort of) with the Guardians of the Galaxy is certainly a treat.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T19:11:32.247Z","updateDate":"2018-04-27T19:11:32.247Z","user":{"userId":"835402109","realm":"RT","displayName":null,"accountLink":"/user/id/835402109"},"score":4,"timeFromCreation":"Apr 27, 2018"}]}