{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84NDc0MTQ2NDEiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDYtMDNUMTc6Mjk6NTUifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84NjA5OTAzMjUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDYtMDRUMDY6MTY6NDkifQ=="},"reviews":[{"rating":"STAR_4_5","review":"Avengers Infinity War is the biggest culmination in the long-running Marvel Cinematic Universe. It is also one of Phase Three's best movies since Black Panther, Spider-Man: Homecoming, Thor: Ragnarok and Captain America: Civil War. In Avengers Infinity War, all the heroes on earth are about to face a threat that is bigger and more menacing than any of their past enemies. The mad titan, Thanos seeks to collect all the infinity stones as an opportunity to wipe out half of the human race. It is now up to the fractured Avengers and the Guardians Of The Galaxy to work together and defeat the mad titan and his children in order to prevent the destruction of the human race as time is running out for the heroes before Thanos can gain the upper hand against all of them. After nineteen movies, the Marvel Cinematic Universe has reached its full potential with its biggest movie to date. Featuring an all star cast, this film captures the spirit and combines the best elements of the Marvel world as the film reaches unexpected and surprising directions. Its understandable that the movie has a few flaws, nevertheless. I enjoyed this film for the second time. The best things about Avengers Infinity War is that this film does a job to create more emotions at the heart of its story since this film does an outstanding job to delve further into out favorite heroes' thoughts and we get to care and root for these heroes and understand how they feel when their biggest threat arrives to take them all down. The effects are seriously placed with maximum effort here as we get to see loads of outstanding visuals and CGI effects that are pushed to the limit. The villains are one of the major highlights of the Phase Three Marvel films that began with Helmut Zemo from Civil War up to Thanos (who has been established ever since he was first seen in the first Avengers movie) and his children who are just as threatening to the heroes as him thanks to superb casting and well written dialogue along with great interactions. The action is so non-stop from beginning to end. The suspense is so gripping that makes everyone feel excited for what happens next year on the upcoming Avengers 4. The twists and unexpected moments made me feel shocked and surprised and the tone is darker than the previous Avengers movies; plus the writing is so powerful, it shows that this film is Marvel's greatest effort as Infinity War does a good job balancing darkness and humor in one go. My only flaw with this film is that there is one scene that ruined the film and everyone knows which scene is it that I'm talking about, that's the part when Star-Lord attacked Thanos in a rage after learning about him killing his girlfriend Gamora in an effort to get the soul stone while the other heroes nearly succeeded in subduing the mad titan to his defeat. I still enjoyed the movie for the most part. Now like I said about the acting, the performances of the ensemble cast here is superb. From Tom Hiddleston as Loki to Tom Holland as Spider-Man. But the true highlight of this film is Josh Brolin as Thanos, he does a good job in portraying the character and has made us feel scared when he arrived on earth to wipe out the heroes and collect the stones. Seeing Thanos creates a dark mood and a deep vibe that makes you feel that his threats are so real, you'll see him in an unprepared way. The Russo Brothers did a very good job in making the biggest Marvel movie and it shows that this is their best effort since the last two Captain America films, now I am excited to see what they will do with the next Avengers movie. Overall Avengers Infinity War is a big and creative plus action packed movie that keeps you glued to the screen from its stunning visuals, compelling story, deep and dark thrills along with its balance of light and darkness in one go. This movie gets a 9.4/10 and I am pumped and excited for Avengers 4 next year.","displayName":"Kyle L","displayImageUrl":"https://graph.facebook.com/v3.3/1728810776/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-04T06:16:49.000Z","updateDate":"2018-06-04T06:54:47.000Z","user":{"userId":"860990325","realm":"RT","displayName":"Kyle L","accountLink":"/user/id/860990325"},"score":4.5,"timeFromCreation":"Jun 04, 2018"},{"rating":"STAR_4","review":"Avengers:Infinity War is by no means perfect. The pacing of the film is somewhat slow due to the numerous plot threads it carries. Some characters aren't able to be developed as much as others. The Children of Thanos do very little to be remembered (even if they can be viewed as a reflection of some of Marvel's other lesser developed villains).\nThe film is however a monument to everything the MCU has been able to build this past decade and the Russo Brothers are able to very successfully capitalise on the familiarity the audience has built with these characters over this period. A large majority of the enjoyment of this film comes from the characters and their interactions with each other, creating memorable and fun moments which many have been dreaming of for years. The film may not be accessible to new viewers who aren't particularly well informed on the MCU, but this is a film which shouldn't have to worry about that considering its massive scope and is allowed to trust the audience in knowing many of the characters. The way in which the Russo Brothers manage to nail every single one of the characters is astounding as they manage to stay true to many whilst also elevating a certain few (doctor strange is far more enjoyable here than in his own movie).\n\nThanos is the central character here and it was an incredible decision to make him so. It allows us to empathise with the villain and presents the hero's journey as experienced by a villain who believes himself to be the saviour of the universe, something which has been rarely done, and never successfully to my own knowledge, and is a welcome breath of fresh air in the superhero genre. \n\nDespite its dark subject matter, the film manages to balance the usual lighter tones of the MCU without compromising the more sombre moments. \nInfinity War is highly entertaining and rewarding for those who have followed the Marvel story (even if you have missed a few) and reminds me of the massive crossover events seen in comic books; a first of any movie in the MCU, and a welcome and exciting new prospect.","displayName":"Aaron C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-04T05:01:50.000Z","updateDate":"2018-06-04T05:24:27.000Z","user":{"userId":"977305578","realm":"RT","displayName":"Aaron C","accountLink":"/user/id/977305578"},"score":4,"timeFromCreation":"Jun 04, 2018"},{"rating":"STAR_5","review":"It did the best it could, for what it tried to pull off. All these franchises in part one of a two movie story. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-04T04:17:15.385Z","updateDate":"2018-06-04T04:17:15.385Z","user":{"userId":"260143215","realm":"RT","displayName":null,"accountLink":"/user/id/260143215"},"score":5,"timeFromCreation":"Jun 04, 2018"},{"rating":"STAR_0_5","review":"Why is this movie so clicheic!?","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-04T02:54:01.704Z","updateDate":"2018-06-04T02:54:43.185Z","user":{"userId":"260143189","realm":"RT","displayName":null,"accountLink":"/user/id/260143189"},"score":0.5,"timeFromCreation":"Jun 04, 2018"},{"rating":"STAR_4_5","review":"the memes that came from this movie were abundant and humorous. especially because thanos is a TRASH BOX and purple. i really enjoyed this movie and my favorite part is when the rubber band man song begins to play and the guardians emerge. i also can not even explain my excitement in every super hero marvel movie when the gang gets together and fights and that very specific superhero music begins to play. i feel jumping around the theater. i LOVED this movie however i was shocked and did have a full on brain aneurysm at the end. its fine. everything fine. im fine. im not actually fine. but part 2 cough cough i NEED it PLEASE","displayName":"Ro%20 R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-03T22:03:42.000Z","updateDate":"2018-06-03T22:03:51.000Z","user":{"userId":"977305255","realm":"RT","displayName":"Ro%20 R","accountLink":"/user/id/977305255"},"score":4.5,"timeFromCreation":"Jun 03, 2018"},{"rating":"STAR_5","review":"Absolutely incredible!!! The best movie of 2018!!!","displayName":"Matthew P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-03T21:32:43.000Z","updateDate":"2018-06-03T21:33:13.000Z","user":{"userId":"977303827","realm":"RT","displayName":"Matthew P","accountLink":"/user/id/977303827"},"score":5,"timeFromCreation":"Jun 03, 2018"},{"rating":"STAR_5","review":"AMAZING NOT ALL DAYS YOU SEE A MOVIE LIKE THIS","displayName":"Nahuel G","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-03T21:03:30.000Z","updateDate":"2018-06-03T21:05:12.000Z","user":{"userId":"977305211","realm":"RT","displayName":"Nahuel G","accountLink":"/user/id/977305211"},"score":5,"timeFromCreation":"Jun 03, 2018"},{"rating":"STAR_5","review":"Best Marvel movie to date...","displayName":"Brian F","displayImageUrl":"https://graph.facebook.com/v3.3/686281697/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-03T20:47:58.000Z","updateDate":"2018-06-03T21:10:25.000Z","user":{"userId":"847507708","realm":"RT","displayName":"Brian F","accountLink":"/user/id/847507708"},"score":5,"timeFromCreation":"Jun 03, 2018"},{"rating":"STAR_5","review":"One of the most enjoyable Marvel movies I’ve watched. Guardians of the Galaxy stole their scenes and combining Thor was brilliant. Interesting to see how Avengers 4 will be.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-03T18:39:06.755Z","updateDate":"2018-06-03T18:39:06.755Z","user":{"userId":"784138622","realm":"RT","displayName":null,"accountLink":"/user/id/784138622"},"score":5,"timeFromCreation":"Jun 03, 2018"},{"rating":"STAR_4","review":"Interesting, but predicable.","displayName":"Davidson H","displayImageUrl":"https://graph.facebook.com/v3.3/10153579362047650/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-03T17:29:55.000Z","updateDate":"2018-06-03T17:30:03.000Z","user":{"userId":"847414641","realm":"RT","displayName":"Davidson H","accountLink":"/user/id/847414641"},"score":4,"timeFromCreation":"Jun 03, 2018"}]}