{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNTQ5MzgiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDNUMDY6MDI6MTMifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF83ODI5NjQ4OTIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDNUMDc6MzY6MTEifQ=="},"reviews":[{"rating":"STAR_3","review":"It was  a fun movie to watch, but the story was all over the place. Never felt fully invested in it.","displayName":"Dale S","displayImageUrl":"https://graph.facebook.com/v3.3/510393259/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T07:36:11.000Z","updateDate":"2018-05-03T07:37:16.000Z","user":{"userId":"782964892","realm":"RT","displayName":"Dale S","accountLink":"/user/id/782964892"},"score":3,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_2_5","review":"SORRY BUT I THOUGHT THIS FILM WAS AVERAGE/MEDIOCRE/JUST OKAY. LOTS OF ACTION AND FIGHTING, PRACTICALLY NONSTOP, SO IF THAT IS WHAT YOU WANT, GREAT, BUT I THINK IT WAS OVERABUNDANT. THE FIGHTS COULD HAVE BEEN EDITED DOWN, SOME PERHAPS CUT, AND MORE OF A STORY AND WRAP-UP ADDED IN. SCREENPLAY SO-SO, JUST OKAY, STORY NOT SPECIAL, NO REAL INTERESTING PLOT TWISTS. MORE OF A STRAIGHTFORWARD NONSTOP FIGHT FILM, OVERALL. A FEW CUTE LINES HERE AND THERE. BUT NOT MUCH CHARACTER DEVELOPMENT. TRYING TO FIT EVERY HERO INTO THE FILM IN SOME SORT OF FIGHT, BUT IN TRYING TO DO MORE IT ACTUALLY DID LESS.","displayName":"Adam J. P","displayImageUrl":"https://graph.facebook.com/v3.3/100004629519440/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T07:22:34.000Z","updateDate":"2018-05-04T11:08:44.000Z","user":{"userId":"954610952","realm":"RT","displayName":"Adam J. P","accountLink":"/user/id/954610952"},"score":2.5,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_4","review":"Fast pace movie, the end is like...huh? ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T07:21:08.162Z","updateDate":"2018-05-03T07:21:08.162Z","user":{"userId":"976079924","realm":"RT","displayName":null,"accountLink":"/user/id/976079924"},"score":4,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_5","review":"I cannot stop thinking about this movie. It is amazing, not just as a superhero movie, but as a movie in general. Thanos is an amazing character that is neither campy or full of monologues as I expected him to be. Josh Brolin does an amazing job as Thanos and his character was well worth the wait. RDJ steals the show in this movie. If he’s been the one who’s at fault for all of the Avenger’s problems in the past, he makes up for it in this one as all of his fears come to fruition. Tony Stark will forever be the greatest Avenger and RDJ will be as memorable as Cary Grant, Gregory Peck and Marlon Brando. The action in this movie is top notch. This movie had few dull moments and the moments that were slow were few and far between on account that this entire movie acts as a nonstop climax. Though there are multiple deaths in this movie, I have to say that I was not affected by many of them. I feel that Marvel messed up with announcing its movie lineup for the next few years because it just proves that a lot of the heart wrenching scenes in this film are not permanent. This is a must see in the theater. Thanos throws a moon and it will not have the same effect at home. Go to the theater and watch this movie, that has been in the works for at least seven years and has had ten years of set up. It’s a cultural event that you must be a part of. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T07:14:54.988Z","updateDate":"2018-05-03T07:14:54.988Z","user":{"userId":"906471196","realm":"RT","displayName":null,"accountLink":"/user/id/906471196"},"score":5,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_5","review":"A LOT bETTER THAN EXPECTED!","displayName":"Marcin N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T07:07:56.000Z","updateDate":"2018-05-03T07:08:16.000Z","user":{"userId":"977011472","realm":"RT","displayName":"Marcin N","accountLink":"/user/id/977011472"},"score":5,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_1","review":"Not everything that glitters is gold! I'd say this often to the script-writers of the past years successful SciFi franchises. I mean, not every story that ends dramatically is profound, good or emotional. You do not become a name of the universal literature if you repeated the recipe with Romeo and Juliet. Neither applauded, nor famous, even rejected by some, and, definitely, you would polarize the audience. On the other hand, you get some franchise fans who will accept you uncritically, guardians of everything that's included in the story. Look at what's happening with Star Wars.\nReturning to Avengers, I see the scenario getting out of the accepted framework: they gave us 18 movies with the heroes of the Marvels universe (and movies about them) to kill them suddenly, unbalanced, easily.\nThe last \"Avengers\" resembles an episode of Dr. Who (older). I paraphrase it: in the last episode they destroyed the universe to revive it the following season.\nYes, it would seem. Although, there are some excuses for the TV series: the time crisis, the continuing production for several months (each season), the pressure of the producers, or of the heads of the TV station. The Rock-n-roll machine.\n\nBut the \"Avengers\" franchise had almost everything: a huge budget, PR, enormous production resources, an army in the back.\n\"Infinity War\" is not even that movie that you can say about: is not so bad that if you take it out from the bigger story, it could be OK, but it ruins the larger universe ... No. It's a dry sum of mini-stories (for the many characters), some of them gathered together to die like fools.\nI quote a friend: What's the fool, the one who wrote the screenplay or the one who laughed at the jokes of the \"Guardians of Galaxy\"?","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10155166119472504/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T07:04:48.000Z","updateDate":"2018-05-03T07:16:24.000Z","user":{"userId":"977255011","realm":"RT","displayName":null,"accountLink":"/user/id/977255011"},"score":1,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_5","review":"Absolutely different kinda Marvel movie, literally every character is great no matter how much significant they were. It is good they didn't ruin any superhero intros with unnecessary humour.","displayName":"Dikhyant D","displayImageUrl":"https://graph.facebook.com/v3.3/2061617134065195/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T06:55:46.000Z","updateDate":"2018-05-03T06:59:26.000Z","user":{"userId":"976348842","realm":"RT","displayName":"Dikhyant D","accountLink":"/user/id/976348842"},"score":5,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_4","review":"This was a thrilling and emotional movie. The action was extremely intense and there was the right amount of humor and emotion mixed in throughout. It’s not without its flaws, there were some slow parts and some rough dialogue here and there but for the most part it kept me very engaged. They did a great job making a coherent story despite having to manage so many characters and ultimately made me feel invested in the story and conflict. There were times in this movie where I caught myself gripping my seat because I was tensing up from the action! If you haven’t yet, go see this one in theaters. Overall well done, I will watch this one again. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T06:14:25.304Z","updateDate":"2018-05-21T06:20:11.745Z","user":{"userId":"260003038","realm":"RT","displayName":null,"accountLink":"/user/id/260003038"},"score":4,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_5","review":"Outstanding. Truly heartbreaking with real stakes and several \"Oh snap!\" moments.","displayName":"Jackson P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T06:09:19.000Z","updateDate":"2018-05-03T06:10:18.000Z","user":{"userId":"977254947","realm":"RT","displayName":"Jackson P","accountLink":"/user/id/977254947"},"score":5,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_4_5","review":"Avengers Infinity war is one of the best theatrical experiences to date. A true treat to the eyes making history not only in breaking box office records but for filming the entire movie  on IMAX cameras which was a real treat to the eye. Marvel is a powerhouse that is getting better in the care they are putting into with their villains with Michael Keaton's Vulture, Michael B. Jordan's Killmonger and now with James Broland's thanos. Who was such a great villain in which you understood the stance he takes even though you do not agree with it. Really they just flesh out is character very nicely. The Heroes of course no need to name them all , all play their role perfectly which should come as no surprise because they were casted perfectly. Overall a great film with a little pacing issues that can be overlooked. Great movie and am looking forward to the sequel.","displayName":"Daniel F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T06:02:13.000Z","updateDate":"2018-05-03T06:10:21.000Z","user":{"userId":"977254938","realm":"RT","displayName":"Daniel F","accountLink":"/user/id/977254938"},"score":4.5,"timeFromCreation":"May 03, 2018"}]}