{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzczNzY5OTUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDctMjNUMTU6Mzc6MDEifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzczNzgwNDIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDctMjRUMTM6NTY6MTcifQ=="},"reviews":[{"rating":"STAR_5","review":"\"It all ends here.\" Was the wait for Thanos worth it? YES! Every second of the wait was worth it for this emotional, heartbreaking, and shocking part one. Avengers: Infinity War dazzles viewers with great special effects and some of the best humor yet from all the characters we have learned to love (except Hawkeye, (WHERE ARE YOU MY FRIEND!?) Ant-man, and The Wasp). This is easily the most shocking superhero film ever and also one of the best.\n-9.5/10","displayName":"Christian C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-24T13:56:17.000Z","updateDate":"2018-07-24T14:01:29.000Z","user":{"userId":"977378042","realm":"RT","displayName":"Christian C","accountLink":"/user/id/977378042"},"score":5,"timeFromCreation":"Jul 24, 2018"},{"rating":"STAR_4","review":"A decade's worth of intertwined superhero adventures culminates in one staggering, towering behemoth of a film. It sounds like a tall order - and, clearly, it is - but Marvel's been doing this for quite a while now and seem to have a firm grasp of the essentials. Effectively juggling so many competing stars, flavors, themes and aesthetics was my largest concern, especially ones as disparate as Captain America and the Guardians of the Galaxy, and obviously that was a core focus for Infinity War's producers. Not only does each scene retain the characteristic tone and identity of its unique featured franchise, it also mixes fluidly with those of another, creating an unexpected blend that works almost effortlessly and moves in exciting new directions. This is really the essence of the Marvel universe, particularly so from a long-term reader's perspective, and it's something I've yet to grow tired of seeing on the big screen. Creating a great cast is step one, but watching them grow and interact with the unfamiliar is where the real magic happens. Each subsequent installment in the Avengers franchise ups that ante just a little bit further.\n\nNo doubt, I would've been content to just watch these familiar faces bounce around in the same enclosed space, trading zingers and butting heads, but there's an underlying reason for all this, and the film (somehow) doesn't shortchange that, either. Thanos, the big wrinkle-chinned monster who's been hinted at and referenced for years, has finally come to town with a destructive cause in mind. Well-rounded villains have not been a strength for the MCU thus far, but in this case they make amends. Thanos is quickly and efficiently established as a galactic-level threat, far and away the most powerful creature we've seen so far, and then unexpectedly fleshed out as a fully-realized three dimensional character. We may not agree with his means, but his motivation is certainly understandable. That's a new thing, a clearly addressed criticism, and it makes the film far stronger.\n\nSo, yes, I enjoyed myself. The new Avengers is a big deal, it takes big risks, and judging from the box office numbers, it's reaped big rewards. There are also several little flaws for those interested in picking. Most glaringly, it falls into the trap of being merely half a movie. After the better part of three hours, I left the theater with the feeling I'd just binge-watched an entire season of an expensive TV series and been left hanging with a \"tune in next time.\" Its story is obviously incomplete, and while that's played for maximum effect in the stunning conclusion (the first time I've ever seen an entire theater sit through a credit roll in complete silence), that stuck in my craw. My other complaints can be largely brushed away as inconsequential - inexplicably missing characters, too many guest spots, a not-insignificant barrier of entry - but that's a relatively big one and something that I keep revisiting. Having cleared my chest of that, though, I'll strongly recommend it as a fundamental bit of summer blockbuster history, even if it isn't quite summer yet. Potential viewers should already know what to expect (Infinity War is just another refinement in the well-worn Marvel formula) and whether or not that's remotely up their alley. If so, by all means, go see it more than once. This is the best entry yet. And maybe, just maybe, it'll shine even more brightly as a Lord of the Rings style all-day anthology. Once the story is actually complete, that is.","displayName":"Sean L","displayImageUrl":"https://graph.facebook.com/v3.3/627296696/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-24T12:03:23.000Z","updateDate":"2018-07-24T12:06:01.000Z","user":{"userId":"793676809","realm":"RT","displayName":"Sean L","accountLink":"/user/id/793676809"},"score":4,"timeFromCreation":"Jul 24, 2018"},{"rating":"STAR_4","review":"I fell asleep through a few parts but cuz I was sleepy. My son loved it ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-24T08:16:25.558Z","updateDate":"2018-07-24T08:16:25.558Z","user":{"userId":"853565597","realm":"RT","displayName":null,"accountLink":"/user/id/853565597"},"score":4,"timeFromCreation":"Jul 24, 2018"},{"rating":"STAR_3","review":"Was ok in some sense but it brought too many Marvel hero's in the movie, they should have left a few out and concentrated on the story thing a little theme of another Marvel character coming in like getting on the bus wasting too much theater time. Second $300 million for this film is a huge ripoff to pass on to the movie theater to rent the film because they production budget was over the top too expensive, you can blame the expensive actors for breaking the budget and they're greedy agents pushing their actor demands for too much acting money. It was wasn't a $300 quality movie, it looked like it was $50 million of work instead. The fact these expensive demanding ripoff actors for asking too much and 14,000 people behind the set getting $15.00 an hour with no royalties either. You can blame liberal Hollywood for separation of income and quality from minimum wage and million dollar actors all on the same set. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-24T07:28:12.067Z","updateDate":"2018-07-24T07:28:12.067Z","user":{"userId":"904373613","realm":"RT","displayName":null,"accountLink":"/user/id/904373613"},"score":3,"timeFromCreation":"Jul 24, 2018"},{"rating":"STAR_5","review":"It's the biggest movie","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/216068395719649/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-23T22:20:59.000Z","updateDate":"2018-07-23T22:21:49.000Z","user":{"userId":"977377550","realm":"RT","displayName":null,"accountLink":"/user/id/977377550"},"score":5,"timeFromCreation":"Jul 23, 2018"},{"rating":"STAR_4_5","review":"A dream come true this movie. The actions scenes in this movie are probably the best action scenes ever in any movie. A few character inconsistencies and a few lackluster scenes but a very strong conclusion to this movie.","displayName":"Daniel C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-23T18:30:47.000Z","updateDate":"2018-07-23T18:33:54.000Z","user":{"userId":"977367125","realm":"RT","displayName":"Daniel C","accountLink":"/user/id/977367125"},"score":4.5,"timeFromCreation":"Jul 23, 2018"},{"rating":"STAR_4_5","review":"Avengers Infinity war is fantastic, with spectacular action scenes. That has a perfectly satisfying ending.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/618181251915493/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-23T17:49:03.000Z","updateDate":"2018-07-23T17:51:52.000Z","user":{"userId":"977377151","realm":"RT","displayName":null,"accountLink":"/user/id/977377151"},"score":4.5,"timeFromCreation":"Jul 23, 2018"},{"rating":"STAR_5","review":"This is one of the BEST movies I have ever seen.","displayName":"Thobeobo S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-23T17:18:48.000Z","updateDate":"2018-07-23T17:19:08.000Z","user":{"userId":"977377142","realm":"RT","displayName":"Thobeobo S","accountLink":"/user/id/977377142"},"score":5,"timeFromCreation":"Jul 23, 2018"},{"rating":"STAR_2_5","review":"Great Movie till the end.  I feel after a 10 year build we should have been given a better ending.  End it when Thanos snaps his fingers.  Leave us guessing.  But to leave it on a cliffhanger we know HAS to be resolved in order for the MCU to continue, felt cheap.  Especially considering the foundation this movie had underneath it.","displayName":"Tommy S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-23T16:00:05.000Z","updateDate":"2018-07-23T16:02:59.000Z","user":{"userId":"977377013","realm":"RT","displayName":"Tommy S","accountLink":"/user/id/977377013"},"score":2.5,"timeFromCreation":"Jul 23, 2018"},{"rating":"STAR_5","review":"This is an Amazing Movie one of Marvel Studios Best Movie yet the Acting is good ,the Action is Fantastic, There are Memorable scenes , it's Fun to watch,and  it's really Funny ,this one of the best movies I've seen I give it 10/10","displayName":"Yahir G","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-23T15:37:01.000Z","updateDate":"2018-07-23T15:40:12.000Z","user":{"userId":"977376995","realm":"RT","displayName":"Yahir G","accountLink":"/user/id/977376995"},"score":5,"timeFromCreation":"Jul 23, 2018"}]}