{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyMTA3OTUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjVUMTk6NDQ6MTkifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MDA2MTkyNDUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjVUMjA6NDg6MzUifQ=="},"reviews":[{"rating":"STAR_4","review":"It's hard to draw comparisons to the major commitment to long-form storytelling that the Marvel Cinematic Universe (MCU) has dabbled with over the course of ten record-shattering years of success. I can think of movie franchises that have been popular over long periods of time, like James Bond, but rarely do they keep to continuity. It's been 18 movies and ten years since the caddish Robert Downey Jr. first stole our hearts in the original Iron Man, and its stable of heroes and villains has grown exponentially. Looking at the poster for Avengers: Infinity War, it's hard to believe there's even enough space just for all of the actors' names. Infinity War feels like a massive, culminating years-in-the-making film event and it reminded me most of Peter Jackson's concluding Lord of the Rings chapter, Return of the King. After so long, we're privy to several separate story threads finally being braided as one and several dispirit characters finally coming together. This is a blockbuster a full decade in the making and it tends to feel overloaded and burdened with the responsibility of being everything to everyone. It's an epic, entertaining, and enjoyable movie, but Infinity War can also leave you hanging.\n\nThanos (Josh Brolin) has finally come to collect the six infinity stones stashed around the universe. With their power, he will be able to achieve his ultimate goal of wiping out half of all life in the universe. Standing in his murderous way is a divided Avengers squad, with Tony Stark (Downey Jr.) still on the outs with a wanted-at-large Captain America (Chris Evans) and Black Widow (Scarlett Johansson). One of the in-demand infinity stones resides in the head of the Vision (Paul Bettany), who is in hiding with his romantic partner, Scarlet Witch (Elizabeth Olsen). They know Thanos will be coming for Vision eventually. On the other side are the Guardians of the Galaxy who have a few personal scores to settle with Thanos, the adopted father of Gomora (Zoe Saldana) and Nebula (Karen Gillan). Elsewhere, Thor (Chris Hemsworth) strikes out looking for the key to defeating the big purple menace. Thanos' loyal lieutenants attack Earth to gather the remaining infinity stones, drawing the attention and push-back of Doctor Strange (Benedict Cumberbatch) and Peter Parker (Tom Holland). The various heroes of Earth and space unite to eliminate the greatest threat the universe has ever known.\n\nAvengers: Infinity War serves not as much a series of payoffs as it is climaxes, with climactic event right after another, and this time it's for keeps (more on that below). There are moments that feel like major payoffs and moments that feel like shrug-worthy Last Jedi-style payoffs. Infinity War is the longest MCU movie yet at 149 minutes but it has no downtime. That's because it has to find room for dozens of heroes across the cosmos. With the exception of three super heroes, everyone is in this movie, and I mean everyone. This is an overstuffed buffet of comic book spectacle, and whether it feels like overindulgence will be determined by the viewer's prior investment with this cinematic universe. If this is your first trip to the MCU, I'd advise holding off until later. Any newcomer will be very lost. I've deduced the seven MCU movies that are the most essential to see to successfully comprehend the totality of the Infinity War dramatics, and they are Iron Man, The Avengers, Captain America: Winter Soldier, Guardians of the Galaxy, Captain America: Civil War, Doctor Strange, and Thor: Ragnarok. Naturally, being intimately familiar with the previous 18 movies will be best, but if you don't have thirty hours to spare then please follow my seven-film lineup and you'll be solid.\n\nAs far as the stakes, the MCU has been notoriously reluctant about killing off its characters, but Infinity War is completely different. I won't spoil circumstances or names, of course, but the march of death happens shockingly early and carries on throughout. There are significant losses that will make fans equally gasp and cry. This is a summer blockbuster that leaves behind an impressive body count across the known universe and ends in a downbeat manner that will naturally trigger reflexive Empire Strikes Back comparisons. It's hard to feel the full impact of the drastic decisions, and the grief over their losses because I know there is a Part Two coming summer 2019, and with that comes the almost certainty that several important events will be diminished or straight-out reversed. After all, in comics, nobody is ever really dead, though with movies the heroes have the nagging habit of aging. With that said, you better believe I was holding my breath during some standoffs, tearing up at some sudden goodbyes, and reflecting upon journeys shared.\n\nThis is very much Thanos' movie, which was one of the bigger surprises for me. Beforehand, our exposure to the big purple guy has been relatively minor, a brief moment here or a cameo there during a post-credit scene. Considering Thanos is supposed to be the universe's biggest bad, it makes sense to finally give him his due, and that is what Infinity War does. Thanos gets the most screen time of any character and is given an honest-to-God character arc. He's a villain who goes on an actual emotional journey as he follows a path that he feels compelled to even as it tests him personally. He finally opens up as a character rather than some malevolent force that is oft referred to in apocalyptic terms. We get his back-story and motivation, which is less a romantic appeal to Death like in the comics and more a prevention of the apocalypse reminiscent of the Reapers in the Mass Effect series. Thanos sees himself as a necessary corrective force and not as a villain. He's never portrayed in a maniacal, gleeful sense of wickedness. Instead he seems to carry the heaviness of his mission and looks at the Avengers and other heroes sympathetically. He understands their struggle and defiance. Having an actor the caliber of Brolin (Deadpool 2) is a necessity to make this character work and effectively sell the emotions. Thanos is the most significant addition to the MCU appearing the latest, so there's a lot of heavy lifting to do, and Infinity War fleshes him out as a worthy foe.\n\nAs an action spectacle, however, Infinity War is good but not great. The action sequences are interesting enough but there's nothing special and little development. There's nothing that rivals the delirious nerdgasm of the airport battle in Civil War pitting hero-against-hero to dizzying degree. The characters are separated into units with their own goals leading to a final confrontation that feels more climactic conceptually than in execution. That's because this is an Avengers film that falls into some of the trappings of the glut of super hero cinema, namely the army of faceless foot soldiers for easy slaughtering, the over exaggerated sense of scale of battle, the apocalyptic stakes that can feel a bit like a bell rung too many times, and even minor things like the lackluster supporting villains. Thanos' team of lieutenants are all the same kind of sneering heavy with the exception of one, a sort of alien cleric heralding the honor of death from Thanos. Carrie Coon (HBO's The Leftovers) is generally wasted providing the mo-cap for the Lady Lieutenant That Sounds Like a Band Fronted by Jared Leto, a.k.a. Proxima Midnight. There are far too many scenes where characters reluctantly strike a deal to give up an infinity stone if Thanos will spare the life of a beloved comrade. The film's greatest point of entertainment isn't with its action but the character dynamics. The fun is watching years-in-the-making character interactions and seeing the sparks fly. There's more joy in watching Downey Jr. and Cumberbatch try and out smarm one another than with any CGI collision of a faceless army of monsters. There are so many characters that few are given fully defined arcs. Most are given beginnings and stopping places. Though the eventual sequel will have fewer characters needing to share precious screen time.\n\nThe standouts on screen are Hemsworth (12 Strong) carrying a large portion of the movie and not missing a beat of his well-honed comic rhythms from Ragnarok, Bettany (Solo) brings a sad soulfulness to Vision as a man who knows fate is likely unavoidable, and Dave Bautista (Blade Runner 2049) is perfectly deadpan as Drax and has the funniest lines in the movie followed closely by the exuberant Holland (Lost City of Z). To even say which characters deal with more complex emotions might be a spoiler in itself but there are several actors showing an emotive level unseen so far in the bustling MCU.\n\nAvengers: Infinity War marks a significant concluding chapter for one of cinema's most popular series, until at least the next movie possibly makes it feel less conclusive. I pity Marvel because expectations are going to be astronomical for this climactic showdown. There are so many characters, so many crossovers, and so much to still establish, like Thanos as a character more than a spooky force of annihilation, that it feels rather breathless even at nearly two-and-a-half hours. You may be feeling a rush of exhilaration on your way out or an equally compelling sense of exhaustion. Infinity War doesn't have the imaginative highs of a Dcotor Strange, the funky personality and style of a Guardians of the Galaxy, the wonderfully thought-out structure of a Spider-Man: Homecoming, the adroit weirdness of a Thor: Ragnarok, or even the hero-against-hero catharsis of a Civil War (still my favorite). What it does have is a sense of long-gestating finality, of real stakes and dire consequences. It's not all pervading doom and gloom; this is still a fun movie, buoyed by crackling character team-ups and interactions. While, Infinity War won't be all things to all people, myself included, it will please many fans, casual and diehard alike.\n\nNate's Grade: B","displayName":"Nate Z","displayImageUrl":null,"isVerified":false,"isSuperReviewer":true,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T20:48:35.000Z","updateDate":"2018-05-12T18:15:26.000Z","user":{"userId":"900619245","realm":"RT","displayName":"Nate Z","accountLink":"/user/id/900619245"},"score":4,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"War.... war never changes.. But this movie? Seems to change everything within the setting and still makes the viewer wanting to know more at eh credits.","displayName":"Darin C","displayImageUrl":"https://graph.facebook.com/v3.3/100006307985137/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T20:36:05.000Z","updateDate":"2018-04-25T20:37:27.000Z","user":{"userId":"957844748","realm":"RT","displayName":"Darin C","accountLink":"/user/id/957844748"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_4","review":"was better than i expected with all the characters that they had to use paced quiet well you just never really got to stay with anyone for long and there was no time to biuld relationships also it was a little on the exmachina as far as people being in the right place at the right time and i know i am going to sound evil for saying this i liked Thanos LOL also what happened to valkyrie ?  and i no that at the end the pager message was sent but could captain marvel have been turned to dust to its rather convenient that the one who nick fury sends message to is alive","displayName":"lisa s","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T20:18:01.000Z","updateDate":"2018-04-26T16:18:01.000Z","user":{"userId":"975659831","realm":"RT","displayName":"lisa s","accountLink":"/user/id/975659831"},"score":4,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"k\nOK OK just finished watching Avengers: Infinity War... I'm speechless\n\nMother of all that is holy, this film will brake you, this film will amaze you...... THE FILM IS A MASTERPIECE!\n\nShocks, twists and turns, unexpected returns and above all universe shattering...\n\nMarvel has done a work of art.. Nothing can prepare you for this film NOTHING..\n\nEverything you expect from Marvel throw it out the window....\n\nThe end is now and we were not ready\n\n10/10","displayName":"Alex E","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T20:10:32.000Z","updateDate":"2018-04-25T20:15:18.000Z","user":{"userId":"926773695","realm":"RT","displayName":"Alex E","accountLink":"/user/id/926773695"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_1","review":"I'm going to start by saying SPOILERS,,, the film wasn't bad, but it was just okay. It surely had its moments of comedy and action set pieces but as a comic book fan, it disappointed me in MANY ways.\nFirstly, Thanos' (revamped for film) motive was extremely flawed. As I remember it... Thanos' motivation to kill half the population is because he wants all planets to live in peace with no hunger, homelessness, poverty etc. Just like his home planet didn't So his solution is to collect all the infinity stones for the infinity gauntlet as that would give him the power to wipe out half of the universe with just one snap of his fingers. So, this movie wants people to believe that THIS SOLUTION (that Thanos has thought up) is the only logical one to carry out? Could the powers of the infinity gauntlet not just aid Thanos in his quest for 'World Peace' by helping him gather resources? I mean he can literally bend time & space, right? Can he not gather food and shelter from another time? Possibly the future? Maybe Thanos is lazy and that's why he would just rather kill half the universe instead of using the gauntlet to save it and if that is the case, then this might possibly be the worst superhero motive with the most catastrophic consequences that has ever been seen on screen.\nSecondly, The Hulk, what on earth were they thinking when writing the Hulks character. At the start of the film he has a fist fight with Thanos which ends pretty one sided. Since that fight, Banner can no longer turn into the Hulk because the Hulk is afraid?? The Hulk... the most fearless avenger who has just spent many years as an undisputed gladiator is too afraid to come out because he's lost one fight?? It just felt like they couldn't find space for the hulk in this movie but had to have someone take Silver Surfers place in the story because Strange needed to be told that Thanos is coming. Lazy.\nThirdly, Star Lord may not be the brightest superhero in the MCU but he's capable to know  the difference between the right thing is to do in a situation and what is the wrong thing. I'm talking about the scene where the team on titan almost remove the Infinity Gauntlet from Thanos. Long story short Thanos explains he had to kill Gamora and Star Lord goes full moron mode and risks the lives of half of the entire universe, so he can lay a few sucker punches on Thanos. Very bad writing.\nAnother problem I had was the comedy, although sometimes fun it was also sometimes used in just the WRONG scenes. Once again, a scene involving Thanos and Star Lord when Thanos has hold of Gamora and Star Lord must kill her as she requested. This scene was incredible, tense and extremely well-acted UNTIL... bubbles. Yes, Thanos turns Star Lords gun into a bubble gun. This totally ruined the scene for me as I just couldn't take it seriously. It was clear that the story couldn't have Star Lord kill Gamora so they needed a situation to stop that form happening but why did the writers have to make it comedic? Why didn't they come up with another way that could keep the intense feel of the scene, instead of just making it into a scene the audience could laugh at. The MCU do tis TOO MUCH in their movies.\nOne more problem had with the film (I have many more problems, I just can't do this all day, pun intended) is Gamora's death. When Red Skull explains to Thanos that only a sacrifice of someone you love can grant you the soul stone I SWEAR it must take Gamora about 2 years to realise Thanos is obviously going to throw her off the cliff. She starts being a smartass like \"ohh you don't love anyone haha who you going to throw then? haha lol\" obviously not exactly what she said but it may as well have been. Gamora was just stupid in this scene and very out of character. \nOkay so onto the things I enjoyed but can't really say much about because, well, they were just okay, not mind-blowing so I'm just going to list cool moments. Strange was good in this movie and I think he needed more screen time because honestly, he carried this film. Every scene he was in he just owned. Next good point, Drax, he was hilarious! All his funny scenes just landed perfectly and had me nearly in tears on two occasions which is crazy because the rest of the films jokes just didn't seem to land for me. Lastly the action set pieces were good but that is just standard for CBM's these days.\nAll in all, it was an okay movie in terms of it had a beginning and an end... but much more bad outweighed the good for me. \nRating 2/5","displayName":"Leon A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T20:08:32.000Z","updateDate":"2018-04-27T05:41:51.000Z","user":{"userId":"977157042","realm":"RT","displayName":"Leon A","accountLink":"/user/id/977157042"},"score":1,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"One of the greatest movies ive ever watched, an emotional rolleroaster while keeping you engaged.","displayName":"Brandon S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T19:57:36.000Z","updateDate":"2018-04-25T19:58:30.000Z","user":{"userId":"977238856","realm":"RT","displayName":"Brandon S","accountLink":"/user/id/977238856"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_3_5","review":"It was very entertaining, but rather depressing at the end.","displayName":"Lena M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T19:55:22.000Z","updateDate":"2018-04-25T19:56:11.000Z","user":{"userId":"976961464","realm":"RT","displayName":"Lena M","accountLink":"/user/id/976961464"},"score":3.5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"Hands down best and most anticipated marvel movie!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10209404979556052/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T19:48:45.000Z","updateDate":"2018-04-25T19:49:25.000Z","user":{"userId":"977238845","realm":"RT","displayName":null,"accountLink":"/user/id/977238845"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"This was the most epic supermovie i've watched ever!","displayName":"Cristiano V","displayImageUrl":"https://graph.facebook.com/v3.3/1010898498948698/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T19:47:38.000Z","updateDate":"2018-04-28T19:12:18.000Z","user":{"userId":"973670778","realm":"RT","displayName":"Cristiano V","accountLink":"/user/id/973670778"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"Best marvel movie yet!","displayName":"Nathan K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T19:44:19.000Z","updateDate":"2018-04-25T19:44:36.000Z","user":{"userId":"977210795","realm":"RT","displayName":"Nathan K","accountLink":"/user/id/977210795"},"score":5,"timeFromCreation":"Apr 25, 2018"}]}