{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNDU4MTUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMDk6MTg6MzgifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84OTY5NzYxNzciLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMDk6Mjg6MzIifQ=="},"reviews":[{"rating":"STAR_4_5","review":"With many people speaking about superhero fatigue when it comes to watching movies on the big screen, you'd think that we'd be in a box office drought by now. Obviously, that isn't coming anytime soon, because as long as this Marvel Cinematic Universe continues to surprise its fans and become one of the longest-running franchises in film history, I can't see myself ever losing interest. The hype surrounding this film is massive and arguably the largest ever, due to the sheer notion that people have been watching this series for the last ten years. \n\nNobody could've expected them to make it this far and be this grand, but have they ever done it with this one. Avengers: Infinity War marks the 19th film in this franchise and easily has the most storylines happening at the same time, but if I said I didn't have an absolute blast watching this movie, then I would be lying. From an emotional end to some very funny and exciting action sequences, here's why I loved my experience of this film.\n\nThis is the type of movie that will be ruined for those who choose to know more about the core premise than they are given at first. Honestly, every ten minutes brings a surprise that leads into the next scene, so it's very difficult to discuss this movie in depth. That being said, Thanos has finally arrived and plans on wiping out half of humanity in order to bring balance to the universe. Pretty much at random, he will select the half that he wishes to live or die. To do this, his mission is to track down six infinity stones that will allow him to accomplish this with the snap f his fingers. Any other information would ruin this experience for you, so I'll leave it at that.\n\nAs far as the characters go, that's probably consecutively the biggest positive and negative that this film has to offer. Yes, seeing everyone is amazing and some of the interactions were the most welcomed portions of the film, but there are times when the movie does seem a little overly ambitious in including everyone that it possibly can. There are a few members left out of the movie, and I personally feel they did that in order to leave room to breathe during this installment. With that said, I personally just enjoyed seeing everyone and didn't let the overload of characters bother me.\n\nThroughout the years, whether it was starting fresh with a movie like Guardians of the Galaxy or jumping into Iron Man 3 without having seen the rest of the movies, newcomers could've easily figured out the missing pieces. Avengers: Infinity War doesn't quite game that same effect, solely due to the fact that there are callbacks and blatant references to films at the very beginning of the franchise. So yes, my recommendation would be to see every movie in the series in order to be fully connected to the events of this movie. For fans of this universe, I don't believe they could've received a more satisfying climax.\n\nFrom Robert Downey Jr. to Tom Holland, Elizabeth Olsen to Benedict Cumberbatch, the spectrum of performances is on another level here. Everyone is devoted to these characters, but the true standout is easily the performance of Josh Brolin as Thanos. I have a feeling that everyone will be talking about him as the most fleshed out villain this franchise will ever see. His backstory and motivation definitely bring a needed layer to this movie and everyone else gets their time to shine as well. This is a crowd-pleasing movie that also takes risks that I don't think people will be expecting.\n\nIn the end, Avengers: Infinity War is one of the most satisfying theatrical experiences I've had in quite some time. From the running time being the longest one yet and feeling pretty fast, to the climax of the movie leaving me quite emotional, to wondering about where they could possibly go next, to the sheer notion of seeing this many characters on-screen at the same time and it not feeling too bloated, I loved my entire experience of this film. Aside from it feeling a little overstuffed at times, Joe and Anthony Russo have crafted yet another fantastic entry in the Marvel Cinematic Universe. It was also a joy to hear the score from The Avengers making a comeback as well. For fans of the franchise, I can't recommend this movie enough. For newcomers, make sure you've at least seen most of the movies. This is a wonderful blockbuster.","displayName":"KJ P","displayImageUrl":"https://graph.facebook.com/v3.3/733768972/picture","isVerified":false,"isSuperReviewer":true,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T09:28:32.000Z","updateDate":"2018-05-11T08:00:13.000Z","user":{"userId":"896976177","realm":"RT","displayName":"KJ P","accountLink":"/user/id/896976177"},"score":4.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4","review":"Not making a lot of senses but very entertaining ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T09:26:42.383Z","updateDate":"2018-04-28T09:26:42.383Z","user":{"userId":"847896747","realm":"RT","displayName":null,"accountLink":"/user/id/847896747"},"score":4,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Hands down, the best Marvel movie of all time.  Possibly one of the best action movies of all time.","displayName":"Shane F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T09:25:42.000Z","updateDate":"2018-05-14T22:16:05.000Z","user":{"userId":"976596741","realm":"RT","displayName":"Shane F","accountLink":"/user/id/976596741"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Perfectly balanced movie, filled with great action, comedy, visual effects and amazing soundtrack.. And a good villain that we can relate to. A villain who proves his point by giving great examples and at the end lets us wonder whether he was actually right the whole time...","displayName":"Daniel P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T09:24:29.000Z","updateDate":"2018-04-29T10:03:39.000Z","user":{"userId":"977245826","realm":"RT","displayName":"Daniel P","accountLink":"/user/id/977245826"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Avengers Infinity war ... is something special... it's not a normal ending and giving some hope... this movie is a magic .. i believe this movie takes the viewer another level with great experience... if you not watch this movie on theatre you lost an great cinematic experience...","displayName":"leon j","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T09:23:30.000Z","updateDate":"2018-04-28T09:54:26.000Z","user":{"userId":"977245825","realm":"RT","displayName":"leon j","accountLink":"/user/id/977245825"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"As i lay in bed a good 36 hours after watching this film, i am still enthralled with the concepts, sequences and visuals i saw on the big screen with this film. I am the target audience, yes; and that is perfectly fine because this film was made for people like me: young adults who grew up with animated series, comic books, Iron Man (the movie), etc.\n\nThis is truly the beginning of the end of an epic finale 6-10 years in the making (6 if you want to nitpick on the end credit sequence from Avengers 2012). \n\nEven on a purely technical level, this film is a marvel in itself. I have never seen such a well written, perfectly paced film of this magnitude with so many moving parts running on all cylinders. \n\nI truly cannot wait to watch this movie again and again. Thank you Marvel for this moment and i shall reward you handsomely with 5 stars, my first ever review AND my wallet.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/605437163154600/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T09:23:03.000Z","updateDate":"2018-04-28T09:33:52.000Z","user":{"userId":"977245823","realm":"RT","displayName":null,"accountLink":"/user/id/977245823"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4_5","review":"Beautifully done and wonderfully executed from start to finish. We got a ten year wrap up that left people spell bound and totally in awe. At times the action was a bit fast paced but all told it was handled with an eye towards a comic book fight. This is how a comic book hero movie is done and done right.","displayName":"Michael S","displayImageUrl":"https://graph.facebook.com/v3.3/639686164/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T09:22:23.000Z","updateDate":"2018-04-28T09:24:33.000Z","user":{"userId":"795766416","realm":"RT","displayName":"Michael S","accountLink":"/user/id/795766416"},"score":4.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"An emotional roller coaster of a movie coalescing 10 years of Marvel Superheroes into the greatest collaboration of all time.  I am looking forward to the direction of Marvel movies in the future.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1957794767605017/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T09:21:59.000Z","updateDate":"2018-04-28T09:25:06.000Z","user":{"userId":"977245820","realm":"RT","displayName":null,"accountLink":"/user/id/977245820"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4","review":"Good movie, thanks to what they want Disney did not show its more childish side, if there are jokes, but I feel that by far is one of the most epic marvel movies.","displayName":"Yael A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T09:21:47.000Z","updateDate":"2018-04-28T09:23:54.000Z","user":{"userId":"977245819","realm":"RT","displayName":"Yael A","accountLink":"/user/id/977245819"},"score":4,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Great movie...the all characters have a important participation on the history,there is a strong Thanks that can put fear and you can see the consequences of this movie on the future of MCU","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/986148521539699/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T09:18:38.000Z","updateDate":"2018-04-28T09:21:41.000Z","user":{"userId":"977245815","realm":"RT","displayName":null,"accountLink":"/user/id/977245815"},"score":5,"timeFromCreation":"Apr 28, 2018"}]}