{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY3ODkzOTkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDZUMDg6NDc6NTAifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwOTIwNDciLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDZUMTA6MTY6MTMuNTU5WiJ9"},"reviews":[{"rating":"STAR_4","review":"Fun and exciting movie. Marvel did a great job! Can’t wait for the next movie to come out. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T10:16:13.559Z","updateDate":"2018-06-09T03:44:49.116Z","user":{"userId":"260092047","realm":"RT","displayName":null,"accountLink":"/user/id/260092047"},"score":4,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_4","review":"It has all led to this.  So after a decade of hinting, Thanos (Josh Brolin) is finally here.  He is making his play to obtain all of the Infinity Stones, and if he gets his hands on all six, he will be able to erase half of the population in the entire universe simply by snapping his fingers.  Will the mightiest heroes of Earth and the galaxy be able to pull together and save the day?  Even when we got the first Avengers, there was never anything like it that had ever even been attempted before.  Now, ten years and eighteen movies later, they have once again upped the ante with a crossover so ambitious, there is no word for it other than unprecedented.  I will not get into spoilers, as I, myself, tried to go into this as cold as possible (which the internet made exceptionally difficult), but you should most definitely go check this out if you've been watching these movies all these years.  Now this is from the Russo brothers who are responsible for some of the best movies in this cinematic universe, like The Winter Soldier and Civil War.  They are up to the task with Infinity War, and they incredibly manage to interweave over two dozen major characters without making the film feel overcrowded.  This is something that Age of Ultron could have benefited from, and it baffles me that they were dealing with a smaller lineup there.  It is cool to see characters cross paths that have never done so before, like Hulk with Black Panther or anybody else with the Guardians of the Galaxy, but there's really not all that much time for that.  This is really Thanos' story, and once again Marvel has made another villain where you may not necessarily relate to him, but you absolutely get where he's coming from.  All of the snappy quips that you have come to expect from these movies are in full force, which is absolutely needed here because this is the movie where things get serious.  The stakes have never been higher and for the first time in a long time in these movies, nobody feels safe.  Actor's contracts are expiring in the real world, and it makes you get into the story more because at any moment, any one of these characters can meet their end, even the major ones.  Infinity War moves at a good clip and does a masterful job at the balancing act that is telling five interconnected storylines all at the same time.  I will say that you do feel the length of this, but I think you would say that about any movie that is two and a half hours long.  It is thrilling, engrossing and extensive, and while I don't think this does anything new, it certainly delivers on everything that it promises.  The majority of the last hour to this is just straight action, which is likely what most are here for.  If you've been keeping up, you've probably already watched this at this point.","displayName":"John M","displayImageUrl":"https://graph.facebook.com/v3.3/25106477/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T10:15:13.000Z","updateDate":"2018-05-06T10:15:14.000Z","user":{"userId":"782214838","realm":"RT","displayName":"John M","accountLink":"/user/id/782214838"},"score":4,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"If I ever have to watch how Bucky Barnes dies right in front of Steve ever again I'll sue Marvel","displayName":"Kaija W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T10:10:05.000Z","updateDate":"2018-05-06T10:14:41.000Z","user":{"userId":"977259309","realm":"RT","displayName":"Kaija W","accountLink":"/user/id/977259309"},"score":5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"This movie does all that fans have been asking Marvel for. We've been asking to see the Guardians team up with the Avengers, we've asked to see the extent of Thanos and the infinity stones' powers, we've asked to see pure, actual, meaningful death of great characters. And the Russo brothers' Infinity War is an amazing movie that leaves fans on a cliffhanger by doing the one thing we never see, the villain winning.","displayName":"Saideep P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T09:43:40.000Z","updateDate":"2018-05-06T09:45:57.000Z","user":{"userId":"977259279","realm":"RT","displayName":"Saideep P","accountLink":"/user/id/977259279"},"score":5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_4_5","review":"Okay, the first line: I absolutely did like the movie!\n\nOverall I think the hype of the movie was too much for this movie, it wasn't THAT good (still very good).\nSomething I didn't like was: too many characters for such a \"short\" movie (149 minutes ... short ... yeah). \nI did like the character interaction, thou the pairings of the characters were pretty obvious, not very surprising.\nThe end was awesome, it works as the end of a movie but also works as the first act of a two-part-movie (there were people crying in the end)\nThe effects are generally good, but sometimes you can see the effects.","displayName":"Sven K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T09:43:15.000Z","updateDate":"2018-05-06T09:43:20.000Z","user":{"userId":"976413269","realm":"RT","displayName":"Sven K","accountLink":"/user/id/976413269"},"score":4.5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"It was amazing, funny, emotional (at one point me and my friend cried for a full three minutes) and an all around great movie. definitely would recommend to anyone whether your an edgy twelve year-old like me or a die-hard marvel fan, its definitely worth watching.","displayName":"Joe P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T09:09:21.000Z","updateDate":"2018-05-07T12:18:47.000Z","user":{"userId":"977259246","realm":"RT","displayName":"Joe P","accountLink":"/user/id/977259246"},"score":5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_3_5","review":"I'll give this movie a solid 3 stars, but I'll add another half for the more sadder ending. While I really loved the action, the amount story progression and cast means that there's little time to give everyone the action what makes these super heroes so great. For instance, Hulk, Vision and Scarlett are insanely powerfull characters, but are so weakened to continue towards the plot that it's isanely disappointing. It's a real fun movie to watch, the humor is on point, but with every Marvel blockbuster nowadays, you can expect this story to be really predictable and dull. Not even to mention the cliche moments, you'll know what I'm talking about if you've seen it.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1572633652783742/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T09:07:46.000Z","updateDate":"2018-05-06T09:27:38.000Z","user":{"userId":"976926143","realm":"RT","displayName":null,"accountLink":"/user/id/976926143"},"score":3.5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_1","review":"This movie has no idea how to make you feel sorry for certain characters. Thanos was a weak villain who was in fact too emotional and full of crap. A villain trying to be an evil God with that kind of bullshit fake ness is crap. The action scenes were very lack lustre compared to all the other avenger movies. Thanos couldn't strike fear into anyone with those terrible facial expressions. The other marvel movies are a lot better and I think this one was probably one of the worst ones, but not as bad as fantastic four... which no ones seen lol","displayName":"Mitchell O","displayImageUrl":"https://graph.facebook.com/v3.3/569720569/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T08:56:58.000Z","updateDate":"2018-05-06T09:00:57.000Z","user":{"userId":"785868545","realm":"RT","displayName":"Mitchell O","accountLink":"/user/id/785868545"},"score":1,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"One of the best cinematic experience ever in my opinion.. all MCU bring together on one giant spectacle..","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/964388587062467/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T08:56:13.000Z","updateDate":"2018-05-06T08:59:59.000Z","user":{"userId":"977093643","realm":"RT","displayName":null,"accountLink":"/user/id/977093643"},"score":5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"Awesome the way  they did it 10 years in the making .will not dissappoint unless your DC in wich this is 19 greats to one,oh dear.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/795622803977911/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T08:47:50.000Z","updateDate":"2018-05-06T08:49:59.000Z","user":{"userId":"976789399","realm":"RT","displayName":null,"accountLink":"/user/id/976789399"},"score":5,"timeFromCreation":"May 06, 2018"}]}