{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MDEwMjA0NDUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMjM6MDU6NDcifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NDk3Mzg3MTIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMjM6MTQ6NTUifQ=="},"reviews":[{"rating":"STAR_5","review":"Mind blowing !  I simply cannot wait till Avengers 4. Absolutely go see this movie if you haven't already.","displayName":"James C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T23:14:55.000Z","updateDate":"2018-04-27T23:16:41.000Z","user":{"userId":"949738712","realm":"RT","displayName":"James C","accountLink":"/user/id/949738712"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4","review":"I can't wait until next year!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T23:14:14.311Z","updateDate":"2018-04-27T23:14:14.311Z","user":{"userId":"260004255","realm":"RT","displayName":null,"accountLink":"/user/id/260004255"},"score":4,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"Great movie! Can't wait to see it again!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T23:13:19.566Z","updateDate":"2018-04-27T23:13:19.566Z","user":{"userId":"944988356","realm":"RT","displayName":null,"accountLink":"/user/id/944988356"},"score":4.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_1_5","review":"Holly tomatoes and very very rotten!!! What the hell!!! How is that possible... I hope this doesn't ruin the franchise.","displayName":"Juan J","displayImageUrl":"https://graph.facebook.com/v3.3/516266366/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T23:12:45.000Z","updateDate":"2018-04-27T23:13:38.000Z","user":{"userId":"787387599","realm":"RT","displayName":"Juan J","accountLink":"/user/id/787387599"},"score":1.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"BEST MOVIE EVER!!!!!\nI've watched IW for 4 times. Marvel just shutthfkup and take my money!!!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1589680177824878/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T23:12:20.000Z","updateDate":"2018-04-27T23:14:12.000Z","user":{"userId":"977244744","realm":"RT","displayName":null,"accountLink":"/user/id/977244744"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"This movie doesn't deserve any negativity.\n\nAs much as people think superhero movies are 'just a fad' or taking over the screens and leaving smaller lesser known films to be unnoticed it's not true at all. Marvel/Disney have done a tremendous job in bringing comic books to a larger audience which never would've thought about picking up something so 'childish' \nKids will grow up with these what 18 movies remembering them for a lifetime as well as there kids...\n\nAmazing achievement Russo's Infinity War is what defines cinema","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10152340346486726/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T23:10:10.000Z","updateDate":"2018-04-27T23:16:58.000Z","user":{"userId":"977244738","realm":"RT","displayName":null,"accountLink":"/user/id/977244738"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_3_5","review":"The directors an excellent job by giving every \"Avenger\" screentime. I would definitely be watching again!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/579610879088086/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T23:10:00.000Z","updateDate":"2018-04-27T23:12:13.000Z","user":{"userId":"977244735","realm":"RT","displayName":null,"accountLink":"/user/id/977244735"},"score":3.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_1_5","review":"A terrible funny  disjointed illogical eyecandy plot hole-riddled movie. Good for one time look-see, but that's about it. Oh wait, Thanos is actually a great villain (by Hollywood standards)!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10204645013321252/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T23:08:47.000Z","updateDate":"2018-04-27T23:10:34.000Z","user":{"userId":"977244734","realm":"RT","displayName":null,"accountLink":"/user/id/977244734"},"score":1.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"(Spoilers will be included) When Marvel said the stakes were going to be high, they were not joking. This entry into the MCU has the most on the line and the most to lose out of all the past 18 films. It is best summarized as an epic film with an epic story. There are so many things happening with so many characters that at times, you may feel overwhelmed. However, Marvel does what they do best and that’s deliver. The cast is huge but they are balanced pretty well; something that DC still has not been able to do. This is also the first Marvel movie where I felt that there was no “down time.” It starts off heavy hitting and it never stops. There is constantly something happening with so much action. In a way this is awesome, but at the same time it is overwhelming as a previously stated. Near the middle of the film I began to get exhausted with everything that was going on, but this feeling did not last for long. This film shines with the great characterization, darker story elements, and stunning visuals. The few places it falls flat is in regards to the pacing; however, there is not really a way to avoid this when you take into consideration how many character had to be balanced. The big bad guy who finally gets his time to shine is the mad titan Thanos. He is not one of the “forgettable” villains that many MCU movies struggle with. He has a story to him that is meaningful and I hate to say it but he is very relatable, and that is what all antagonist need. While he is doing unspeakable things, the audience still understands where he is coming from. Not only is the “what” addressed, but also the “why.” Thanos is a top 5 villain in the MCU no doubt. Moving onto the rest of the cast, this is where the film falls a little flat, but not too much. Like I said previously, it is near impossible to craft a story that addresses all of the character’s mindsets, feelings, strengths, and weaknesses when the cast is this huge. This movie definitely could have been split into two separate parts, but it is astonishing when you take into consideration how well it is made for a two and a half hour film. Now onto some spoilers; I guarantee whatever you expected to happen, is not going to happen. I will just say it right away, Thanos won. He acquired all six infinity stones, snapped his fingers, and cleansed half the universe. If you expected older characters to die, you are wrong. All characters that were in the first Avengers are still living. This is where the shock comes; the new characters that many believed to be the future of the MCU, like Black Panther, Spider-Man, and Doctor Strange, are all turned to ash. Now of course, Marvel has a plan up their sleeves like they always do and will most likely find a way to bring them back. For me, this is a mixed bag. I appreciate that the “World’s Mightiest Heroes” lost; I think it is important to let the bad guys win from time to time because that is not what the audience would expect. However, it seems like death does not even matter in movies like this anymore because there is always some magical way to come back, and that is not good. If all your characters come back to life time and time again, what does death even mean? There is no weight to killing characters anymore and that is the unfortunate part. Sure it was shocking that they killed off half their cast, but as the credits roll, you know that “well they are coming back duh.” All and all, this movie is a thrill ride. You will not be falling asleep during this one, even if you are not a marvel fan as there is no time to. Everything matters and that is why this movie is one of the strongest in the MCU. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T23:07:36.493Z","updateDate":"2018-04-27T23:07:36.493Z","user":{"userId":"974960506","realm":"RT","displayName":null,"accountLink":"/user/id/974960506"},"score":4.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"One of the best movies of the decade. If you haven't seen the first 18, though, you probably won't enjoy it. DC fanbois, you will most likely hate it, unless you also love Marvel. Not advised for anyone who hates superheroes, as it has a plethora of them. Thanos is just spectacularly villainous, and amazingly well-played in motion-capture by Josh Brolin. They finally got CGI right. Don't read the pro critics before you see the movie.","displayName":"Pope Snarky Goodfella O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T23:05:47.000Z","updateDate":"2018-05-02T02:25:51.000Z","user":{"userId":"901020445","realm":"RT","displayName":"Pope Snarky Goodfella O","accountLink":"/user/id/901020445"},"score":5,"timeFromCreation":"Apr 27, 2018"}]}