{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MDAyMDQwMjEiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMTY6Mzk6NDEuNzQwWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84NjYxMTUxMzgiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMTY6NDg6MjgifQ=="},"reviews":[{"rating":"STAR_5","review":"Just got back from the theater...100% legit team-up movie!   The best Avengers movie to date!!!","displayName":"Carl S","displayImageUrl":"https://graph.facebook.com/v3.3/1512531414/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T16:48:28.000Z","updateDate":"2018-04-27T16:48:48.000Z","user":{"userId":"866115138","realm":"RT","displayName":"Carl S","accountLink":"/user/id/866115138"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_3_5","review":"The comedy was on the mark, but the scenes that were designed to make the audience feel for the characters rarely worked","displayName":"everett b","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T16:47:32.000Z","updateDate":"2018-08-05T01:05:56.000Z","user":{"userId":"977025954","realm":"RT","displayName":"everett b","accountLink":"/user/id/977025954"},"score":3.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_0_5","review":"DISNEY NEVER CHANGE, IS MORE AND MORE THE SAME MOVIES, PLEASE MAKE A MOVIE MORE REALISTIC LIKE A MESSAGE TO THE HUMANITY NOT THIS CRAP. NOLAN IS THE BEST IN SUPERHEROES MOVIES AND DARK KNIGHT TRILOGY THE BEST OF ALL TIME SUPERHEROES MOVIES","displayName":"Edgardo R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T16:47:18.000Z","updateDate":"2018-04-27T16:49:25.000Z","user":{"userId":"939515189","realm":"RT","displayName":"Edgardo R","accountLink":"/user/id/939515189"},"score":0.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"WHAT....A.... F#$%ING MOVIE......DC, take notes. all I gotta say. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T16:46:26.499Z","updateDate":"2018-04-27T16:46:26.499Z","user":{"userId":"974095129","realm":"RT","displayName":null,"accountLink":"/user/id/974095129"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"By far one of the best marvel movies to this day","displayName":"Isadora F","displayImageUrl":"https://graph.facebook.com/v3.3/100001627540998/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T16:45:49.000Z","updateDate":"2018-04-27T16:46:19.000Z","user":{"userId":"973165421","realm":"RT","displayName":"Isadora F","accountLink":"/user/id/973165421"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Perfect in every way. Perfect story and blend of all characters and a masterpiece. Tells a story and truly makes you feel every kind of emotion ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T16:45:38.216Z","updateDate":"2018-04-27T16:45:38.216Z","user":{"userId":"971137263","realm":"RT","displayName":null,"accountLink":"/user/id/971137263"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"One of the best movies to date. They truly engage with every film in the series, bringing in plot points otherwise easily missed, giving life to characters who needed it, and engaging in the emotional fallout of a world in crisis. With a few faces, we get a real sense of what is at stake here. Gamora, Thor, Bruce, Tony, Vision, and Strange each of unique stories that, together, tell a whole. We do not yet know why these characters make the choices they did. A significant portion of this film is dedicated to Thanos, and our Antagonist does not disappoint. A must see for any fan of the MCU.","displayName":"David S","displayImageUrl":"https://graph.facebook.com/v3.3/26402853/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T16:44:32.000Z","updateDate":"2018-04-27T16:49:29.000Z","user":{"userId":"803745320","realm":"RT","displayName":"David S","accountLink":"/user/id/803745320"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Impresionante como los hermano Russo han conseguido que tanto personaje junto funcione, sin claros protagonistas y con un villano a la altura del Joker de Ledger.","displayName":"julio%20 p","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T16:43:59.000Z","updateDate":"2018-05-24T13:32:43.000Z","user":{"userId":"976948768","realm":"RT","displayName":"julio%20 p","accountLink":"/user/id/976948768"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_3","review":"The number of thoughts that I have to unpack about Avengers: Infinity War is astronomical. It is a film I will need to see again for several reasons, and a movie where I reserve the right to change my opinion as it grows on me. My initial impression when I left the theater was one of frustration and disappointment. It did a lot of things right, and there were moments that I loved, but the overall product was not great. I had high expectations, which is understandable for a film that is the culmination of 10 years of great movies, and I’m not sure any movie could have lived up to those expectations. However, the first Avengers film did manage to live up to all I expected, so I thought this one might as well. Perhaps when all is said and done I’ll look back on this as a winner, but as it stands now, I am unhappy. Also, before I get into spoilers, I have to say something about 3-D. I no longer go out of my way to see anything in 3-D because it never works for me as much as I want. But the only show time that fit in our schedule was a 3-D showing, so we went with it. I am fully aware that the 3-D boom that got its big boost when Avatar came out has begun to die. As a result, it appears that Marvel/Disney has ceased to put effort into their conversions. In a good 3-D conversion they up the color and brightness to account for the darkness caused by the glasses. Avengers: Infinity War did not do that. The film looked so dark that it seems like every scene was taking place in the middle of the night. Even the brightest scenes felt like they were filmed in twilight hours. So this is my formal warning to you, do not see Avengers: Infinity War in 3-D if at all possible! Everything I say from here on could be viewed as a spoiler by someone, so stop reading if you want to maintain the mystery… Comics Convergence - What works best in Infinity War is that the Russo’s have a great feel for these characters, and a reverence for all that has come before. The humor still exists in some parts, because the characters we know as wise-cracking guys get to crack wise again. The story connects many arcs that have been set up before, and it takes no time to re-explain things we should already know. Perhaps more than any other movie in the history of cinema, Infinity War requires homework. If you have not seen more than half of the MCU movies up to this point (preferably all of them,) I cannot imagine you will appreciate this movie, or care about the characters involved in it. It is roughly akin to the season finale of a TV show, so it defies being rated as a stand-alone film. Middle Movie - The other reason that Infinity War fails to be a stand-alone film is that it ends on what amounts to a cliffhanger. Things aren’t properly resolved in any way, and you’re just waiting for what comes next. I felt like this movie ended right when the actual story began, but I’ll dig deeper into that later. It’s hard, because when you have a movie that is the Empire Strikes Back of a series, it can come across as incomplete until you have that resolution. I don’t know how my opinion of this movie will change when it becomes the middle piece that it clearly is meant to be, but right now I’m disappointed because I was hoping for a conclusion to all that came before instead of one more tease of what’s coming. Seeing Spoilers - Infinity War is a film where I actively avoided all trailers in order to go in unspoiled. Most of the time this went off without a hitch, but there are moments when you’re on the internet and you happen upon something by accident. In this case I saw an image of Captain America fighting to push back the Infinity Gauntlet. This is a moment that takes place in the last 10 minutes of the film, and I knew it was coming. It is so frustrating that I know how things are going to play out on Titan no matter what plan the heroes might have to remove the Infinity Gauntlet, because I’ve already seen that Thanos will still be wearing it and will head to Earth. Repetition Reasons? - There was something about the story-telling in Infinity War that felt like it was repeating the same beats. There were at least 3 or 4 moments in the movie that focused on a hero being asked to sacrifice themselves or one of their friends for the greater good. It never seemed to come to fruition until the very end, and then that one was conveniently reversed. It didn’t work well for me, and I was a bit annoyed that it kept coming up, but I think it was intended more as a thematic through-line that would connect all the disparate stories together. When I go back and see it again I hope I’ll be able to come to terms with this aspect and even appreciate it. Oh, and while we’re talking about repetition, I cannot believe this is the third out of three Avengers movies where they end up fighting a gigantic horde of faceless creatures in a big battle at the end. Clueless Characters - There’s a problem in Infinity War with characters being idiots. I hate when there are plot contrivances that make no sense for the character and are added just for the sake of reaching a desired end goal, and that happens more than once in this movie. For example, all of the Avengers and Wakandans on Earth are intent on sacrificing whatever they need in order to destroy the mind gem. That is the singular goal of their entire battle and Scarlet Witch needs to stay with Shuri and Vision to make that happen. But when a particular moment comes in the battle that she’s watching from a distance she suddenly decides to abandon the most important job in the universe so she can go fight with her friends. As another example, it amazes me that Star-Lord loses his cool when everything is working to get the gauntlet off of Thanos’ hand, and he spoils the entire mission (that he claimed to plan himself.) You might sit there and say, “But wait, Peter’s always been hot-headed and he just professed his love for Gamora, it makes sense for him to lose his cool.” You’d be right if not for the fact that Doctor Strange has already looked forward into the future to see what is coming. This is knowledge he could have imparted to Star-Lord long before Thanos arrived in order to avoid exactly what we see happen. For that matter, we’ve already seen that an open, and quickly closing magical portal can dismember someone. Why isn’t Doctor Strange’s first plan to use a portal to sever Thanos’ gauntleted hand? Everybody Everywhere - A big concern going into Infinity War was that they wouldn’t have enough time, or an effective way of allowing dozens and dozens of established characters to all have a purpose. This was one of the strongest points of the entire movie. There were certainly some minor characters who didn’t have a vital role, but most of the way through everybody had a purpose and a clear goal. This did lead to a somewhat disjointed story, because it didn’t seem like they were connecting the threads until the end. I don’t mind because I like all the characters enough to keep jumping from one group to the next just to keep tabs on what people are doing, but I could see others hating that aspect. Inherent Inevitability - This is the first part of why I walked out of Infinity War frustrated. From the moment that Thanos first appeared after the end credits of the first Avengers, most Marvel fans knew one simple thing, Thanos was going to collect all the Infinity Stones and put them in the gauntlet. It’s a foregone conclusion, because that’s one of the biggest storylines in comic book history. Therefore, when we go in knowing Thanos will have all 6 stones eventually, it’s frustrating to watch a movie that takes more than two hours to get us there. And even more irritating that the movie stops mere minutes after that happens. The whole movie is like that scene with Thanos and Gamora trying to get the Soul Stone. Every single human being in the theater knows from the moment the stakes are laid out what is coming, but they have to drag it out and act as if Gamora is totally clueless. That’s this movie in a nutshell, an ending we all see coming and yet it is dragged out for hours before we can get to it. Franchise Frustration - This was what broke Infinity War for me, and will continue to be an issue for me going forward. There are certain problems with the modern information age and how franchises are handled. One of the big ones is that we are fully aware which movies are popular, what characters have been successful, and even what future films are planned. So when I see a final scene that involves the supposed death of dozens of characters it loses all stakes for me because I know there is no way they will abandon those aspects of the franchise. Sure if one member of the Guardians of the Galaxy dies, I can believe that might be permanent. But when almost all of them go I know they will retcon that. When the main character of the biggest money-making comic book movie ever made (and one who already has a sequel announced) disappears we know he’s coming back. It’s hard for me because I want to be impacted by the loss of people I loved, but a minor character like Yondu has a more heart-wrenching death than all of these great heroes combined. And, going forward, I will care less and less when people die in these movies because there is no permanence in the entire MCU. So, that’s where I’m at right now with all the many things I have been able to articulate today. I will definitely be seeing Infinity War again, and I have a feeling my opinion will improve when I go in knowing what to expect. There are a lot of great things in the movie that I loved, so that’s what I’m going to try to focus on going forward, and let go of the disappointment that I felt this first time through. However, I cannot imagine that this will ever be listed among my favorite films in the MCU, and there is a chance it will be one of my least favorite. I never would have expected that going in, but I guess this movie has defied most people’s expectations.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T16:42:12.042Z","updateDate":"2018-04-27T16:42:12.042Z","user":{"userId":"855043855","realm":"RT","displayName":null,"accountLink":"/user/id/855043855"},"score":3,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"THRILLING & DEVASTATING","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T16:39:41.740Z","updateDate":"2018-04-27T16:39:41.740Z","user":{"userId":"900204021","realm":"RT","displayName":null,"accountLink":"/user/id/900204021"},"score":5,"timeFromCreation":"Apr 27, 2018"}]}