{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY1NTQzMzciLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMTg6MTE6NTMifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NTYzNjE2NDkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMTg6Mjc6NTcifQ=="},"reviews":[{"rating":"STAR_5","review":"The best all time superheroes movies.\nFull action, story and suprises.","displayName":"Walter V","displayImageUrl":"https://graph.facebook.com/v3.3/100000488228508/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T18:27:57.000Z","updateDate":"2018-04-28T18:29:38.000Z","user":{"userId":"956361649","realm":"RT","displayName":"Walter V","accountLink":"/user/id/956361649"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"SPOILER REVIEW:\n\nIt exceeded my expecTations. I actually cried when Spider man died. i feel like thanos is  relatable when he has a bonding moment. my only problem is random red skull, other than that it was amazing. my second favorite thing in the mcu. my favorite mcu thing is the punisher netflix series.","displayName":"Hayden P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T18:25:45.000Z","updateDate":"2018-04-28T18:29:54.000Z","user":{"userId":"976784988","realm":"RT","displayName":"Hayden P","accountLink":"/user/id/976784988"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"The two things that Marvel movies have always been under criticism for are their villains and lack of stakes.  Not only does Infinity War put those criticisms away, it takes full advantage of the gravitas of the comic book it's based on.  I can't really imagine a better way that the MCU could have closed out a 19 movie arc, while also perfectly setting up the final (for now) installment next May.\n\nIn one of the gutsiest and deadliest superhero films to date, The Russo Brothers have once again delivered a meaningful and thought provoking entry into the MCU.  I don't know how they did it, but they managed to give all 30 something characters time to shine while also giving several of the big Avengers or Guardian related characters an impactful arc of their own.  There are very minute pacing issues that perhaps some casual fans may take issue with, but for someone who has been with this universe from the beginning, I ate it all up.  I'm not sure there are any directors who could have possibly executed this story as well as The Russo brothers did.\n\nAs with Age of Ultron, I worried that the tone of the trailers (dark and serious) wouldn't really translate to the movie, as the MCU is known for its humor.  Ultron was a very funny movie but it still felt like a missed opportunity to not have a little more emotional weight to that story.  Luckily, Infinity War brilliantly balances humor, heart, and some serious sh*t that goes down in this adventure-heist-thriller.  \n\nMuch like its comic-book counterpart, Infinity War follows Thanos (and it's largely his story) and his quest for the 6 Infinity stones which gives him the power to wipe out half the universe.  How can you possibly give someone like that shades of humanity and an understandable motivation? Well somehow they did it, and when Thanos or someone else does things that bring the emotion out of him, it's some of the best sequences of the film.\n\nMost impressively, the Russo's and the writers figured out a way to pick up where we left each character while also making it fit into an Avengers story that needed them to more specific things related to a bigger threat.  In other words, this film is driven by characters and not plot.  As much as I love Age of Ultron, it feels more like a film that had their characters act based on where the filmmakers wanted the plot to go (i.e. Thor's quest in the middle of the film).  Infinity War is far from that, and is clearly structured by filmmakers who still have stories left to tell in this universe.\n\nI could go on and on about specific plot elements, scene stealers, surprises, and the bold direction the film takes, but I decided to take a more vague approach to this review to not spread the spoilery thoughts that the internet has been filled with the past few days.  In short, Infinity War is the most balls to the wall film Marvel has ever done, but still fills it with brilliantly quiet moments that made Civil War and Winter Soldier so groundbreaking.\n\n10/10","displayName":"Thomas D","displayImageUrl":"https://graph.facebook.com/v3.3/100000124099262/picture","isVerified":false,"isSuperReviewer":true,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T18:25:18.000Z","updateDate":"2018-04-28T18:26:00.000Z","user":{"userId":"936312900","realm":"RT","displayName":"Thomas D","accountLink":"/user/id/936312900"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4_5","review":"Setting the bar high for summer blockbusters, infinity war is an action packed and overall fun time at the movies. The style and comedy of guardians of the galaxy is surprisingly well integrated with the darker tones of the plot and other characters in the marvel canon. Some of the more emotional and intimate scenes can be lost on the audience but that seems inevitable due to the large ensemble cast of characters. Any hiccups can be overlooked even by non comic fans for the simple fact that infinity war brings all the heroes together on screen for the first time for a thrilling ride.","displayName":"Eric T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T18:24:05.000Z","updateDate":"2018-04-28T18:31:25.000Z","user":{"userId":"977240566","realm":"RT","displayName":"Eric T","accountLink":"/user/id/977240566"},"score":4.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Fantastic... Ambitious, and so many times more satisfying than I had hoped for!!!!!!  I actually loved it, and when the last seconds of the tag-on revealed a Ms Marvel connection, I actually teraed up!","displayName":"Bryon%20 M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T18:21:51.000Z","updateDate":"2018-04-28T18:24:00.000Z","user":{"userId":"977246965","realm":"RT","displayName":"Bryon%20 M","accountLink":"/user/id/977246965"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4_5","review":"This movie was great and I loved it but there parts where it just took a while but then they just rushed the ending. After Black Panther I thought this movie was going to be disappointing but it wasn't, Each character has an arc and my favourite character arc was Thanoses and well Thor's arc in this film was amazing but i would have to say that Thanos was a better and more drawn out character and I think Black Panther needed more of this","displayName":"Timothy G","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T18:21:11.000Z","updateDate":"2018-09-07T04:26:36.000Z","user":{"userId":"977142108","realm":"RT","displayName":"Timothy G","accountLink":"/user/id/977142108"},"score":4.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Amazing. A must see for everyone. Action, character development, humor, emotion, and keeping you on the edge of your seat the whole movie. Best superhero movie yet. Can't wait for next one.","displayName":"Braylon C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T18:17:08.000Z","updateDate":"2018-04-28T18:20:08.000Z","user":{"userId":"977246953","realm":"RT","displayName":"Braylon C","accountLink":"/user/id/977246953"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Well done. Met expectations by exquisitely balancing comedy, action, and drama. Made me even more excited for the finale and anxious about how the world will finally flush out. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T18:14:02.798Z","updateDate":"2018-04-28T18:15:47.007Z","user":{"userId":"952365591","realm":"RT","displayName":null,"accountLink":"/user/id/952365591"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Very well done. They were able to get all these characters into one movie and also have it make sense too. Nothing felt like it was forced and they all contributed to the greater story.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T18:13:47.343Z","updateDate":"2018-04-28T18:13:47.343Z","user":{"userId":"807881007","realm":"RT","displayName":null,"accountLink":"/user/id/807881007"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4","review":"Easily the best Marvel movie ever. The tone change from all the other MCU movies really helped too!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1897897683798071/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T18:11:53.000Z","updateDate":"2018-04-28T18:13:14.000Z","user":{"userId":"976554337","realm":"RT","displayName":null,"accountLink":"/user/id/976554337"},"score":4,"timeFromCreation":"Apr 28, 2018"}]}