{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwODc4MjciLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjlUMDE6MDQ6MTIuNjk5WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MzY2MjY2NzIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjlUMDE6MjE6NTIuOTM3WiJ9"},"reviews":[{"rating":"STAR_5","review":"WOW!!!!!!!!! Best Marvel movie ever!!!! ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T01:21:52.937Z","updateDate":"2018-05-06T00:25:30.147Z","user":{"userId":"936626672","realm":"RT","displayName":null,"accountLink":"/user/id/936626672"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"There's no way you can just watch this movie once an be satisfied","displayName":"Robert D","displayImageUrl":"https://graph.facebook.com/v3.3/100000149522122/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T01:21:39.000Z","updateDate":"2018-04-29T01:22:52.000Z","user":{"userId":"886448860","realm":"RT","displayName":"Robert D","accountLink":"/user/id/886448860"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"A movie that shatters all expectations. I walked out of the theather shocked. It pays off the 10 years I invested in the franchise. I loved it so much.","displayName":"D V","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T01:20:52.000Z","updateDate":"2018-04-29T01:26:37.000Z","user":{"userId":"977247712","realm":"RT","displayName":"D V","accountLink":"/user/id/977247712"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Awesome action packed movie. Great surprise ending... didn't expect it at all.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T01:18:20.306Z","updateDate":"2018-04-29T01:18:20.306Z","user":{"userId":"954650770","realm":"RT","displayName":null,"accountLink":"/user/id/954650770"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_4","review":"Originally when the hype for Infinity War started rolling around fans, myself included, and the mainstream world were interested how much a part one out of two to ending the main three phases of Marvels gigantic cinematic universe could make a villian that was built up truthfully too much as a force to be remembered. And the first time seeing the film I remember being worried it follow suit of overkill after not liking Raganrock and Black Panther as much as everyone else; but by the end of it I found myself having more than a great time but more really kind of floored that the film really wasn't afraid to push out of its comfort zone to effectively tell its story. And seeing it again it was even more than that. \n\nI think besides a couple of things things, two mostly minor in hindsight, that kind of took away from being engaged as much; with some of the pacing and even editing/cuts in the first half feeling too disjointed and a bit too quick to get to the later parts of the film, some of its CG being a bit too compressed in some moments and action sequences, and in the same vein the first half using some really obvious coincidental plot points to have for example Peter Parker and even the Guardians meeting Thor. Other than that though, especially seeing it another time, i'm actually really happy to say the film does a ton to stand well on its own and tell a REALLY compelling tale; this comes thanks to pretty solid committed performances by all of its cast who are written so well and in toned with their franchises and films, pretty engaging action sequences that never really felt either overstretched or overbearing as most critics seem to take issue with and where actually pretty creative and helped move the plot and get really weird and fun, a fantastic opening that on its own is to be praised for how effective it's visually shot, framed, makes good use of tone and the theme of death that WILL happen in the film and introducing our main villain rather well while quickly setting up the story to unfold; all of which was done so well it was reminiscent of Iron Man's brilliant opening, really creative usage of world building and especially wides, and the last two major things that help elevate this film which being Thanos, as he thankfully lived up to the genuine intrigue the trailers made him out to be as an utterly creative and surreal CGI capture performance adds so much character to him and Josh Brolin bringing in an UTTERLY gripping character driven performance with a psychotic yet understanding but threatening persona, and finally the final third act that feels genuinely earned and not as cheap cope out to really bring into full circle ultimately Thanos's whole arc. \n\nSo overall even after a second viewing, there is a lot good that this film has, and it felt like the Russo Brothers and their accompanying screenwriters really took the thematic elements and character building they've been doing since Winter Soldier and Civil War and tackled somehow tackling even bigger hurdles; showing they can still show Marvel Studios dedication to really trying to do both better in quality and at least do what's best for the story. Congrats to everyone, both Feige and the Russo's and everyone for making this work pretty well! And with Endgame coming out, I can say with reflection this serves as the nice solid stakes to set up the finale. \n\nScore: 8.5 / 10","displayName":"Shayan S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T01:17:34.000Z","updateDate":"2019-04-27T22:33:47.000Z","user":{"userId":"951302741","realm":"RT","displayName":"Shayan S","accountLink":"/user/id/951302741"},"score":4,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"seriously amazing. Go see this!! I really couldn't say enough good things about it. watched it again. haven't done that in a long time. this movie is amazing. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T01:15:17.901Z","updateDate":"2018-05-07T07:51:10.833Z","user":{"userId":"260016264","realm":"RT","displayName":null,"accountLink":"/user/id/260016264"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"The stakes are incredibly high in this one which makes the action scenes extremely tense and exciting. Thanos is formidable, complex, full fleshed out villain. He's unstoppable and the whole cosmic scope of the story has a sense of almost existential dread. There is humour, heart and heroism to burn. It's an incredible spectacle of non-entertainment. I'm embarrassed to say I wept at the ending. I'm attached to these characters damn it.... Like Logan it confronted me with thoughts of mortality. Do I really have to wait a whole year for the sequel?!","displayName":"Matthew A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T01:07:59.000Z","updateDate":"2018-04-29T20:46:40.000Z","user":{"userId":"900594091","realm":"RT","displayName":"Matthew A","accountLink":"/user/id/900594091"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Exciting, waiting for the next part","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10213265221399892/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T01:06:23.000Z","updateDate":"2018-04-29T01:07:23.000Z","user":{"userId":"977247693","realm":"RT","displayName":null,"accountLink":"/user/id/977247693"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Best MCU movie so far. Will be hard to top this one with future marvel movies. Enjoyed every second of it.","displayName":"Ben V","displayImageUrl":"https://graph.facebook.com/v3.3/730019951/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T01:06:06.000Z","updateDate":"2018-04-29T01:07:09.000Z","user":{"userId":"820133480","realm":"RT","displayName":"Ben V","accountLink":"/user/id/820133480"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_4_5","review":"The single greatest film I have ever seen- The character ties played out to perfection, Josh Brolin (a.k.a) Thanos made the audience not see him as a villain trying to rule the world as we do in most other superhero films, but instead just following through with what his belief of Genocide will protect the future and make sure they have plentiful resources. The jokes hit the whole audience with a wave of laughter and the feel good moments led to an experience like no other. The only reason that I put this as 4 1/2 stars is because of the cliffhanger ending and having to wait a year for my depression to finally be cured.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T01:04:12.699Z","updateDate":"2019-05-12T03:30:58.923Z","user":{"userId":"260087827","realm":"RT","displayName":null,"accountLink":"/user/id/260087827"},"score":4.5,"timeFromCreation":"Apr 29, 2018"}]}