{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84NTgzMDMxMjMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMTdUMDk6NTM6MzIifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84MjMwNTA3NzMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMThUMTA6MDk6MzAifQ=="},"reviews":[{"rating":"STAR_4","review":"It'd been years since I'd been excited for a Marvel movie, and this one didn't disappoint at all. I always complain about the lack of stakes and consequences in these movies, and Infinity War is one that does not fall into that category, which makes me very happy. The juggling of the dozens of characters, to me, felt well-balanced, and I was never ever bored by any of the different storylines that were unfolding. Thanos is probably the best villain Marvel has presented, and easily my favorite part of the movie. Other highlights: Dr. Strange, the action, most of the visual effects, and THOR. Best Thor movie ever, hands down.","displayName":"Jorge R","displayImageUrl":"https://graph.facebook.com/v3.3/1284872969/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-18T10:09:30.000Z","updateDate":"2018-04-28T08:32:25.000Z","user":{"userId":"823050773","realm":"RT","displayName":"Jorge R","accountLink":"/user/id/823050773"},"score":4,"timeFromCreation":"Apr 18, 2018"},{"rating":"STAR_5","review":"Avengers: Infinity War is the culmination of 10 years of building up characters and storylines. The movie exceeded all the expectations that I had. It has all a Marvel movie needs such as comedy, character development and mostly a well established villain on who you can sympathize and sets real stakes to the superheroes. \nCongratulations to the Russo Brothers, and may they continue to entertain us for many years to come.","displayName":"??????? ?","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-18T09:50:12.000Z","updateDate":"2018-04-28T15:33:41.000Z","user":{"userId":"949813094","realm":"RT","displayName":"??????? ?","accountLink":"/user/id/949813094"},"score":5,"timeFromCreation":"Apr 18, 2018"},{"rating":"STAR_5","review":"EPIC !!!   I love the way they get the comics books and put it on the big screen !","displayName":"Leonardo V","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-18T08:33:58.000Z","updateDate":"2018-05-15T07:12:39.000Z","user":{"userId":"976855711","realm":"RT","displayName":"Leonardo V","accountLink":"/user/id/976855711"},"score":5,"timeFromCreation":"Apr 18, 2018"},{"rating":"STAR_4_5","review":"Incredible. If Avengers was the first successful comic book team-up movie, then Infinity War is the first successful live-action comic book event. This movie achieves exactly what it set out to do, and with so many characters in play, it is an absolute miracle it is not a complete mess. When taken as a stand-alone movie, it probably doesn't deserve this score and the same is true if you aren't fully invested, but as an MCU fan, I really can't give it any less. I don't think there has been another movie quite like it.","displayName":"Matthew S","displayImageUrl":"https://graph.facebook.com/v3.3/650089531/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-18T04:20:10.000Z","updateDate":"2018-04-27T06:15:53.000Z","user":{"userId":"790483218","realm":"RT","displayName":"Matthew S","accountLink":"/user/id/790483218"},"score":4.5,"timeFromCreation":"Apr 18, 2018"},{"rating":"STAR_5","review":"epic showdown of the previous ten years","displayName":"Fiona W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-18T02:45:08.000Z","updateDate":"2018-04-27T06:28:00.000Z","user":{"userId":"977117144","realm":"RT","displayName":"Fiona W","accountLink":"/user/id/977117144"},"score":5,"timeFromCreation":"Apr 18, 2018"},{"rating":"STAR_3","review":"Have problem with some plot lines, but overall a pretty good movie.","displayName":"Junyan P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-17T20:04:13.000Z","updateDate":"2018-04-29T22:31:02.000Z","user":{"userId":"906190935","realm":"RT","displayName":"Junyan P","accountLink":"/user/id/906190935"},"score":3,"timeFromCreation":"Apr 17, 2018"},{"rating":"STAR_4","review":"The long-awaited Avengers Infinity War has finally arrived. Was it worth the wait? If early reviews are any indication, the answer is yes. Is it going to win any awards? Not any that matter. Was it successful in accomplishing what it wanted to, improving on the last Avengers film, and overall providing a very exciting time at the cinema? Then the answer is a resounding yes. \nAfter years of doing nothing but smirk on a throne, Thanos finally gets a chance to shine... and oh boy does he shine. This is his movie. While familiar names such as Robert Downey Jr., Chris Hemsworth, and Chris Pratt stand out in their respected roles; Tom Holland continues to reinforce himself as possibly the best live-action Spiderman; and Dave Bautista as Drax remains funny as hell, Josh Brolin deserves every ounce of credit he gets. Thanos is the reason this movie is any good; without him, or if he is dumbed down like many other MCU villains, this movie remains on the same level as the other formulaic titles released. Instead, Thanos is given equal screen time with the heroes, and in that screen time Brolin delivers. Thanos is not a shallow brute like some critics have made him out to be, but a compelling villain whose plot comes from an angle you can understand. Thanos faces inner turmoil like other human characters but remains menacing and does real damage; never have we seen a villain give the Marvel superheroes so much trouble. Unfortunately, as expected, with so many heroes in a single film, some characters were underused and missed out on the screen time they deserved; Chris Evans' Captain America, Chadwick Boseman's Black Panther, and Scarlett Johansson's Black Widow are a few characters who played insignificant roles in the film in comparison to their importance to the cinematic universe. \nInfinity War may be one of the most ambitious movies of the year, and its success at the box office as a quality film is commendable. However, this is not to say there were no flaws. Beyond the crowding out effect mentioned previously, there are other criticisms I have that may or may not be subjective (I'll be as vague as possible to avoid any spoilers). First, there was one death that appears to be the true end of a character that did not do them justice; this was not the movie to kill them off if it was ever going to happen, the way they went out was less than spectacular and the death happens early on in the film so the character doesn't even get good screen time in the movie. Another is a decision about a character that ends up limiting them such that they are rendered basically useless, which I found highly questionable and a bit disappointing. Another is the constant back and forth between the different storylines which becomes tiring after a while. However, the movie remains coherent and easy to follow throughout even though the potential for storylines to get knotted up and lose people was there. Lastly, I must address the ending. There is a certain level of emotion and devastation that the writers/directors were aiming for, but it was never possible for this to be reached for one simple fact: sequels are coming. If I know the characters will be fine, why should I care what happens to them? \nAvengers Infinity War is full of action, from the first minute till the last. The humor is as good as in other Marvel movies, maybe even a little better. The movie strikes a fine balance between a comedic and slightly darker tone, never falling too far to one side. Characters who have never met each other finally meet, and interactions between them can be humorous and/or interesting to watch. Dr. Strange and Tony Stark or Starlord and Thor in particular play off each other well. Infinity War goes further out of Marvel's comfort zone than ever before and it pays off. This is one of the stronger, more memorable entries of the MCU. For sake of comparison, Black Panther is the better film, however I enjoyed this movie more.","displayName":"Teddy F","displayImageUrl":"https://graph.facebook.com/v3.3/1790050151319460/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-17T19:47:00.000Z","updateDate":"2018-05-15T18:15:03.000Z","user":{"userId":"976004214","realm":"RT","displayName":"Teddy F","accountLink":"/user/id/976004214"},"score":4,"timeFromCreation":"Apr 17, 2018"},{"rating":"STAR_5","review":"I will buy his DVD.  Loved it so much.","displayName":"Thomas B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-17T18:19:55.000Z","updateDate":"2018-07-02T17:19:52.000Z","user":{"userId":"977126711","realm":"RT","displayName":"Thomas B","accountLink":"/user/id/977126711"},"score":5,"timeFromCreation":"Apr 17, 2018"},{"rating":"STAR_4","review":"I feel like this two and a half hour thrill ride handled the crazy amount of characters in the best way it possibly could have. There was very little breathing-room for the audience because so much was happening at once, but that was expected. It was thrilling, suspenseful, and a bit depressing because the MCU actually had a deadly villain for the first time.","displayName":"Richard F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-17T14:01:16.000Z","updateDate":"2018-05-02T15:37:42.000Z","user":{"userId":"977196035","realm":"RT","displayName":"Richard F","accountLink":"/user/id/977196035"},"score":4,"timeFromCreation":"Apr 17, 2018"},{"rating":"STAR_5","review":"A villain's epic journey and hero's worst nightmare","displayName":"Raisul I","displayImageUrl":"https://graph.facebook.com/v3.3/1354015148/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-17T09:53:32.000Z","updateDate":"2018-05-17T05:29:26.000Z","user":{"userId":"858303123","realm":"RT","displayName":"Raisul I","accountLink":"/user/id/858303123"},"score":5,"timeFromCreation":"Apr 17, 2018"}]}