{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Njk5MzYxOTgiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMjdUMDc6NTE6MzIifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwOTY1NjAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMjdUMTE6MzU6NTQuMDg1WiJ9"},"reviews":[{"rating":"STAR_5","review":"Best super hero movie I've ever seen. Somehow better than Dark Knight, Thanos isn't as dynamic as joker, but the storylines going on simultaneously between great characters is game of thrones like. These marvel movies are one of a kind and should be cherished while we can watch them haha","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-27T11:35:54.085Z","updateDate":"2018-05-27T11:35:54.085Z","user":{"userId":"260096560","realm":"RT","displayName":null,"accountLink":"/user/id/260096560"},"score":5,"timeFromCreation":"May 27, 2018"},{"rating":"STAR_4_5","review":"This movie was awesome. A fantastic marvel movie, great characters and the build-up to this movie was very good. It has some toning issues, how in some parts it's trying to be really funny while other parts are serious, and then some are just really dramatic. I don't get why people like Thanos, he lacks a motivation and isn't a very good character in the MCU, but I still think this movie is awesome and every marvel fan should watch it.","displayName":"Aydan B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-27T11:22:38.000Z","updateDate":"2018-06-09T10:58:13.000Z","user":{"userId":"977292838","realm":"RT","displayName":"Aydan B","accountLink":"/user/id/977292838"},"score":4.5,"timeFromCreation":"May 27, 2018"},{"rating":"STAR_4_5","review":"WOW! WHAT A MOVIE!!! 160 MINUTES PASS IF THEY WERE MERE 30. WHEN I HEARD, A FEW MONTHS AGO, THAT THEY WERE PUTTING ALL SUPER HEROES TOGETHER IN ONE SINGLE FLICK, I ONLY EXPECTED A COMPLETE DISASTER AS I THOUGHT THERE WOULDN'T BE MORE THAN 2-3 MINUTES PER SUPER HERO, LEAVING EVERYTHING IN A COMPLETE CONFUSING MESS. BUT MAN, WAS I WRONG. IT'S AN INCREDIBLE SCRIPT WHICH WOVE TOGETHER A WHOLE UNIVERSE OF UNIVERSES, PUTTING DOZENS OF MARVEL CHARACTERS FROM DIFFERENT TIMES AND WORLDS NEATLY UNDER ONE HAT, AN IMPROBABLE HAT, BUT STILL: ALL PERFECTLY UNDER ONE HAT. AND IT FITS! NEEDLESS TO SAY, ONE HAS TO HAVE SEEN EVERY SINGLE EARLIER MOVIE OF THE MARVEL UNIVERSE OR ONE MIGHT NOT UNDERSTAND CERTAIN SCENES, ACTIONS OR CHARACTERS, BUT FOR EVERY MARVEL FAN THIS IS SURELY THE \"NONPLUS ULTRA MOVIE\". THE ENDING IS REALLY TOUGH FOR MOST FANS (I WON'T PUT A SPOILER HERE. WATCH IT AND YOU'LL UNDERSTAND!), BUT IF THERE WON'T EVER BE ANOTHER MARVEL MOVIE, THIS STORY HERE MIGHT SURELY SERVE AS THE (IM)PERFECT FINAL CHAPTER! SEARCH FOR THE BIGGEST CINEMA SCREEN IN TOWN AND EMERGE INTO AN OCEAN OF MIND BOGGLING IMAGES FROM DIFFERENT WORLDS AND REALITIES, NEARLY NONSTOP ACTION AND AN AMAZING ADVENTURE OF SUPER HEROES. I'LL ADD ONE SPOILER HERE: DON'T EXPECT ANY COMEDY AS IN MANY OTHER EARLIER FLICKS AS THERE ISN'T HARDLY ANY JOKE IMPLANTED HERE. BUT IF YOU ARE LOOKING FOR ACTION, DON'T LOOK ANY FURTHER AND ENJOY THIS, IN MY OPINION, 8 1/2 OUT OF 10 STAR MOVIE","displayName":"Giorgio G","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-27T11:21:26.000Z","updateDate":"2018-05-27T11:43:00.000Z","user":{"userId":"975555794","realm":"RT","displayName":"Giorgio G","accountLink":"/user/id/975555794"},"score":4.5,"timeFromCreation":"May 27, 2018"},{"rating":"STAR_4","review":"As many others have already said, this is about as good as you could expect an epic cross-over cameo-fest blockbuster of this scope to be. Hats off to the editors and writers for finding a pace that never felt cluttered or confusing, at times even leaving you wanting more detail despite the runtime. While none of the emotional punches really land, including the (obviously temporary, in some cases) deaths at the conclusion, the physical punches and jokey punchlines keep things perpetually in motion so that the audience remains always invested and never bored.\n\nREWATCH: After a decade of world building and origin stories, the Marvel Cinematic Universe culminates in this behemoth blockbuster, which is, for all the A-listers enlisted and entangled plot lines, surprisingly lithe, filled with quick wit and fast pacing. Beginning, as a true epic always should, in medias res, and leaning heavily upon earlier efforts of characterization, the film is able to forego the ordinary Marvel ethos---power deriving from who you are, not what you have---at once reverse-mirroring that motif in the complicated figure of Thanos, while simultaneously problematizing a fundamentally economic mentality by subverting attempts to draw simple binaries of exchange. That, of course, is precisely what Thanos is after, the fantasy of balanced equilibrium characteristic of the death drive; his not simply on a path of simple destruction, or tyranny, or genocidal rectitude, for there is an evil sort of purity to his motivations, a terrible righteousness that grounds his power in much the same fashion as, say, Cap or Thor. This is why easy parallels of good and evil or divisions into superheroes versus villains must, in the end, be rejected; this is why figures at war with one another, egos in competition, people flung far across the galaxy must come together, endeavoring not to merely overcome their common enemy---any attempt at simple opposition is futile---but learning how to act beyond good and evil (thus fitting the task of the true Nietzschean uebermensch): This was the only way, says the wizard to the billionaire, after giving the villain exactly what he wants, abandoning the adversarial for an ethos that finds victory in defeat. In that way, it is a film that does not set aside or settle the differences of its various franchises, but celebrates the uniqueness of each, on a formal level subtly juggling tones as it shifts narrative focus, while symbolically refusing the commonplace belief, embodied in Thanos himself, that life, whether that of the self or the other, must be sacrificed and traded for life to be preserved: The Avengers must win on their own terms, otherwise they will have always already lost.","displayName":"Jake C","displayImageUrl":"https://graph.facebook.com/v3.3/10100158086500388/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-27T10:56:19.000Z","updateDate":"2019-04-23T13:47:24.000Z","user":{"userId":"976528324","realm":"RT","displayName":"Jake C","accountLink":"/user/id/976528324"},"score":4,"timeFromCreation":"May 27, 2018"},{"rating":"STAR_4_5","review":"es buena y no aburre, pero a veces llega ser predecible","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/590519481325073/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-27T10:47:50.000Z","updateDate":"2018-05-27T10:48:25.000Z","user":{"userId":"977292837","realm":"RT","displayName":null,"accountLink":"/user/id/977292837"},"score":4.5,"timeFromCreation":"May 27, 2018"},{"rating":"STAR_5","review":"Graphic novel come to life!","displayName":"Charles G","displayImageUrl":"https://graph.facebook.com/v3.3/10152023796642408/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-27T10:08:25.000Z","updateDate":"2018-05-27T10:09:28.000Z","user":{"userId":"974329491","realm":"RT","displayName":"Charles G","accountLink":"/user/id/974329491"},"score":5,"timeFromCreation":"May 27, 2018"},{"rating":"STAR_4_5","review":"They stuck the landing. After a decade of building this arch and they nailed it. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-27T09:59:09.972Z","updateDate":"2018-05-27T09:59:09.972Z","user":{"userId":"260139097","realm":"RT","displayName":null,"accountLink":"/user/id/260139097"},"score":4.5,"timeFromCreation":"May 27, 2018"},{"rating":"STAR_3","review":"A very entertaining blockbuster with a fantastic villain. It does suffer from way to many characters though.","displayName":"Jack G","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-27T09:15:07.000Z","updateDate":"2018-05-27T09:16:17.000Z","user":{"userId":"977292684","realm":"RT","displayName":"Jack G","accountLink":"/user/id/977292684"},"score":3,"timeFromCreation":"May 27, 2018"},{"rating":"STAR_4","review":"emotional culmination of 10 year build up","displayName":"sean e","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-27T08:34:38.000Z","updateDate":"2018-05-27T13:12:13.000Z","user":{"userId":"942145836","realm":"RT","displayName":"sean e","accountLink":"/user/id/942145836"},"score":4,"timeFromCreation":"May 27, 2018"},{"rating":"STAR_4","review":"amazed at the spectacle of it all, nonstop, thrill ride.. may be the best marvel movie so far","displayName":"doug h","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-27T07:51:32.000Z","updateDate":"2018-05-27T07:51:32.000Z","user":{"userId":"969936198","realm":"RT","displayName":"doug h","accountLink":"/user/id/969936198"},"score":4,"timeFromCreation":"May 27, 2018"}]}