{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NTMxNjM4MDkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjZUMjE6NTg6MTAifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNDExMzAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjZUMjI6MDg6MzEifQ=="},"reviews":[{"rating":"STAR_5","review":"Easily best Marvel Movie in past 10 years.... Whoever gives it 86% should be fired","displayName":"Johnny B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:08:31.000Z","updateDate":"2018-04-26T22:11:52.000Z","user":{"userId":"977241130","realm":"RT","displayName":"Johnny B","accountLink":"/user/id/977241130"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"Best marvel movie so far!!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10160133165095512/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:07:16.000Z","updateDate":"2018-04-26T22:07:41.000Z","user":{"userId":"977131817","realm":"RT","displayName":null,"accountLink":"/user/id/977131817"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_3_5","review":"Like every other geek in the world, I was stoked to see 'Avengers: Infinity War.' I bought my tickets in advance. I got a soda that was way too large to drink in two and a half hours. I argued with some teenager who tried to steal my seat. I sat in jittery anticipation once the lights went down... And I was left wanting once the credits ran.\n\n'Avengers: Infinity War' was the equivalent of Marvel's money shot. It's been building to this since the first 'Avengers' movie showed Thanos peeking over his shoulder with a cocky smile on his face. Since then, they've been hinting at the inevitable confrontation that was bound to happen between Earth's mightiest heroes and some big purple spaceman. With Avengers: Infinity War, we see Thanos actually get off his ass and do something, and he does a lot and yet nothing at the same time.\n\nThe biggest problem that 'Avengers: infinity War' suffers from is that it tries to do so much in so little time. Fans of the MCU are well aware that there are more heroes than you can shake a stick at and 'Infinity War' stuffs all of them in, in one way or another. Of course, the big three (Chris Hemsworth, Chris Evans, and Robert Downey Jr.) get their share of screen time, everyone else thought has minimal roles to play throughout the film. Tom Holland is Marvel's newest plaything, so he gets plenty of time, but the rest of the big heroes are shoehorned in \nsuch a way that screams \"contractual obligation.\" Then again, I don't think any fan is something to be upset about seeing their favorite heroes finally meet on the big screen (especially when it comes to Robert and Benedict Cumberbatch). The problem is that none of them really get a chance to stretch their legs.\n\nI have to admit 'Avengers: Infinity War' definitely has some feels in it. Oddly enough, most of these feels come from Thanos himself (Josh Brolin). He's supposed to be the big bad of the MCU, but it seems like his heart is in the right place, even if he's a pretty extreme pragmatist. Still, his character isn't laughing evilly in the wings as he commits acts on par with the worst war crime I can think of. Instead, he struggles. He sees the cost and even admits that achieving his goal costs him everything in the end. So, is it all worth it? \n\nWho knows! The damn thing basically ends in a \"to be continued.\"\n\n'Avengers: Infinity War' suffers from trying to do so much that the editing can't possibly keep up with it. There's no downtime between the action sequences, which doesn't mean that they aren't any less spectacular. It just means that there's no time to let anything sink in before the movie is rushing off to the next sequence. That being said, the heroes all achieve a new level of badass-dom, especially Chris Evans as Captain America. The guy is a beast this time around. Unfortunately, there is so much going on that it can be hard to figure out what's going on mid-flight. \n\nThis brings me to another point when it comes to 'Avengers: Infinity War.' The damn thing is so busy when it comes to its visuals, that I honestly don't think it's worth seeing in 3D. For the first few minutes of the movie, I couldn't understand what was happening. Apparently, though there was quite a beatdown when it came to Thanos and Hulk. Enough so that Hulk gets performance anxiety. Something I find odd since Thanos actively avoids the Hulk in the comics. I'm not going to knick pick about this though, because I'm not a neckbeard nerd.\n\nLook, here's the bottom line, 'Avenger: Infinity War' is a fun movie. It's competently made by the Russo Brothers, who are Marvel's golden boys. Is it everything that fan might want? No. Does it live up to what it promises? No. Is it still something fanboys should throw money at and be happy they get it? Probably. \n\nYou're not going to be disappointed in 'Avengers: Infinity War,' but Marvel does not have the right to act all high and mighty after this. I'm sure 2019 will bring a \"sequel\" that will make it all worthwhile. As of right now though, 'Avengers: Infinity War' is kind of a disappointment. It's a letdown. There have been so many good movies this past year from Thor: Ragnarok to Black Panther that Marvel ended up raised the bar. It had to stumble at some point, it's just lucky that it only stumbled and didn't fall flat on its face with 'Avengers: Infinity War.'","displayName":"Patrick S","displayImageUrl":"https://graph.facebook.com/v3.3/515402735318597/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:06:47.000Z","updateDate":"2018-04-27T12:34:03.000Z","user":{"userId":"974272785","realm":"RT","displayName":"Patrick S","accountLink":"/user/id/974272785"},"score":3.5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"One of the best movies I've ever seen. It had everything. I'll watch it ten times more and I will cry, a lot.","displayName":"Filippa L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:04:10.000Z","updateDate":"2018-04-26T22:06:29.000Z","user":{"userId":"977241121","realm":"RT","displayName":"Filippa L","accountLink":"/user/id/977241121"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"We saw this tonight, the theater was packed with geeks cosplayed up. They were funny. The movie was amazing, funny, and surprising. Great job Marvel","displayName":"G M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:03:29.000Z","updateDate":"2018-04-26T22:05:27.000Z","user":{"userId":"977138646","realm":"RT","displayName":"G M","accountLink":"/user/id/977138646"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"Amazing culmination of a story started in 2008. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:03:13.448Z","updateDate":"2018-04-26T22:06:15.746Z","user":{"userId":"260121256","realm":"RT","displayName":null,"accountLink":"/user/id/260121256"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_4_5","review":"Wow......I've said it before, and I'll say it again: the Avengers movies are the best movies in the MCU, and this one is no exception. I'll even go so far as to say that this is the best Marvel movie since the original Avengers film from 2012. The film is a spectacle, a deeply-affecting thrill, a love letter to those who believe that a comic book movie can be much more than its concept implies. I walked out of the theater caught in an equal balance of two distinct emotions: amazement and anxiety. The reasons to arouse these two reactions are great in number. To begin, let me start by mentioning that, as one can imagine, it is hard for any film to balance such a large ensemble of characters. Although the movie does bounce around frequently between locations and it also being a bit easy to lose track of the numerous whereabouts and scenarios attached to every character, this film is methodical and organized in its plot structure, never losing sight of its core objectives: Thanos retrieving the infinity stones, and Avengers standing in his way. Contrary to my initial speculations, Thanos, thankfully, is everything he was built up to be and more. I love it when movies portray their villains as true, legitimate, merciless, unstoppable forces of pure intimidation and menace......villains that genuinely inspire fear and powerlessness in the hearts of the heroes, so tangible that even the audience can feel it. To me, those are great villains, and because of these qualities combined with considerable personal depth, Thanos is the best villain in the MCU thus far. Furthermore, the most interesting aspect to Thanos here is not his ultimate intention with the stones but rather what he has to do in order to acquire them all. Switching sides now, almost all the heroes in the MCU up to this point are back with a vengeance and ready to \"kick names and take ass.\" The only thing more epic than seeing these guys and gals fight side by side in huge, magnificent battles is watching them interact. The dialogue is chock full of great jokes and hilarious bickering to make for incredibly entertaining conversation. It is important to realize, though, that whereas this movie does motivate cheer and laughter, it also provokes nervousness and dismay. If you love these characters, by the time the ending credits roll, you will be emotionally shaken. The \"resolution\" at the end of the film is presented as more of a cliffhanger edged with tragedy that leaves you both excited for and anxious about the next chapter of the story introduced in this film. Overall, this is a very powerful film. It upholds the standards set by previous MCU installments while adding an element of potent emotional resonance to capture viewer attention and admiration more intensely than ever before. The MCU has largely had nothing but success, but it's movies like this one that really make you proud Marvel is still doing this after ten years.","displayName":"John S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:02:13.000Z","updateDate":"2018-04-26T22:06:02.000Z","user":{"userId":"933027027","realm":"RT","displayName":"John S","accountLink":"/user/id/933027027"},"score":4.5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_4","review":"Question on how March 2019 Captain Marvels' movie which is set in the 90s ties in to the Avengers is finally explained with the post credit scene. It'd be great to have her in the 2019 Avengers instead of waiting till Avengers 4","displayName":"Elle%20 K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:01:15.000Z","updateDate":"2018-04-26T22:13:52.000Z","user":{"userId":"977241113","realm":"RT","displayName":"Elle%20 K","accountLink":"/user/id/977241113"},"score":4,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"The best marvel movie out there. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:00:41.517Z","updateDate":"2018-04-27T10:09:26.313Z","user":{"userId":"260102115","realm":"RT","displayName":null,"accountLink":"/user/id/260102115"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"I.....well.....um....you just have to see it...","displayName":"Rusty P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T21:58:10.000Z","updateDate":"2018-04-26T21:58:34.000Z","user":{"userId":"953163809","realm":"RT","displayName":"Rusty P","accountLink":"/user/id/953163809"},"score":5,"timeFromCreation":"Apr 26, 2018"}]}