{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MDA3NTI2NTIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDZUMTI6MjE6NDcifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcwMTY2MTAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDZUMTM6Mjg6MDgifQ=="},"reviews":[{"rating":"STAR_5","review":"I am so amazingly happy with this movie! It was beautiful and cramming so many heros into one movie and for it not to feel crammed together, spectacular! Thank you for showing the FANS that we do matter, unlike other franchises. Awesome movie, gorgeous special effects, great story. All i can do is say thank you.","displayName":"Chris S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T13:28:08.000Z","updateDate":"2018-05-06T13:33:15.000Z","user":{"userId":"977016610","realm":"RT","displayName":"Chris S","accountLink":"/user/id/977016610"},"score":5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_1","review":"The ending sucks.  We don't go to see superhero films for the bad guy to win.  We see that enough in real life.  Very disappointing and my kid is in tears.  Wish I would have missed seeing it, and would love my money back.  Doubt I'll see the sequel.","displayName":"S b","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T13:27:56.000Z","updateDate":"2018-05-06T13:32:35.000Z","user":{"userId":"977259551","realm":"RT","displayName":"S b","accountLink":"/user/id/977259551"},"score":1,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"Amazing CGI. Non-stop action. Thrilling story. Unexpected. Much better than Black Panther in my opinion. The ~2.75 hours flew by quickly.","displayName":"Dean S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T13:16:35.000Z","updateDate":"2018-05-06T13:21:37.000Z","user":{"userId":"974787841","realm":"RT","displayName":"Dean S","accountLink":"/user/id/974787841"},"score":5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"Best movie that Marvel has come out with. They found an interesting way to combine all of the heroes that have been in the MCU.","displayName":"Nikki W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T13:15:19.000Z","updateDate":"2018-05-06T13:17:34.000Z","user":{"userId":"977164437","realm":"RT","displayName":"Nikki W","accountLink":"/user/id/977164437"},"score":5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"Perfect movie version of a comicbook event.","displayName":"Wally D","displayImageUrl":"https://graph.facebook.com/v3.3/1126833908/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T13:14:21.000Z","updateDate":"2018-05-06T13:15:29.000Z","user":{"userId":"848327536","realm":"RT","displayName":"Wally D","accountLink":"/user/id/848327536"},"score":5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_4_5","review":"This movie is an action packed roller coaster ride, It packs in sorrow, comedy, horror, suspense, shock, anger, and basically all of the other emotions put together into its almost 3 hour runtime. Josh Brolin is exceptional as Thanos, as he convincingly portrays the character with great justice. Go see \"Avengers: Infinity War\" right now!","displayName":"Marcus Y","displayImageUrl":"https://graph.facebook.com/v3.3/1849205717/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T13:03:07.000Z","updateDate":"2018-05-06T13:06:28.000Z","user":{"userId":"874703872","realm":"RT","displayName":"Marcus Y","accountLink":"/user/id/874703872"},"score":4.5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"the movie is great and totally worth the wait .","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/2108183032544604/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T13:02:11.000Z","updateDate":"2018-05-06T13:08:00.000Z","user":{"userId":"977259528","realm":"RT","displayName":null,"accountLink":"/user/id/977259528"},"score":5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"I could have watched two more hours of this... I wish they had part two ready to put out right now!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10211372429215656/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T12:33:21.000Z","updateDate":"2018-05-06T12:34:56.000Z","user":{"userId":"977259489","realm":"RT","displayName":null,"accountLink":"/user/id/977259489"},"score":5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_0_5","review":"~This movie is really slow and it just was a table setter. If you know anything about Marvel you know that it is very different from the books. It had some funny parts but others were super slow moving. \n~Speacial effects- You can tell that they did a lot of work on Thanos in specific, but if you look at other characters with CGI they look as if they were in a game with the sloppy graphics. Many of the scenes were also designed poorly as far as Special effects go.  \n~Scriptng- This movie was extremely scripted and as a viewer, you can tell that as well. \n~Unnessary plots- There are about 5 scenes that were not even needed and I felt took away from the film.\n~Ending- It ended strong and that's something I actually liked because it's not the normal superhero saving the day they lose at the end so hey it's realistic.\n\nMy overall thoughts were hey it's a marvel movie they usually are hyped up. They brought people expectation to high. They made unreasonable decisions in this movie and so all my thought combined I think the movie itself was decent or mediocre at best. Marvel isn't really good in the first place at this point they are just milking the big lead up for more money.\nMy score out of then would still be 3/10","displayName":"Jeremy%20 D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T12:32:46.000Z","updateDate":"2018-05-06T12:48:01.000Z","user":{"userId":"977126429","realm":"RT","displayName":"Jeremy%20 D","accountLink":"/user/id/977126429"},"score":0.5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_3","review":"April 27, 2018\n\nThe current pattern for Marvel superhero movies seems to be two or three single-character installments a year, followed every two years by an all-out ensemble piece, a.k.a. an \"Avengers\" movie. This cycle isn't anything new and it isn't likely to change any time soon, nor are any of these movies' basic structure, which often revolves around a new diabolical villain with an outrageous plan to wipe out humanity (or in the case of \"Avengers: Infinity War,\" a fraction of humanity) and whom our Marvel friends must defeat. \n\nThis is a song and dance number we've experienced time and again, but what continues to sustain this unsinkable franchise is not only the quality with which each movie is made-both technical and dramatic-but the way the filmmakers keep pushing the overall saga forward, even though the underlying mold has plateaued creative-wise. After a decade of non-stop origin stories and sequels, each new one, surprisingly, continues to vary at least somewhat, and it's these slight differences that keeps the entire series afloat.  \n\nWhat's different about \"Infinity War\" is it's not really any of our usual heroes' story, but more the villain's. Of the last \"Avengers\" movie, \"Age of Ultron,\" I had written, \"...as long as the storytellers continue to develop the characters and give them interesting conflicts to resolve, the 'Avengers' franchise can remain...entertaining.\" \"Infinity War\" doesn't really develop the heroes much beyond what we already know about them, but it does provide a surprisingly complex bad guy, whose ambition isn't merely world domination for world domination's sake. He actually has a thoughtful agenda and therefore we don't necessarily see him in simple terms of black and white, good and evil.\n\nHis name is Thanos (a motion-captured Josh Brolin) and, hitherto now, he's only been mentioned by name or made cameos in the previous \"Avengers\" movies. In \"Infinity War,\" we actually see him in the flesh, manifested as a towering, purple-skinned, pro-wrestler-type who's bald and sports a neatly-trimmed goatee (picture Stone Cold Steve Austin if he was an exaggerated comic book character). \n\nThanos reveals that after his home moon of Titan collapsed under the effects of overpopulation and lack of resources-subsequently devolving from a modern utopia into a barren, desert wasteland-he vowed he'd never let such devastation happen again. He believes it's his duty to restore balance to the galaxy, which means bringing the number of deaths more in line with the number of current lives. Thus, half of each planet's population must die. In order to carry out such an ambitious, genocidal plan, Thanos must first gain omnipotence using the six Infinity Stones, which are various-colored gems that each represents a different aspect of existence: soul, time, space, mind, reality, and power. His plan is to insert each stone into his mighty gauntlet and harness their energy to will half of all those living, without passion or prejudice, to dust.\n\nAnd so the basic plot of \"Infinity War\" finds our usual cast of Marvel heroes, from all corners of the galaxy, learning of Thanos' mass extermination scheme and attempting to stop him. Par for the course are several scenes of action, drama, humor, backstory, etc., before the inevitable, climactic battle in which all the heroes and villains convene for a final showdown. \n\nEssentially every hero character we've met so far in all the Marvel Comics Universe movies, beginning with \"Iron Man\" way back in 2008, makes an appearance in \"Infinity War\" (by now, you must know them all by heart, as well as the actors who play them, so I'm not going to list them here), but what's sort of remarkable about the film is the way it's able to given them all something to do. Granted, it's not a perfect balance, and some characters, such as Black Widow and even Black Panther (coming off his own enormous hit from just last February) seem relegated to just a few minutes of screen time, but gathering them all into one script must have been quite the feat for writers Christopher Markus and Stephen McFeely. The sheer magnitude of people and locations in this adventure makes it inevitable the film should seem like it jumps around too much and grows exhausting by doing so. But on that same token, we admire and given credit to director-brothers Anthony and Joe Russo for keeping us engaged as well as they do.\n\nThe Russo brothers are no strangers to the Marvel Universe; they previously helmed \"Captain America: Winter Soldier\" and \"Captain America: Civil War,\" the latter being another ensemble piece that I personally feel is one of the best Marvel adaptations. This time around, the directors have even more ground to cover, more plot threads to manage, and more characters to weave, and I'll admit the film's enormous breadth did start to take its toll on my enthusiasm (it runs for just over two and a half hours). By the time the climax does arrive, with its endless fight scenes, close calls, characters showing off their powers, etc., I was spent and it would have been nice if the screenplay had found a less traditional method to bring all of its parts together. Still, the ending itself is a surprise, especially for those unfamiliar with \"The Infinity Gauntlet,\" the comic book story by Jim Starlin upon which most of the film is based, and I do recognize the emotion and risk attached to it.\n\nBecause Marvel superhero movies are so alike and so consistent in terms of their entertainment value, I'm convinced there will always be something to take away from them. The nature of the genre and the dedicated filmmakers and cast have pretty much guaranteed they will at least never be boring. But perhaps the question to ask going forward is whether or not each installment is different enough to warrant a recommendation beyond the usual qualities. In other words, is the given movie special in any way? Regarding \"Infinity War,\" it's the complex villain, the way the film balances multifold characters, and its bold ending that make it stand out. I wouldn't say it's an inspired entry in the unflagging Marvel saga, but it's a solid one, and it keeps us wanting more.","displayName":"Matthew H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T12:21:47.000Z","updateDate":"2018-05-06T12:22:04.000Z","user":{"userId":"900752652","realm":"RT","displayName":"Matthew H","accountLink":"/user/id/900752652"},"score":3,"timeFromCreation":"May 06, 2018"}]}