{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwMjYxMTQiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMjA6NDg6MDAuMjQ0WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNDczMDUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMjA6NTU6NTMifQ=="},"reviews":[{"rating":"STAR_4","review":"Avengers Infinity War is probably one of the most ambitious anticipated film to date for some time. It's true that the movie was going to be BIG and with a lot of very unexpected moments from the plot that came out of nowhere as if hitting you like a spaceship in hyperspeed, but there were also moments that were already pretty predictable, the movie itself has a substance that was mixed by a lot of tones that made the movie very flexible to feel, chemistry between characters were constructed creatively with outstanding performances from each actors to their characters. Thanos was performed by Josh Brolin excellently but it surprised me of how his character was developed, there were more that was put into his character that will make us go in realization that there was a bit more than the mad titan we knew that was made him a great villain; I would say he is the heart and core of this movie. Chris Evans, Robert Downey Jr., Elizabeth Olsen, Benedict Cumberbatch, Chadwick Boseman, Scarlett Johansson, Tom Holland, Chris Hemsworth and Zoe Saldana had the best standout performances to their characters. The others were just a bit fine but a bit choppy and some characters didn't had enough runtime that stalled pretty much, Mark Ruffalo's Hulk here was I think not my biggest letdown but has one of the most disappointing development in the story, they made his character somewhat more hilarious than mad, it made his character almost turn into a complete joke. The action scenes here was very good, it will make us feel more thrills than the other previous films that on some moments will leave you on the edge of your seats, there some shaky scenes that were shot also on a choppy way. The development throughout the story was a bit of a drag sometimes that was also a little full of conversations and subplots to follow. The last hour/minutes in the film is what you came in for, and also where the biggest jaw-dropping and the most emotional moments that happened, and those were the moments that I talked about that came out of nowhere and on what you did not expect. But overall this is my first impressions of the film and I would be very glad to see this again soon for the second time. This has been my personal best among the Avengers films and one of the best in the MCU. You will experience a very roller coaster ride of your life.","displayName":"Pafsy M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T20:55:53.000Z","updateDate":"2018-04-28T21:06:10.000Z","user":{"userId":"977247305","realm":"RT","displayName":"Pafsy M","accountLink":"/user/id/977247305"},"score":4,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4_5","review":"Was  incredibly well paced, and didn't feel crowded for actors. Thoroughly enjoyed my experience and definitely going again.","displayName":"Daniel M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T20:54:23.000Z","updateDate":"2018-04-28T20:55:15.000Z","user":{"userId":"977247303","realm":"RT","displayName":"Daniel M","accountLink":"/user/id/977247303"},"score":4.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4_5","review":"Wow! 10 years and they give us a movie filled with everything we needed it be! 2019 is going to be a long wait!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T20:53:08.036Z","updateDate":"2018-04-28T20:53:08.036Z","user":{"userId":"260008533","realm":"RT","displayName":null,"accountLink":"/user/id/260008533"},"score":4.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"It's all been building to this. Every movie, every new hero, every cosmic artifact and alien civilization. It's all been leading to the big showdown. And it is magnificent. The battles, the team-ups, the twists and turns, every moment of it is spectacular. This is what we've been waiting for.\n\nInfinity War wastes no time getting started. Beginning right where Ragnarok ended, it hits the ground running and never stops. The fights and the deaths start in the first scene, and momentum builds and builds from there as Thanos's plans are set into motion and the heroes rally to stop them. From New York to Wakanda to the edges of the universe the action is almost nonstop, pausing just long enough to let us catch our breath. The numerous brawls and battles are fast paced, beautifully staged and photographed, and varied enough to never get tiresome. Black Panther's climactic battle in Wakanda was awesome. Infinity War's is at least ten times better.\n\nThis is also a movie brimming with character. And characters. Virtually every hero and anti-hero Marvel has introduced up to this point. No time is spent on introductions because know them already. If you don't then you have some serious catching up to do before you watch this. Chris Pratt is still as shameless, vain, and hilarious as ever as Star Lord. Tom Holland is still spouting movie references and trying to impress everyone as Spider-Man. And teen Groot is your average moody teenager, only with superpowers and a three-word vocabulary.\n\nAnd with all of them thrown together there are some awesome team ups. Iron Man and Doctor Strange. Spider-Man and Star Lord. Thor and Rocket Racoon! Even with so many characters in play every one of them gets their chance to shine, both in battle and with the lines they deliver. The chemistry between them all is remarkable considering that many of them have never appeared on screen together before.\n\nOf course great heroes need great villains to fight, and Infinity War delivers. Though most viewers have never heard of them, Corvus Glaive, Proxima Midnight, Black Dwarf and especially the Ebony Maw make an immediate impression with their sense of menace and deadly skills. But nothing compares to Thanos himself. He's not just Marvel's most dangerous villain, he's their best. He is incredibly powerful, undeniably brilliant, and absolutely mad. Not raving lunatic or spontaneously violent mad. His madness is cold, calculating, and filled with certainty that every ounce of death and suffering he inflicts serves a higher purpose. With his power and single-minded determination, he is an absolute force of nature and watching him in battle in simply incredible. \n\nFor those who worried that Marvel was getting too goofy, fear not. The tone here is as far as you can get from Ragnarok and still be in the Marvel universe. The humor is still here, and it still works. There are lines that will have you laughing out loud. And thank goodness, because otherwise all the death and destruction would get DC level brooding. Infinity War is a movie that knows the value of a little comic relief, but it really knows how to be serious- even somber- when it needs to be. It can be a real emotional roller coaster, so buckle up and don't get too attached to anyone.\n\nNow I'll admit that the story is mainly there to string together the big superhero fights. That said it's pretty good, with multiple converging plot threads and a fair number of twists and turns, some of which are downright jaw dropping. Peter Dinklage's mystery appearance is better than anything we could have hoped for, but there are much more shocking reveals as characters and plot threads that were seemingly forgotten years ago reemerge. \n\nAnd the ending... Not everyone will be pleased, but it took guts, and it's one hell of a cliffhanger. Part two may only be a year off, but the wait is going to feel infinite.","displayName":"William S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T20:53:08.000Z","updateDate":"2018-04-29T06:49:56.000Z","user":{"userId":"905173010","realm":"RT","displayName":"William S","accountLink":"/user/id/905173010"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"The most epic of all epic Marvel movies. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T20:53:06.383Z","updateDate":"2018-04-28T20:53:06.383Z","user":{"userId":"260017179","realm":"RT","displayName":null,"accountLink":"/user/id/260017179"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Avengers: Infinity War Review: Wow! It took 10 years to get the setup for this movie. I had been waiting for the Infinity War for so long. I just have to say that it was amazing and definitely worth the wait! As most of you know, the movie is about almost literally everyone in the MCU teaming together to fight Thanos so he doesn’t collect all of the Infinity Stones and destroy half of the universe. I’m not going to talk much about anyone else but Thanos since everybody did superb and knows about their character. Josh Brolin as the lead villain was amazing. He is the best Marvel villain ever made. Thanos has a good reason for what he’s doing rather than other villains that are bad and beat up guys. The film delved deep into his mind so we can understand him. We love him so much but as a villain we hate what he does. Every time Thanos is on the screen we can all feel tension and fear. We’re not like “Oh he’s here to do something bad.” It’s like we panic a little because we don’t know what he’ll do and we’re scared for what he’s going to do. Thanos also has emotion and he isn’t just a tough guy. That’s all I’m going to say about him. The heroes were all great. It’s not like the other Avengers movies where they team up to stop a bad person. They’re teaming up in desperation because they don’t know how they should approach the problem. They know if they don’t stop him, basically everyone will die. It was a very serious and darker movie for the MCU. There were some greatly timed jokes, like usual, so we could breathe rather than hold our breath praying for a miracle to happen. Now on to the technical stuff. The effects for the movie were fantastic. Most of the movie relied on them. There were a minimal amount of times where you could tell it was fake, but I don’t consider that a flaw. The cinematography was pretty good too. For an action movie there wasn’t too much shaky cam but more on wide shots. The Russo Brothers did amazing with directing, as they did with Captain America: The Winter Soldier and Civil War. They understood all of the characters and motives. The movie did jump around a lot which some people didn’t like but there was a lot happening so it was necessary. I had no flaws with this movie. It was absolutely amazing and had everything that a Marvel movie should have. I would definitely see it. You will not be disappointed in how great it is. My Grade: A+ (The cliffhanger at the end was fantastic)","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T20:53:04.136Z","updateDate":"2018-04-29T01:15:44.839Z","user":{"userId":"960125911","realm":"RT","displayName":null,"accountLink":"/user/id/960125911"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"LO MEJOR QUE VI EN MI CORTA VIDA","displayName":"Fernando M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T20:52:24.000Z","updateDate":"2018-04-28T20:53:02.000Z","user":{"userId":"976846838","realm":"RT","displayName":"Fernando M","accountLink":"/user/id/976846838"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"This movie is so awesome, a must watch of the year. Screenplay is so good. The ending is most brave decision by the directors.","displayName":"Ajith%20 K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T20:51:57.000Z","updateDate":"2018-04-28T20:53:44.000Z","user":{"userId":"977247300","realm":"RT","displayName":"Ajith%20 K","accountLink":"/user/id/977247300"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_2","review":"Fun but ultimately mehhhh. At some point the entire world will have to grow tired at all the deus ex machina occurring in these Avengers movies. Maybe not. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T20:49:06.082Z","updateDate":"2018-04-28T20:49:06.082Z","user":{"userId":"260085200","realm":"RT","displayName":null,"accountLink":"/user/id/260085200"},"score":2,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"By far the best Marvel movie to date! Action from beginning to end. CGI was excellent and the story line was pretty awesome. A lot of twists and turn throughout the movie so be ready to be caught off guard! As usual, stay for the end credits!!!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T20:48:00.244Z","updateDate":"2018-04-28T20:48:00.244Z","user":{"userId":"260026114","realm":"RT","displayName":null,"accountLink":"/user/id/260026114"},"score":5,"timeFromCreation":"Apr 28, 2018"}]}