{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84ODA2NzAyNDYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMDQ6MjY6MjkuMjAzWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNDUyODYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMDQ6Mzg6MDgifQ=="},"reviews":[{"rating":"STAR_5","review":"As expected, Avengers: Infinity War has one of the most sensational and complicated group of action scenes in the MCU so far. This is, after all, the big fight.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10213536783147154/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T04:38:08.000Z","updateDate":"2018-04-28T04:39:19.000Z","user":{"userId":"977245286","realm":"RT","displayName":null,"accountLink":"/user/id/977245286"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"The BEST of the BEST!! 'NUFF SAID.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T04:34:39.914Z","updateDate":"2018-04-28T04:34:39.914Z","user":{"userId":"925171004","realm":"RT","displayName":null,"accountLink":"/user/id/925171004"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Avengers: Infinity War (5 out of 5 stars). Avengers: Infinity War is an epic awesome fun superhero film that is basically the climatic battle of the MCU that has been leading up to this since the very first Iron Man movie. And surprisingly, it does not disappoint. Marvel has been doing well with its storytelling over 19 superhero movies and counting. And every one has been giving hints of the infinity stones or a big bad villain that will soon arrive like Thanos. And Thanos is the groundbreaking villain that will shake the line up of heroes and possibly changing the direction of the rest of the MCU. The plot follows right after the events of Thor: Ragnarok. Thor and Loki and the rest of the Asgardians come across Thanos. And his desire for hunting down every Infinity Stone to annihilate half of the universe. Meanwhile on Earth, Doctor Strange and Iron Man face against danger that lands with Thano's adoptive children who are searching for the remaining stones on Earth. While, the Guardians of the Galaxy are on a race against time on trying to stop Thanos from reaching the final stone. The plot had the Avengers getting separated into their own adventures. Yes, it involves trying to protect the stones or racing against time to find them before he gets it. You have Spider Man, Doc Strange, and Iron Man taking the fight on Thanos home planet. Rocket, Groot, and Thor searching for a weapon. The rest of the Guardians are trying to stop Thanos. Then, Captain America, Black Panther, and Scarlett Witch trying to protect the remaining stone on Earth. Characters were everywhere and had there own objective. Thanos is a villain that is set on world domination. And the writers did add a little emotion to his character and his reasoning behind his motivations of destroying everything. He is the force of nature that will test every Avenger. Sure, some may complain that there are too many characters. Yes, there is. But the writers tried to keep a well-balanced screen time on giving every character enough progression to the story. Which makes this 2 and half hour running time feeling pretty short when several characters are on a different journey that eventually crosses paths. The visual effects and action sequences are plenty throughout and exciting. It is epic. The first ten minutes with Thanos threatening characters and attacking does leave you with chills. There are some awe, shocking, and haunting moments. And some fun humor with characters interacting with each other. When you get so many high ego heroes in one spot together can be hilarious. And than you have the Guardians which they always light up the mood. Every character has a spot to shine with the fight sequences. Then, an epic climatic battle in Wakanda. And the final moments of the film is pretty haunting. Which may leave the audience talking once the credits roll. This shocking cliffhangar does leave you hanging for the next Avengers movie. Especially, on where the direction can go next. Which is best to avoid all spoilers and media to see for yourself. Overall, Avengers: Infinity War is a great superhero film. The plot is epic. Our heroes go through several exciting action set pieces to face against the ultimate villain. The film does have a huge cast ensemble as it is. And every one does get their fair share of screen time. Except for a couple of characters that were absent in this film (there roles are probably saved for the fourth film). The visual effects are amazing. And the action sequences are plenty throughout. There is a lot of action from beginning to end to keep you on the edge of your seat. Especially, when characters lives are at stake. The film does end with a shocking cliffhanger, which will leave you pondering on where the fourth Avengers movie will go. I recommend seeing this film on the big screen. If you seen any of the MCU movies or the previous Avengers film. This is definitely one of the best movies and the climatic part of the Marvel universe. Also, stay tune for the final post credit scene which is an important set up for the next Marvel chapter. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T04:34:01.675Z","updateDate":"2018-04-28T04:34:01.675Z","user":{"userId":"260001649","realm":"RT","displayName":null,"accountLink":"/user/id/260001649"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4","review":"An outstanding achievement from the Russo brothers","displayName":"David J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T04:33:56.000Z","updateDate":"2018-04-28T04:34:58.000Z","user":{"userId":"952935327","realm":"RT","displayName":"David J","accountLink":"/user/id/952935327"},"score":4,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"So good. Never a dull moment.. doesn't get any better. Instead classic. A must see","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10214081130295692/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T04:33:56.000Z","updateDate":"2018-04-28T04:34:37.000Z","user":{"userId":"977245278","realm":"RT","displayName":null,"accountLink":"/user/id/977245278"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"This movie was done so well and hits you so hard! It was completely satisfying. I truly enjoyed how funny it was, when it was serious you would know and the end (without spoiling) leaves you breathless. I will give a semi spoiler. You actually sympathize with Thanos up until the end. It was a side that you truly haven't seen too often from this character and it was refreshing. The characters (as usual) worked really well together and with so many story lines happening at once, it was not confusing at all and flowed very well together. If I could give this more stars I would. It deserves a 10 or more!","displayName":"Tori P","displayImageUrl":"https://graph.facebook.com/v3.3/1064276302/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T04:33:39.000Z","updateDate":"2018-04-28T04:33:51.000Z","user":{"userId":"875739325","realm":"RT","displayName":"Tori P","accountLink":"/user/id/875739325"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"I just saw the movie here in the Philippines and it was an almost perfect movie, from Thanos establishing how bad a%& he is at the start to Captain America's first appearance, to Thor's return with the \"Stormbreaker\", and then that absolutely stunning ending. \n\nI think everybody left the cinema stunned like zombies. With a year to go until the next movie then iI wonder what the heck will happen to the entire Marvel Cinematic Universe (MCU)?\n\nThere is one After Credits scene involving Nick Fury, paving the way for Captain Marvel...","displayName":"Roy Hector K","displayImageUrl":"https://graph.facebook.com/v3.3/100000272183270/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T04:30:34.000Z","updateDate":"2018-05-06T04:29:14.000Z","user":{"userId":"904335292","realm":"RT","displayName":"Roy Hector K","accountLink":"/user/id/904335292"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Great! Probably The Darkest MCU Movie But Still Great! (Is there a way to block or report that racist person in the comments)? AWSOME MOVIE! MARVEL!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T04:30:12.826Z","updateDate":"2018-05-26T18:33:08.081Z","user":{"userId":"976688999","realm":"RT","displayName":null,"accountLink":"/user/id/976688999"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_3","review":"very nice movieand sorry but the ending ruined everything","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T04:29:19.579Z","updateDate":"2018-05-29T01:40:13.335Z","user":{"userId":"899465197","realm":"RT","displayName":null,"accountLink":"/user/id/899465197"},"score":3,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_0_5","review":"They shouldn’t have killed the good characters in the movie","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T04:26:29.203Z","updateDate":"2018-04-28T04:27:05.352Z","user":{"userId":"880670246","realm":"RT","displayName":null,"accountLink":"/user/id/880670246"},"score":0.5,"timeFromCreation":"Apr 28, 2018"}]}