{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyMzgxMzMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDgtMDhUMDg6MDk6NTIifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyMTUxNjIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDgtMDlUMTQ6NTc6MDcifQ=="},"reviews":[{"rating":"STAR_5","review":"Excellent movie. Great pacing and balance between all these characters. The story doesn't get lost like it did in age of ultranationalist.Beat marvel film as of yet.","displayName":"T I","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-09T14:57:07.000Z","updateDate":"2018-08-09T14:58:57.000Z","user":{"userId":"977215162","realm":"RT","displayName":"T I","accountLink":"/user/id/977215162"},"score":5,"timeFromCreation":"Aug 09, 2018"},{"rating":"STAR_5","review":"Good Film.It was weird when Thanos silently ate spaghetti for 20 minutes.Otherwise it's a good film","displayName":"Peyton W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-09T09:45:02.000Z","updateDate":"2018-08-09T09:47:36.000Z","user":{"userId":"977405426","realm":"RT","displayName":"Peyton W","accountLink":"/user/id/977405426"},"score":5,"timeFromCreation":"Aug 09, 2018"},{"rating":"STAR_5","review":"The culmination of 10 years in the Marvel Universe pays off and exceeds expectations.","displayName":"Daniel M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-09T08:25:55.000Z","updateDate":"2018-08-09T08:26:44.000Z","user":{"userId":"976074012","realm":"RT","displayName":"Daniel M","accountLink":"/user/id/976074012"},"score":5,"timeFromCreation":"Aug 09, 2018"},{"rating":"STAR_5","review":"MAY 7, 2018\nBY TEH KEAN HOOI\nWith an unparalleled success across 18 films building up to this momentous pinnacle, Marvel's Avengers: Infinity War has received tons of rousing and positive feedback from its audience all over the world on its world premiere, April 25 alone. \n\nBy far, this is the most historical moment yet for Marvel's Cinematic Universe (MCU) ever since the first Marvel's Avengers (2012) was released on the silver screen. \n\nYou will definitely hear audience cheer and see people getting all excited in the cinema hall before, during and even after the movie's credit scene has rolled. \n\nDo you know of or still remember the massive hype over the first official trailer that was released on YouTube on Nov 29 last year? \n\nFans all over the world, including me waited to see it live on ABC channel via YouTube live broadcast.\n\nThe final trailer which was released on March 17 achieved 9.6 million views in just an hour after it was made public on YouTube.\n\n\n\nNeedless to say, the movie itself did not disappoint a long-running MCU movie lover like me.\n\nThe story was an absolute joy to follow through, so although the runtime is around two hours and thirty five minutes, it never felt like there was any scene that was dragging the audiences' feet.\n\nBoy am I glad that MCU writers haven't written themselves into a corner yet as I think their writing has always been innovative and they know what their audience wants.\n\nFor seasoned comic readers expecting references from the comics, rest assured that your desire would be well sated with such a plethora of inclusion.\n\nThe Russo brothers are smart not to include the money shots found in their official trailers so in no way was the plot revealed to us before we hit the theatre.\n\nTo be frank, there's no need to talk about character development for all the Avengers here because Marvel spent the last ten years doing just that and more .\n\nOf course, the characters still get developed in this movie and the one character that gets the most spotlight is definitely the big bad purple-skinned villain, Thanos (played by Josh Brolin).\n\nI consider him as one of the most well written villain for the superhero genre and is on par with Christopher Nolan's Joker (played by Heath Ledger) from The Dark Knight (2008).\n\nThanos is an extremely powerful villain who possesses God-like abilities when wielding the Infinity Gauntlet with all the six stones installed. \n\nHe almost never underestimates any of his opponents, instead he pays them full respect and this mad Titan is driven by sentiment so who would have thought?\n\nSurprisingly, Tony Stark's Iron Man (played by Robert Downey Jr.) gets plenty of screen time in this team-up and he proves to us that he still got it. \n\nTowards the end of the film, Thanos said \"all that for a drop of blood\" because while it's true that Iron Man does pack one heck of a punch when battling the big bad, Thanos and his Black Order (consists of Ebony Maw, Corvus Glaive, Proxima Midnight & Black Dwarf) but is he strong enough to stop them or prevent his own demise as predicted by most MCU fans? \n\nLet's just say like many of the Phase 1 Avengers such as Capt. and Thor, he isn't getting phased out just yet.\n\nFrom what I've heard, fans around the world revelled in extreme awe and excitement during the final battle when Thor makes an entrance.\n\nSpeaking of technicalities such as cinematography or editing, I have no qualms with them at all as I was too indulged in the story and swift action sequences to notice any potential technical flaw in their masterpiece.\n\nThis means that the visual and sound effects are also worthy of the triple A title that it is.\n\nThe combat scenes are very sleek and with Marvel upping their game in colour grading for their recent releases, I'm glad to see a well pieced-together cinematic achievement.\n\nA few mild censored sequences were detected in the film and fortunately they were quite funny (because audience can tell) and not at all unpleasant. \n\nFor this case, we should thank our Malaysian Film Censorship Board (LPF) for the additional humour.\n\n\"Perfectly balanced, as all things should be,\" is what you would say to reply others when they ask you about the film after you have watched it.\n\n\n\nWith rich popular cultural references and many O-M-G moments, Marvel's Infinity Wars is almost destined to go down in history as the Empire of this generation and still be discussed several years later.\n  \nIf there's anything for certain it is this, Marvel Studios will continue to please Marvel comic book fans, hardcore MCU movies lovers and casual moviegoers too with their epic masterpieces that are incoming.\n\nThough the trailers look both awesome and dreadful at the same time, fret not about the movie itself as Marvel is bringing us the second instalment of Antman soon to cheer us up. \n\nScore: 10/10 (It's intense and perfect, o' so Marvel-lous!)\n\n(Huge thanks to my pal Tih Liang for providing me with great insights about the film during our daily rojak talk)\n\nAlso, check these out. You won't believe some of them, I can assure you now.\n16 Actors Who Were Almost Cast As Avengers\n\nhttps://tkhoointmjieh.wixsite.com/inlinetimes/home/thanos-deserves-our-silence","displayName":"Kean Hooi T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-09T07:30:10.000Z","updateDate":"2018-08-09T07:30:34.000Z","user":{"userId":"912195739","realm":"RT","displayName":"Kean Hooi T","accountLink":"/user/id/912195739"},"score":5,"timeFromCreation":"Aug 09, 2018"},{"rating":"STAR_5","review":"my favorite superhero movie this year avengers infinity war is a funny action pack adventure it didn't feel rushed and every hero get a time shine on the big screen.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-09T04:12:30.810Z","updateDate":"2018-08-09T04:12:30.810Z","user":{"userId":"260174564","realm":"RT","displayName":null,"accountLink":"/user/id/260174564"},"score":5,"timeFromCreation":"Aug 09, 2018"},{"rating":"STAR_3","review":"I have LOVED the Avenger movies but I really did not like this one. It seems when each character only gets a few minutes on screen some how it seems like a mishmash and was not enjoyable for me. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-08T23:23:33.483Z","updateDate":"2018-08-08T23:23:33.483Z","user":{"userId":"260174681","realm":"RT","displayName":null,"accountLink":"/user/id/260174681"},"score":3,"timeFromCreation":"Aug 08, 2018"},{"rating":"STAR_5","review":"Holy Crap! This is my new Favorite MCU Movie, (until endgame) The fact that the Russos can do so many characters is awesome. I'm so glad Thanos was actually a good Villian and I'm so happy with this movie.","displayName":"Logan H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-08T19:47:33.000Z","updateDate":"2019-05-07T15:31:40.000Z","user":{"userId":"977187006","realm":"RT","displayName":"Logan H","accountLink":"/user/id/977187006"},"score":5,"timeFromCreation":"Aug 08, 2018"},{"rating":"STAR_5","review":"Wow! Left speechless ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-08T19:22:02.155Z","updateDate":"2018-08-08T19:22:02.155Z","user":{"userId":"260029719","realm":"RT","displayName":null,"accountLink":"/user/id/260029719"},"score":5,"timeFromCreation":"Aug 08, 2018"},{"rating":"STAR_4","review":"I was entertained! Avengers could of easily stopped Thanos! Hulk and many others like Dr. Strange were weaken if not this would of been another X-Men movie. If you haven’t seen the other movies involving these characters this movie would of been 5 stars. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-08T14:36:29.894Z","updateDate":"2018-08-08T14:36:29.894Z","user":{"userId":"944903832","realm":"RT","displayName":null,"accountLink":"/user/id/944903832"},"score":4,"timeFromCreation":"Aug 08, 2018"},{"rating":"STAR_5","review":"LIVES UP TO THE HYPE","displayName":"Jamie%20 L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-08T08:09:52.000Z","updateDate":"2018-08-08T08:10:33.000Z","user":{"userId":"977238133","realm":"RT","displayName":"Jamie%20 L","accountLink":"/user/id/977238133"},"score":5,"timeFromCreation":"Aug 08, 2018"}]}