{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NDc3Njk5MzkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDNUMTI6MDM6NTIuODk4WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNTU0MTIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDNUMTI6NTg6NDUifQ=="},"reviews":[{"rating":"STAR_5","review":"Wow! This is what a summer block buster should be. Disney CAN make great movies... only issue was with the durability of Thanos. A bit nerdy, but it seems he gets stabbed with weapons pretty easily. To be fair though at this point he's freakishly scary and I got the sense that there is no hope against such a force. I am chomping at the bit to see the conclusion to this saga. In fact. I'm honestly hoping they turn this into a trilogy (instead of just a 2 part). This is how you make an epic trilogy that holds true (kind of) to the source material and how you NOT alienate fans and audiences. I hate to tie this to another movie... but honestly, Kathleen Kennedy, Rian Johnson, and JJ Abrams need to be removed from future films/work under Disney. Lucasfilm is utter garbage with them anywhere near a decision making position. Not nice to say, but omg, it's so bad how much they pissed off over half of traditional Star Wars fans. Anyway, back to Avengers: Infinity War . Three words: Go Watch It! Russo brothers should have directed Star Wars: The Force Awakens and The Last Jedi... in fact, the Wakanda scene totally felt like the Naboo battle in the prequels, which was kind of weird and funny!","displayName":"Rio S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T12:58:45.000Z","updateDate":"2018-05-03T13:09:12.000Z","user":{"userId":"977255412","realm":"RT","displayName":"Rio S","accountLink":"/user/id/977255412"},"score":5,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_5","review":"Epic! A movie worth seeing again and again due to so many details.","displayName":"Andy B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T12:43:16.000Z","updateDate":"2018-05-03T12:58:58.000Z","user":{"userId":"941506011","realm":"RT","displayName":"Andy B","accountLink":"/user/id/941506011"},"score":5,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_5","review":"increíble...imperdible, lo mejor que he visto.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10214090549990552/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T12:42:52.000Z","updateDate":"2018-05-03T12:43:18.000Z","user":{"userId":"977255402","realm":"RT","displayName":null,"accountLink":"/user/id/977255402"},"score":5,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_1_5","review":"Wow. Where do I start? This movie is pretty abysmal.\n\nThis is the first act of a story stretched out over the span of 2 and a half hours because they have 60 characters to juggle.\n\nWatch the trailer, then guess generally what's going to happen, and yup, that's everything that happens in the movie. It has a video-game thin plot that consists mostly of characters running errands. There's no midpoint, no act structure, no rising tension after the first 15-minutes, no organic reason for all these characters to unite, no interesting motivations, no plot variation. There's a rule in screenwriting called the Planes, Trains, and Automobiles rule wherein if you have the same plot point occurring 3 times, you need 3 different methods of making it happen (if a person tries to leave a city 3 times, they take a plane, a train, and an automobile). VAGUE SPOILER: Thanos attempts to obtain 4 infinity stones throughout the movie and each time it plays out in exactly the same way.\n\nInfinity War serves as the thematic antithesis to The Last Jedi. While the most recent Star Wars film implores us to forget the past in favour of bold new directions, Infinity War does away with those advancements - most notably abandoning or rewriting elements of Civil War and Ragnarok to revert to the status quo. The film's ending is a clear desertion of the progress the universe has made. This is upsetting because sameness and repetition have been two of the primary critiques leveled against MCU movies since Age of Ultron. This is a film that essentially revolves around those complaints, with the plot relying on a lack of progress and repetition even on a micro-level.\n\nIt's also worth mentioning that Thanos has the laziest motivation known to screenwriting. \"Kill half of humanity before they kill themselves\" was an interesting philosophical argument when Isaac Asimov used it 70 years ago. Since then, it's been the motivation of every AI or alien villain in cinema. It's the next easiest motivation besides \"world domination.\" In the source material, Thanos' infatuation with the embodiment of Death gives the character an original and empathetic motive. Any audience member can relate to doing the irrational for a loved one. The film adaptation, unfortunately, abandons that, however, for a cliche.\n\nI've heard the argument that this is the best movie you could have made given the circumstances. Firstly, I can't imagine that to be true. More importantly, however, that's a terrible excuse. If you can't make a good movie with 60 characters and 4 concurrent storylines, don't do that; restrain yourself. Make a film with fewer characters that has some resemblance to a story structure or character development.","displayName":"Evan A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T12:33:16.000Z","updateDate":"2018-05-18T07:12:58.000Z","user":{"userId":"915023067","realm":"RT","displayName":"Evan A","accountLink":"/user/id/915023067"},"score":1.5,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_5","review":"Infinity war manages to not only be an extremely satisfying climax for the MCU but also to tell a compelling story of its own filled with great characters with very interesting storylines.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/201229547325163/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T12:31:12.000Z","updateDate":"2018-05-03T12:45:06.000Z","user":{"userId":"977255391","realm":"RT","displayName":null,"accountLink":"/user/id/977255391"},"score":5,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_5","review":"I Loved Everything From This Movie! This Movie is *Historic*","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1884602054923428/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T12:27:59.000Z","updateDate":"2018-05-03T12:29:44.000Z","user":{"userId":"977255387","realm":"RT","displayName":null,"accountLink":"/user/id/977255387"},"score":5,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_5","review":"Best, most hard-hitting Marvel adventure yet to come to screen. It was well worth the decade of waiting.","displayName":"Joel H","displayImageUrl":"https://graph.facebook.com/v3.3/683980120/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T12:17:56.000Z","updateDate":"2018-05-03T12:23:16.000Z","user":{"userId":"819433581","realm":"RT","displayName":"Joel H","accountLink":"/user/id/819433581"},"score":5,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_4","review":"I was nervous going into this one, firstly because it's the beginning of the end, the Marvel Universe which we have come to love will be changed forever by the time we reach the end credits of the Infinity War sequel next year plus I know this story and I knew bad bad things were about to go down and I was not wrong!\nThe film still has lighter moments but straight from the off you can tell that this is a different kind of Marvel film and it's heading down a darker path.  The man at the end of this dark path is Josh Brolin's Thanos, a villain who it would have been very easy to turn into a silly pantomime villain but Thanos is much more of a complex character and despite all of his wrong doings and evil ways, you do actually feel for him in parts of the film and that is down to excellent writing and a spot on screen portrayal.\nIt's an action packed film that looks great but it's probably the Avengers film that has the most heart behind it.  For anyone who is feeling superhero fatigue with the never ending stream of these types of movie, if it ended with Infinity War it would definitely be ending on a high.\nIt's also worth sticking around for the end credits, just recently the end credit scenes haven't been worth the extra bum bumbing 10 minutes stuck in your seat but this links in perfectly to the next Marvel film that will resolve this story as we lead into the sequel.\nWell worth seeing if you're a fan but whereas the other Avenger movies you could probably watch without having seen the others, I would say this one needs to be seen after the rest otherwise it's just not going to have the same impact.","displayName":"Richard S","displayImageUrl":"https://graph.facebook.com/v3.3/731472530/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T12:12:06.000Z","updateDate":"2018-05-03T12:12:19.000Z","user":{"userId":"789641593","realm":"RT","displayName":"Richard S","accountLink":"/user/id/789641593"},"score":4,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_5","review":"Incredible. Brutal. Lo mejor que he visto en mi vida","displayName":"Hernán V","displayImageUrl":"https://graph.facebook.com/v3.3/10206943102035404/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T12:09:28.000Z","updateDate":"2018-05-03T12:09:43.000Z","user":{"userId":"970328950","realm":"RT","displayName":"Hernán V","accountLink":"/user/id/970328950"},"score":5,"timeFromCreation":"May 03, 2018"},{"rating":"STAR_4","review":"No, not the BEST Marvel movie but by far the most EPIC.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-03T12:03:52.898Z","updateDate":"2018-05-03T12:03:52.898Z","user":{"userId":"947769939","realm":"RT","displayName":null,"accountLink":"/user/id/947769939"},"score":4,"timeFromCreation":"May 03, 2018"}]}