{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NDE1NjU4NzYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDJUMDk6NDU6MjUifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNTM5NjIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDJUMTA6NTA6MTIifQ=="},"reviews":[{"rating":"STAR_5","review":"This film is so amazing. I can't take my eyes off any seconds. Of course, IW is still have so many  things which is  inconsequent, but I still love it <3","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1666306390120642/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T10:50:12.000Z","updateDate":"2018-05-02T10:59:49.000Z","user":{"userId":"977253962","realm":"RT","displayName":null,"accountLink":"/user/id/977253962"},"score":5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_4","review":"Mercilessly Relentless Yet Epic In Every Aspect, Avengers Infinity War Is A Showstopping Emotional Spirit Breaker That Is Well Executed and Well Earned.","displayName":"Brandon P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T10:30:23.000Z","updateDate":"2018-05-02T10:34:22.000Z","user":{"userId":"905965201","realm":"RT","displayName":"Brandon P","accountLink":"/user/id/905965201"},"score":4,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_5","review":"10 Years in the making, Infinity War does not disappoint.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1352977748172512/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T10:18:52.000Z","updateDate":"2018-05-02T10:20:43.000Z","user":{"userId":"977253929","realm":"RT","displayName":null,"accountLink":"/user/id/977253929"},"score":5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_4_5","review":"Avengers: Infinity War somehow managed to pull off the herculean task of merging dozens of superheroes and villains into a single film. Aside from a handful of comic relief moments that fall flat and a couple of phoned-in pop culture references, Infinity War is hands down one of the all-time great superhero movies with outstanding action and CGI, a surprisingly amazing soundtrack, and a villain that actually feels intimidating and unstoppable for once in a superhero movie.","displayName":"Spencer S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T10:11:42.000Z","updateDate":"2018-05-02T10:17:08.000Z","user":{"userId":"904373369","realm":"RT","displayName":"Spencer S","accountLink":"/user/id/904373369"},"score":4.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_3_5","review":"Entertaining, and hilarious, Infinity War hits so many MCU beats, it’s a total blast!!! Infinity War is fun at the cost of losing continuity with the other films. That is supposed to be the cool thing about the MCU, but this film makes the MCU feel more like solo stories. The characters were enjoyable, but not fleshed out. Thanos was a good villain, with less than impressive motivations. Thanos relationship with Gamora was the winner here. The gauntlet seemed powerful when the story needed it to be, and not so much at other times, those inconsistencies stuck out like a sore thumb. Best characters: Doctor Strange, Ironman, Thor, Spider-Man, Thanos and Gamora.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T10:11:41.797Z","updateDate":"2018-05-02T13:46:20.712Z","user":{"userId":"260000668","realm":"RT","displayName":null,"accountLink":"/user/id/260000668"},"score":3.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_5","review":"Really loved it, the fight scenes were well choreographed, good pacing, did not feel like it was over 2.5 hrs. Emotional highs and lows throughout the entire movie.","displayName":"Lindsay T","displayImageUrl":"https://graph.facebook.com/v3.3/829739378/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T10:07:32.000Z","updateDate":"2018-05-02T10:09:16.000Z","user":{"userId":"819286777","realm":"RT","displayName":"Lindsay T","accountLink":"/user/id/819286777"},"score":5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_4_5","review":"Smart, funny, dramatic, and emotional, Avengers Infinity War delivers everything it promised after ten years of anticipation and build up. The action is great, the characters are as wonderful as they have always been, the story is excellent with mountains of emotional weight supporting it, and the villain is above and beyond fascinating. While all the heroes are  great, Thanos (The main antagonist) is the real star of this movie. He is by far the most interesting and emotionally complex villain I have seen in a comic book movie for a very long time. Even though we (the audience) know he's wrong, we can still buy into how and why Thanos believes he's right. All in all, Avengers Infinity War is arguably Marvel's greatest Masterpiece. One can only hope that the next one will prove to be just as good when it comes out next year.","displayName":"Zachariah W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T10:05:03.000Z","updateDate":"2018-05-02T10:19:13.000Z","user":{"userId":"911393495","realm":"RT","displayName":"Zachariah W","accountLink":"/user/id/911393495"},"score":4.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_4_5","review":"Avengers Infinity War is the long awaited confrontation of the entire MCU, built up since phase one.  Ever since the first Avengers this film has been hyped up; six years of hype.  Is it worth it? For the most part yes, in my opinion.  I will say this is by far the best Avengers movie.  This probably now in my top favorite MCU along with Civil War and Winter Soldier, which the Russo Brothers directed all three.  I will say, Civil War is still probably my favorite MCU movie, but Infinity War is close.  It's either number two or three.\nThe general plot is simple.  Thanos is on a crusade to obtain the infinity stones so he can destroy half the life in the universe.  Now it's up to the Avengers and the Guardians of the Galaxy to stop him.  That's the simplified plot.\nThere's so much this movie does right.  First of all is the size of it.  This is a huge movie, which it should be since it's based off a huge story arc.  This movie felt like a comic book event story come to life, which no other comic book movie has done before.  The effects are on point.  The action is on point, particularly the big fight in Wakanda.  Everyone gives a solid to a great performance, especially Josh Brolin as Thanos.  The music was good as well.  It perfectly served the film.  \nThe film does a great job balancing characters too.  Having to balance a cast of this size, from all these other movies, is a daunting task, but the Russo Brothers managed to pull it off for the most part.  There were a couple characters I wish had more time, but mostly the characters were all well utilized.\nThanos is the easily the best villain in the MCU.  Before it was Loki and Zemo, but Thanos blows them out of the water.  He is easily the most powerful villain in this universe thus far.  The sense of danger is always present with him.  This guy has a body count; a high body count.  He's not your typical one-dimensional villain either.  He's an actual character with some depth, like Loki and Zemo. \nThe ending is also quite ballsy for Marvel.  Given that MCU films up until now have been fun and have played things fairly safe, with the possible exception of Civil War, I was surprised they ended like this.  I'm equally shocked Disney approved it.  If this ending actually sticks going forward; if it's permanent I will commend Disney and Marvel for having balls of steel, but it won't be.  We all know this ending will be undone in future movies.  \nHowever, even Marvel knows they can't just undo the ending and call it a day.  What would be the point then? People would say it's a major copout, and would render this film irrelevant.  There has to be more.  I'm curious to see how Marvel will handle this down the line.  I honestly don't know where this is all going, which I guess is a compliment to the film.\nI do have grievances with the film.  In the grand scheme these are minor complaints, but they bug nonetheless.  First is the lack of Hawkeye and Ant Man.  They do mention both of them, but neither appears in the film, which is a disappointment.  I know Ant Man and the Wasp is coming out, but I would still like them to be here since this is supposed to be the movie to united all the heroes from the MCU so far.  They were both in Civil War, so they should've been here.\nThe Hulk doesn't appear much either, which was really surprising for me.  He has a cool moment at the very beginning, but then never appears again.  There are some scenes of him in the final battle, but they're not in the movie.  That sucks, because the Hulk is one of my favorites.  He did more in Thor Ragnarok.\nOn that subject, this film does make the ending of Ragnarok irrelevant.  I don't love Ragnarok, but I do like it, so it was slightly disheartening that Infinity War essentially made that film irrelevant.  Also, Thor's power level was kid of all over the place in this film.  This guy was able to survive in space with no air and without freezing.  I didn't know he could do that.  He also took the force of a dying star and lived.  The man has some insane plot armor on him in this film.\nThor's entire subplot in this film felt a bit pointless.  If there was a slightly boring and filler-like bit in this film it would be Thor's quest.  It ultimately didn't amount to much.\nThere were a few plot contrivances too; one involving Star Lord and his group.  I can't get into that without spoilers.  Another is an issue that always comes up in any story when you introduce a villain like this.  When you have a villain this powerful, where he's essentially God, there shouldn't be a fight.  Thanos should destroy everybody with no struggle and the movie would be over in ten minutes.  But they have to nerf him a bit to give the heroes a fighting chance.  That's really a nitpick, but it just bugs me a little.   \nOverall, despite my issues, Infinity War is an amazing ride.  It's one of my favorite MCU films to date now.  My problems are really minor, and mostly my personal grievances.  The film was very much worth the hype.","displayName":"Mitchell B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T09:57:57.000Z","updateDate":"2018-05-02T09:58:31.000Z","user":{"userId":"950134269","realm":"RT","displayName":"Mitchell B","accountLink":"/user/id/950134269"},"score":4.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_1","review":"It was very disappointing, I've loved all the Marvel movies in the MCU up to this point. Infinity War was a disappointment in comparison.","displayName":"Jessica J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T09:46:40.000Z","updateDate":"2018-05-02T09:48:29.000Z","user":{"userId":"977253889","realm":"RT","displayName":"Jessica J","accountLink":"/user/id/977253889"},"score":1,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_0_5","review":"this was the worst movie I have seen all year, the plot had so many plot holes that is made swiss cheese look like it does not have any holes.  Thanos is a cheap rip off of Darksied.  It was just an awful movie.","displayName":"Robert L","displayImageUrl":"https://graph.facebook.com/v3.3/100000724009513/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T09:45:25.000Z","updateDate":"2018-05-02T09:47:54.000Z","user":{"userId":"941565876","realm":"RT","displayName":"Robert L","accountLink":"/user/id/941565876"},"score":0.5,"timeFromCreation":"May 02, 2018"}]}