{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MDU1MzM2NTUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjlUMTg6MjU6NTAuNTE5WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84MjExMjc1NzIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjlUMTg6MzQ6NTMifQ=="},"reviews":[{"rating":"STAR_5","review":"So I sat watching sat there watching a movie that on paper should not have worked! But OMG even with all these characters given time to shine it worked on the big screen, on paper, on whatever platform this movie is epic beyond words, and it's a movie that shows how building up a major epic villain in the comic book world is done right. \n\nYou see HAD Thanos never shown up before he would not have worked this well but having had the hype build up via all the other MCU movies to finally see him unleashed in this movie was a pure moment of fan joygasm. Played brilliantly by motion capture was Thanos but the man behind the motion, and the one who captured the role to perfection was \"Josh Brolin\" who also will play \"Cable\" in this summers sure block buster \"Deadpool 2\" remember Josh Brolin once turned down BATMAN to play these two roles. So far it looks like he did the right thing as Batman went to Ben Afflack, and well that became a total mess, and joke over at WB/DC.\n\nThis coming off a very good Black Panther movie which broke all sorts of records itself this so good for the Marvel/Disney brand... Like they needed more \"good\" vibes off a hit movie??? Seems to me they really have a total lockdown on how these comic book movies can and should be adapted from the source with doing their own thing. Here they have managed to really not only give us solo movies but team up movies, and now these giant super team up movies like the Avengers which took years to accomplish but Marvel/Disney has really mastered the end result. That's the trick! \n\nSee folks it's now how you start the process it's how you finish it, and thus far Marvel is crushing it with each movie. We had a nice but show intro to Black Panther, and look how that went? Now Avengers coming off that clearly was going to receive a nice boost at the box office, and with what for sure be a great word of mouth this movie should once again break all sorts of records.\n\nLook you might not have loved all the individual movies but in a big scale when you watch all the movies and you see how they are pulling all these characters to one major war it's hard to really see how it could possibly work, and yet it does, and boy does it ever... Now I won't get too into that many spoilers with my review or even go to in detail other than to say if you never watch this movie after watching everything MCU put before, and you seen all of that you're an idiot for missing this one in theaters. IMAX, 3D, 2D! Whatever! Go now! This movie is epic beyond words.\n\nThis movie is somehow loaded with countless big name star Marvel characters, and it's brilliantly weaved together in a story arcs with characters pulled from alternate parts of the timelines that last seen them in their own movies at times, and some in team up movies, and some just recently in his own origin movie.\n\nEveryone you expect gets a moment to shine here! We even get an awesome \"IRON-Spiderman\" suit in the movie... There is one line between Spiderman, and Dr Strange about using fake names which was hilarious, and that's one thing none of the jokes here miss! There is a lot of well times jokes to keep you laughing, and action like you wouldn't believe.\n\nNothing is left out with maybe I guess Adam Warlock, and Mrs Marvel being two characters I missed not having involved  in there but since she hasn't had a film to herself, and neither has he it's OK to not have them here, and plus the Fox merger ain't happen yet, and so we got no X-MEN in there either... So I'll wait for them in the next phase to come out. \n\nI'm sure down the line there will be another Infinity War type when we get those members... Perhaps the \"Secret Wars\" ? Perhaps the next one will be \"Infinity Wars 2\" ? Who knows but all I know is that whatever is coming up next I'm 100% down to fork over my money. Marvel has found a formula for these movies which work so well, and it's incredible to think they were doing so bad at one point they sold the rights to so many characters to other companies. Just think if Marvel had the full rights of these characters under Disney! \"X-Men, Silver Surfer, FF, Hulk, Spiderman\" from day 1! To think they went into this with a list of characters nobody cared much about. NOW look at where Marvel movies have come!\n\nGotta give it up to Directors \"Anthony Russo, and Joe Russo\" who really did a masterful job at putting together the scrip written by Writers \"Christopher Markus, Stephen McFeely\" who clearly were paying full attention while the previous movies were being made, and wrote a brilliant script. I wish Rian Johnson had got his movie \"The Last Jedi\" this right.\n\nThis is how you properly continue from one sequel to the next, and leave on a cliff hanger that makes all just not only satisfied with what we just got but wanting more, and not walking out feeling cheated, and like they ruined or raped our childhood or messed up the last decade of our watching these movies... This is the best comic book movie thus far I've seen from Marvel, and probably EVER from any brand.\n\n10/10\n5 Stars\n\nBloody well done!","displayName":"Angel E","displayImageUrl":"https://graph.facebook.com/v3.3/660174259/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T18:34:53.000Z","updateDate":"2018-04-30T20:55:28.000Z","user":{"userId":"821127572","realm":"RT","displayName":"Angel E","accountLink":"/user/id/821127572"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"finally!!!. the Mad Titan has arrived. Awesome movie can't wait for part 2. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T18:34:43.982Z","updateDate":"2018-04-29T18:34:43.982Z","user":{"userId":"260124414","realm":"RT","displayName":null,"accountLink":"/user/id/260124414"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"It was awesome, it's just like watching a comic book come to life.","displayName":"John O","displayImageUrl":"https://graph.facebook.com/v3.3/1634574558/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T18:34:38.000Z","updateDate":"2018-04-29T18:35:35.000Z","user":{"userId":"878545879","realm":"RT","displayName":"John O","accountLink":"/user/id/878545879"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_1_5","review":"Movie was very disappointing.  too much drawing out plot during movie, which was disappointing.  then hulk is defeated and never returns in movie??? disappointing.  worst part is did not show black panther until end of movie for few minutes. then most of avengers die in the end.  extremely disappointing...","displayName":"Alfonza S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T18:33:30.000Z","updateDate":"2018-04-29T18:56:33.000Z","user":{"userId":"977249609","realm":"RT","displayName":"Alfonza S","accountLink":"/user/id/977249609"},"score":1.5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":" I'm exhausted, but looking forward to more. I'm going back to see it again without a doubt. I didn't expect Thanos' character to be as complex as this, but I like what they did with him. He is one of the most dangerous and powerful beings that the MCU has to offer and they could have just portrayed him like any other near omnipotent being (l say near omnipotent because he's working on becoming all powerful) and not even attempted to flesh out the character. Well done. The overall movie was impressive, considering that you had to use virtually every character in the current MCU movie universe, which is definitely tough to pull off. After all who among them would sit out such a cataclysmic event... sorry Hulk, l still love you bro. Despite all that was going on at different points during the movie I think you did a terrific job, but like I said NEED to see it again.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T18:33:00.757Z","updateDate":"2018-04-29T18:33:00.757Z","user":{"userId":"953035192","realm":"RT","displayName":null,"accountLink":"/user/id/953035192"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Quite possibly the best MCU movie this far, will have a hard time waiting for next year!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1760060990685467/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T18:30:10.000Z","updateDate":"2018-04-29T18:32:05.000Z","user":{"userId":"976994221","realm":"RT","displayName":null,"accountLink":"/user/id/976994221"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_2","review":"Very disappointed. How can you do what you did.... you lost me as a follower. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T18:30:02.413Z","updateDate":"2018-04-29T18:30:02.413Z","user":{"userId":"260124413","realm":"RT","displayName":null,"accountLink":"/user/id/260124413"},"score":2,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"never dissapointed with MCU. can't wait to see Captain Marvel and Infinity War part two <3","displayName":"Nadhira A","displayImageUrl":"https://graph.facebook.com/v3.3/735825620/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T18:26:21.000Z","updateDate":"2018-04-29T18:28:17.000Z","user":{"userId":"876588250","realm":"RT","displayName":"Nadhira A","accountLink":"/user/id/876588250"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Great action packed movie. I normally don’t like too many characters in a movie but they did a great job keeping it not too confusing. We all enjoyed the laughter and the tears. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T18:26:19.937Z","updateDate":"2018-04-29T18:26:19.937Z","user":{"userId":"855512480","realm":"RT","displayName":null,"accountLink":"/user/id/855512480"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Avengers: Infinity War manages to live up to 10 years or hype and anticipation. The cast is extraordinary, but the real star is Josh Brolin as Thanos. His performance and the writing that went into this villain makes him by far the best villain yet in a Marvel motion picture.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T18:25:50.519Z","updateDate":"2018-04-29T18:25:50.519Z","user":{"userId":"905533655","realm":"RT","displayName":null,"accountLink":"/user/id/905533655"},"score":5,"timeFromCreation":"Apr 29, 2018"}]}