{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzMzODc0MzQiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMTE6NDA6MDkifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwNjE1NTMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMTE6NTg6MjcuNzUwWiJ9"},"reviews":[{"rating":"STAR_0_5","review":"Horrible, the whole movie is plot convenience.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T11:58:27.750Z","updateDate":"2018-04-28T11:59:04.209Z","user":{"userId":"260061553","realm":"RT","displayName":null,"accountLink":"/user/id/260061553"},"score":0.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Loved it but now I want the 4th one. Great way to combined all these characters. My sweet rabbit indeed ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T11:57:27.441Z","updateDate":"2018-04-28T11:57:27.441Z","user":{"userId":"260018551","realm":"RT","displayName":null,"accountLink":"/user/id/260018551"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_0_5","review":"Too much fanservice, too much cheap comedy. It proposes nothing new or mildly fresh. Everything feels like a convulted version of cliches already seen elsewhere.","displayName":"Juan Carlos S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T11:56:45.000Z","updateDate":"2018-04-28T12:02:01.000Z","user":{"userId":"934310471","realm":"RT","displayName":"Juan Carlos S","accountLink":"/user/id/934310471"},"score":0.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4","review":"Avengers infinity war is a fun, action packed emotional roller coaster ride from start to finish. Thanos is now my favorite comic book movie villain of all time. His conviction in believing what he is doing is right makes him a scary scary villain","displayName":"Christopher H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T11:51:15.000Z","updateDate":"2018-12-17T11:23:08.000Z","user":{"userId":"940551295","realm":"RT","displayName":"Christopher H","accountLink":"/user/id/940551295"},"score":4,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4","review":"While the acting goes from good to really really bad, it’s exactly what fans of this series need. Loads of action and effects, many surprises. And a game changing finish. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T11:47:03.664Z","updateDate":"2018-04-28T11:47:17.971Z","user":{"userId":"879019272","realm":"RT","displayName":null,"accountLink":"/user/id/879019272"},"score":4,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_1_5","review":"Prefer Civil War better then this one, not that funny and way too many characters ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T11:46:36.505Z","updateDate":"2018-05-06T00:05:51.218Z","user":{"userId":"260122903","realm":"RT","displayName":null,"accountLink":"/user/id/260122903"},"score":1.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"melhoe filme de super heroi que eu assisti","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/2076392875782699/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T11:45:17.000Z","updateDate":"2018-04-28T11:45:41.000Z","user":{"userId":"977246175","realm":"RT","displayName":null,"accountLink":"/user/id/977246175"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"OMG I don't know where to begin with this. this is a solid finish to the decade built up. DC should have been taking notes on how to do it right. some characters lived others faded away. (thinking the ones that faded away are not set in stone for contracts and if they don't resign they will be unable to be brought back. those that resign will be back in avengers 4) I am thinkin antman and wasp are taking place at the start of this movie when they come for strange and stark and parker. and I am not sure how captain marvel will help fix this as its set in 1980s. but we will see.","displayName":"James B","displayImageUrl":"https://graph.facebook.com/v3.3/1613880508867529/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T11:44:41.000Z","updateDate":"2018-04-28T11:46:01.000Z","user":{"userId":"970928628","realm":"RT","displayName":"James B","accountLink":"/user/id/970928628"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_2","review":"The 2018 Avengers movie was probably one of the most anticipated Marvel movies yet. With over 20 main characters being pulled together into one movie, expectations were very high for most people.  Of course, speculations were being thrown around all over the internet on what could possibly happen. Where are all the infinity stones? How will they implement all the characters into the movie? How will the Avengers beat their most formidable opponent yet? The answer to this question was probably one of the most frustrating aspects for me. This review is going to very opinionated, so keep that in mind. Also, there will be spoilers in here, so you have been warned. Without further ado...\n\t\n\tPROS\nBeginning with all the pros of this movie, I would like to point out that I believe the writers did a pretty decent job of implementing the characters and keeping them, for the most part, involved. With this many characters to keep track of, you would expect that not enough time would be spent with all of them. On this note, I would say they did alright. \n\tEmotionally, I was very much connected. I felt horrified when people were dying or bad things were taking place. They did a great job with keeping me emotionally attached to the situations. When Loki died, I honestly had not expected to feel the way I did. With all the bad things he has done in the past, I thought I would be alright with his death. But no, I was very much saddened by the loss of this character. RIP Loki. Peter Parker's passing at the end was also something that emotionally was taking a toll. This scene was set up beautifully. Tony Stark was standing with Peter when suddenly he began dying. Parker displayed the very real emotion of being afraid to die. I believe the Marvel writers set up Tony Stark's character to be very protective. The cause of Captain America Civil War was because Stark was very guilty with the deaths of those at Sokovia. Stark always pushed Parker away because he didn't want him getting hurt. Here, Tony Stark's worst fears have come to life, with the loss of his \"apprentice,\" Peter Parker. Again, Marvel did well in these emotional setups. \n\tA small note here; the inclusion of the Red Skull was a pretty big pro for me, but this is more on a personal level. Ever since my family saw Captain America The First Avenger, we have speculated that he would return. Finally, after many years of speculation, it was confirmed!\n\n\tCONS\nNow we are moving to the cons. Unfortunately, there are many here for me that really caused me to be disappointed with Marvel at this point. They have done so well with just about all of their movies up to this point. \n\tThe ending was the worst. I know people are going to say, \"Nicholas, they are just setting it up for the next movie.\" But I would have to reply that I understand that, but there was in no way a wrap up to this movie. In Captain America Civil War, yes they kind of left a sort of cliffhanger, but they ended well with somewhat of a wrap up with Steve Rogers writing to Stark. When I went to see the new Avengers movie, I just paid for half of a movie. I should have just waited for the next movie to come out and see these two together. Not only was it the biggest cliffhanger ever, it was the most depressing with absolutely NO signs of hope (unless you count the after credits scene, but it is after the credits and not technically part of the actual movie so). \n\tThis movie also made me feel used. Marvel/Disney is in this for the money. I felt that about the purchase of Star Wars, and I feel that about the Marvel Universe as well. This movie basically forces you to watch the next one. Again, I watched half a movie. Not only did I watch half a movie, I watched a pointless movie. The Avengers FAIL in the end. What was the point of all the fighting. But I digress. Marvel wants us to keep coming back. They might never stop making movies like this.\n\tThe MASSIVE amounts of death in these movies is also something I have felt uncomfortable about in recents years, and I'm not even talking about the ending that Thanos caused either. I mean with the Asgardians. Thanos just straight up slaughtered them. What was the point of Thor Ragnarok if they were all going to die anyways?! This also refers back to Thor Ragnarok with the death idea too. Hela, the goddess of death, straight up murdered the Warriors Three, some of Thor's closest allies. What was that all about?! Then there was just about all the Valkyries dying. I feel that Marvel is now becoming numb. They are just murdering everyone at this point. Just about every Marvel character has either died or come very close to death. So the amount of death is most likely a problem for me. I mean, how are we supposed to let our kids come to watch all this. I believe this is questionable content for children.\n\nA Christian Perspective\n\tThe following comments may not strike a bone with those that do not believe in an existing God. However, for those that have studied the Holy Bible, some interesting symbolism appears throughout this movie that would give some interesting insight on some \"worldly views.\" \n\tAgain, huge spoilers ahead so you have been warned. The following ideas pertain to the overall story idea. Thanos, the villain in this movie, wants the infinity stones because with this power he came wipe out half of the population of the universe. He says he wants to bring balance, but I'm still a little speculative of how taking all these people accomplishes this. Moving forward, how is this related to Christianity? The Bible explains that there will be an event called the rapture in which God will take all those that have accepted Jesus, his son whom died two thousand years ago, as their Lord and Savior to heaven to be with him. Those that have not accepted him will remain on Earth for some time. I won't go too deep, but look at the comparisons. Thanos is the one basically all-powerful being, like God. Thanos causes an event in which many people are taken and many are left behind, like God causes the rapture. And what makes this even stranger for me was when Steve Rogers makes a one word comment at the end of the movie. His last word was this: \"God.\" Remember, Thanos is the BAD guy in this movie. What is liberal hollywood trying to put in our minds exactly? I've laid out these thoughts for you, take them as you will.\n\tSmall note here; Hollywood is again pushing their beliefs through TV, laying out it was the big bang that created the universe. You may say, \"This universe isn't real man. Why are you being so critical?\" As these ideas are continually pushed on people, from in school to media, eventually it will be accepted as truth. Those that believe in Christianity will be mocked and rejected. We must be conscious of this. \n\tAnother symbolic move that relates to Christianity is the soul sacrifice. For Thanos to move on with his plans, he had to sacrifice his child. Similarly, Jesus, God's son, was sacrificed. Again, interesting thoughts to ponder. \n\n\nIn Conclusion\n\tOverall, this movie was an emotional roller-coaster for me. I enjoyed seeing the characters coming together, but seeing them ALL fail was a little much. And with the after credits scene speculating to me that another new hero will have to save the day doesn't really bring me that much hope. I will end by saying this is by far not one of Marvel's best. This movie did not live up to the hype for me. However, I'm not sure if I would suggest this movie or not. If you don't see it, you don't have to be dissapointed, but then again you miss the interesting symbolism I see. I would suggest to you to just be cautious and realize, it's just a movie...","displayName":"Nicholas%20 M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T11:43:40.000Z","updateDate":"2018-04-28T12:03:47.000Z","user":{"userId":"977246178","realm":"RT","displayName":"Nicholas%20 M","accountLink":"/user/id/977246178"},"score":2,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4","review":"Ten years ago, in 2008, Iron Man was released in theaters. At the time, not many people knew who this Marvel character was, so it was uncertain as to how well the film would fair in theaters. However, the film became a surprising smash hit, earning a 94% on Rotten Tomatoes and grossing over $500 million. In the film's post-credits scene, something that has since become synonymous with Marvel films, Nick Fury appeared to talk to Tony Stark about the \"Avengers Initiative.\" Nobody could have predicted what followed in the next decade. Now, in 2018, eighteen films have been released in what has been dubbed the \"Marvel Cinematic Universe,\" a film series that includes a wide variety of films featuring Marvel characters ranging from the well-known Captain America and Spider-Man to lesser-known personalities like the Guardians of the Galaxy. Finally, the nineteenth film in the Marvel Cinematic Universe, Avengers: Infinity War, has arrived, acting as the culmination of ten years of hard work from Marvel Studios and rounding up dozens of characters under the same runtime. Let's talk about it.\n\nUsually, after my introductions in film reviews, I devote a paragraph to talking about the characters in the film and the talents of the actors portraying them. However, Infinity War features such a wide variety of characters that talking about them would take several pages. So I'll do my best to quickly name the superheroes (and supervillains) that are featured in the film: Captain America, Iron Man, Thor, Hulk, Spider-Man, Doctor Strange, the Guardians of the Galaxy, Black Widow, Black Panther, War Machine, Vision, Scarlet Witch, the Winter Soldier, Loki, and Falcon. Did I forget anybody? They are joined by the long-awaited arrival of their most powerful nemesis yet: Thanos, the Mad Titan who is trying to collect six \"Infinity Stones,\" objects that, once collected, would give Thanos complete control over the Universe and the capability to destroy it. So, needless to say, the stakes are very high in this film, much higher than they have been in any of the previous outings of the MCU.\n\nSo, what works in Avengers: Infinity War? The film is directed by Anthony and Joe Russo, brothers who have directed Captain America: The Winter Soldier and Captain America: Civil War. The latter of the two films featured the largest collection of Marvel characters ever seen in a film in the MCU (before Infinity War, of course). In Civil War they demonstrated how effectively they could handle a huge pile of characters, which gave me confidence in Infinity War. I am pleased to say that they succeeded again and achieved what many would have dubbed \"impossible.\" The film somehow never feels overcrowded, and every character in the film feels relevant and written into the script with care. Throughout the film, the heroes split up into groups with their own unique quests, all of which come full circle and collide with one another by the time the credits roll. Some characters are given less of a spotlight than others, which was inevitable, but the Russo brothers obviously knew what they were doing when they helmed Infinity War, and I was impressed with the final result.\n\nAnother thing that surprised me about Infinity War was Thanos. This villain is a maniacal, tyrannical mad-man/Titan bent on destruction and brought to life using CGI. Sound familiar? Last year's Justice League had a very similar-sounding villain called Steppenwolf, and he was a hot mess of computer-generated garbage and clichéd dialogue. He failed to be compelling, and I was worried that Infinity War would fall into the same trap. Miraculously, the writers found a way to make Thanos more human than he is Titan, turning him into a shockingly three-dimensional character. While his motivations seem very cut and dry and he seems like your typical destructo-maniac on the surface, you find out that his reasoning for doing what he does is complex. Many people have complained in the past about Marvel's inability to create compelling villains for their films. With three of their most recent releases, Spider-Man: Homecoming, Black Panther, and now Infinity War, they prove that complaint to be nothing but the voice of haters.\n\nNow, what doesn't work in Avengers: Infinity War? I'm happy to say, not much. The film suffers mildly from your generic Hollywood blockbuster tropes, like moments of deus ex machina and some cliché lines. There is also a LOT of CGI prevalent in the film, which is certainly not a bad thing per se. For most of the film, it looks very good. Even the handful of characters that are completely computer-generated - Thanos and his Black Order - look pretty good. There are just a few moments of obvious green screen or unfinished computer-work that take the audience out of the experience. Overall, however, I was impressed by the film's visuals.\n\nFinally, how does Infinity War hold up as a Marvel film? Well, fans of the franchise are going to be very pleased. And I mean VERY pleased. The interactions between the characters are as funny and heartwarming as you'd expect. Many of the heroes meet each other for the first time ever in the film, and others reunite for the first time in years. This makes for a plethora of memorable moments... there's nothing quite like seeing billionaire Tony Stark exchange insults with Doctor Strange or watching eccentric space pirate Star Lord insult Thor's muscles out of jealousy. Infinity War also delivers some of the most shocking moments ever seen in the Marvel Cinematic Universe: it will have your jaw hung in admiration, your eyes welled up with tears, and your teeth biting your fingernails from the tension. Be prepared Marvel-ites, you've never seen anything quite like this.\n\nAvengers: Infinity War is an exciting, excellently crafted film that more than lives up to the anticipation set by its predecessors. It is action-packed, funny, shocking, and a feast for the eyes and hearts of Marvel fans. It also has an ending that will boggle your mind and rattle your expectations. It has been a long time since I have enjoyed a blockbuster film this much. It surely isn't a perfect film, but it is an entry in the Marvel Cinematic Universe that will stand tall with the franchise's best. Avengers: Infinity War gets 4 out of 5 stars.","displayName":"Paul F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":true,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T11:40:09.000Z","updateDate":"2018-04-28T11:42:16.000Z","user":{"userId":"973387434","realm":"RT","displayName":"Paul F","accountLink":"/user/id/973387434"},"score":4,"timeFromCreation":"Apr 28, 2018"}]}