{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwNjg4MTYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDJUMDQ6MDk6MDkuMzM1WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNTM2MzQiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDJUMDQ6NTc6NTYifQ=="},"reviews":[{"rating":"STAR_4_5","review":"The perfect movie you've been waitting for.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/485016908581872/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T04:57:56.000Z","updateDate":"2018-05-02T05:01:56.000Z","user":{"userId":"977253634","realm":"RT","displayName":null,"accountLink":"/user/id/977253634"},"score":4.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_4_5","review":"Avengers: Infinity War does a fantastic job at bringing the MCU together and presenting a dark and challenging story, It is clearly still part 1 though.","displayName":"Ralph A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T04:53:45.000Z","updateDate":"2018-05-21T04:48:20.000Z","user":{"userId":"977253628","realm":"RT","displayName":"Ralph A","accountLink":"/user/id/977253628"},"score":4.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_4_5","review":"This is may be one of the only movies I've ever seen to display the struggle of heroes to save the world so accurately while also cleverly displaying what defeat feels like. It even shows us the sorrow and motive of the villain, and that is a very rare find in a movie. The fight choreography, the plot, acting and visuals are all worth noting as to what makes this movie worth watching more than once. The bad cliffhanger and the fact that some of the heroes and villains are not utilized to their full extent and power is why I gave this a 4 and a half star rating. It is a movie that marvel fans will both love and hate, and establishes a good base for the upcoming MCU films.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/2050562298566383/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T04:48:55.000Z","updateDate":"2018-05-02T04:48:57.000Z","user":{"userId":"977106271","realm":"RT","displayName":null,"accountLink":"/user/id/977106271"},"score":4.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_4","review":"Avengers: Infinity War\nInitial Reaction:  A never ending war?\n\nMain Characters (some of them - there's so many)\n\tTony Stark/Iron Man, Star Lord, Thor, Peter Parker/Spider Man: Some of the heroes involved.  They are played by Robert Downey Jr., Chris Pratt, Chris Hemsworth and Tom Holland.\n\tThanos: The big bad guy.  He's played by Josh Brolin.\n\nPlot Summary (with as few spoilers as possible)\n\tThanos is a guy who wants to kill off half of the population because there's only so much resources to go around.  In order to do that, he is collecting six powerful stones called Infinity Stones, each of with gives him power over a concept.  \n\tConcepts like Time, Mind and Soul.  \n\tBut the heroes are teaming up and stepping in to try to stop him from achieving his goals.  The huge group of heroes splits up into smaller groups to take the fight to Thanos on several fronts.\n\nSCORING\nMain Characters\n\tThere's a lot of them in this film, but each one gives it their all.  And it 's nice to see how different heroes interact with each other - and with Thanos.  \n\tAnd Thanos is a great villain - a guy who thinks he's doing everyone a service with his plans.  SCORE: 9\n\nSupporting Cast\n\tNot much here - there's so many heroes that there's little need of a supporting cast.  SCORE: 8\n\nPlot\n\tThis film is a long one because there's so much content in it.  But the scenes are a so enjoyable that I didn't mind the more than two and a half hour run time.  SCORE: 9\n\nOriginality\n\tI understand that there are a lot of us who are tired of superhero films (because that's the films that get almost all the attention).  But Marvel puts a lot of effort into putting character into their characters, and having the action revolve around those characters.  SCORE: 8\n\nViolence Factor\n\tThere's a lot of fighting going on here - including a massive army fight between the heroes and a large army of four legged demonic creatures. Some of these go on for quite a while - sometimes a bit too long for my liking.\n\tBut this is Infinity War - not Infinity Skirmish.  SCORE: 8\n\nOther Moral Issues\n\tOne of the problems I have with this film is that it has something against couples.  But other than that, it does a good job of showing just how so many heroes can work out their differences.  SCORE: 7\n\nFinal Score (out of 60): 49\t\t% Score: 81.67%\n\tThis film is under huge pressure to deliver.  I think it does give exactly what it promises.  Now onto the conclusion that's due out next year.","displayName":"Jason M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T04:44:40.000Z","updateDate":"2018-05-02T04:44:42.000Z","user":{"userId":"900740500","realm":"RT","displayName":"Jason M","accountLink":"/user/id/900740500"},"score":4,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_4_5","review":"Not just anyone can sit down and watch this. I felt bad for my two friends I Took with me who knows nothing about the universe. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T04:41:51.040Z","updateDate":"2018-05-02T04:41:51.040Z","user":{"userId":"941508762","realm":"RT","displayName":null,"accountLink":"/user/id/941508762"},"score":4.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_5","review":"Love the avengers. This movie kicks kicks ass and takes names for sure","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T04:39:21.854Z","updateDate":"2018-05-02T04:39:21.854Z","user":{"userId":"970429906","realm":"RT","displayName":null,"accountLink":"/user/id/970429906"},"score":5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_3_5","review":"Wow! I was not expecting that AT ALL!","displayName":"Duncan W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T04:32:22.000Z","updateDate":"2018-05-02T04:35:20.000Z","user":{"userId":"977253608","realm":"RT","displayName":"Duncan W","accountLink":"/user/id/977253608"},"score":3.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_5","review":"what's an amazing spectacle with twists and turns along the way...","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T04:23:00.685Z","updateDate":"2018-05-02T04:23:00.685Z","user":{"userId":"962430433","realm":"RT","displayName":null,"accountLink":"/user/id/962430433"},"score":5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_4_5","review":"Just returned from the cinemas after catching the all new \"Avengers: Infinity War\" flick! And my oh my this installment was quite intriguing, all personalities and events in the film intertwining seamlessly into one cosmic universe and it was indeed incredible to witness and behold. Thanos as a villain is monstrous and intimidating with menacing disposition amongst an eloquent hyperbolic parlance. I found the mumbo jumbo regarding the nature of the universe rather mystical and quasi-Buddhist with subtle quantum overtones reminiscent of Oxford colleague chatter. The action doesn't disappoint either, with karate warrior-like combat scenes and mesmerizing space expeditionary incursions. The pace of the movie is never boring with plenty of funny comedic lines and dialogue. The integrating of all the characters from differing Marvel universes brought an eclectic vibration of diversity akin to a kind of balancing act of hormonal chemistry within the egocentric network. And good lord are Scarlet Witch and Gamora hot as fsck must I say. The element of realism and CGI prowess doesn't disappoint either.. Worlds and civilizations apart envisioning want of utopian resplendence and splendor. And The Hulk and Iron Man are f-in hilarious as toast rofl, with even each single Marvel character exuding a very vibrant distinct persona and aura in impressions formed. I of course to superlative extreme had fond appreciation for the whimsical substance and way in which the plot intrigue involving the omnipotence granting infinity stones followed through towards all of my five senses! All-in-all this movie was very captivating and entertaining indeed!","displayName":"Eli E","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T04:14:07.000Z","updateDate":"2018-05-02T04:41:46.000Z","user":{"userId":"909862892","realm":"RT","displayName":"Eli E","accountLink":"/user/id/909862892"},"score":4.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_5","review":"This movie was the best Marvel movie in the series. They have had some good ones but WOW! Josh Brolin as Thanos was inspired. Probably the best villain in purple I have ever seen. Somehow he created real emotion out of that ball sack chin. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T04:09:09.335Z","updateDate":"2018-05-02T04:09:09.335Z","user":{"userId":"260068816","realm":"RT","displayName":null,"accountLink":"/user/id/260068816"},"score":5,"timeFromCreation":"May 02, 2018"}]}