{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNDEyMDAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjZUMjI6Mzc6MTEifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Njc2NDEwODEiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjZUMjI6NDg6MTkifQ=="},"reviews":[{"rating":"STAR_5","review":"never have i been in a movie that at the end was so in awh that you could hear a pin drop.... a mulity time screening for me for sure....","displayName":"D.j. L","displayImageUrl":"https://graph.facebook.com/v3.3/621972228/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:48:19.000Z","updateDate":"2018-04-26T22:50:58.000Z","user":{"userId":"967641081","realm":"RT","displayName":"D.j. L","accountLink":"/user/id/967641081"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"Can't wait to see the next one.","displayName":"Lin M","displayImageUrl":"https://graph.facebook.com/v3.3/1116355291749049/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:47:49.000Z","updateDate":"2018-04-26T22:49:37.000Z","user":{"userId":"974325513","realm":"RT","displayName":"Lin M","accountLink":"/user/id/974325513"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_2","review":"2X Better than The Last Jedi - BUT that's not saying much.  The worst of the Marvel Universe. A long +2 hours of monotonous action that feels like it will all be undone in the second act.","displayName":"Dennis P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:46:34.000Z","updateDate":"2018-04-26T22:49:09.000Z","user":{"userId":"932711963","realm":"RT","displayName":"Dennis P","accountLink":"/user/id/932711963"},"score":2,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"I've seen every Marvel movie in theaters since Iron Man 2.  I rolled up to see Avengers: Infinity War tonight in Captain America socks and an Iron Man t-shirt.  I think it's safe to say I'm a fan.  And as I fan, I have to say that Avengers 3 is wish fulfillment at the highest level.  It's everything Marvel promised us 10 years ago.  We finally get to see characters interact that we never have before, and it is so flipping cool!  I almost went the whole movie with a giant smile plastered all over my face.  Thankfully, I didn't.  Months ago, when the first trailer for Infinity War was released, I said to my friends that I want to be horrified the entire movie that some of my favorite characters are going to bite the dust.  I wanted to be so scared that I would have to watch the movie through my fingers.  I think some Marvel god (no, I don't mean Thor) heard my wish, because it came true in full force.  While the movie is still stuffed to the brim with humor, that doesn't it from being the most overwhelming and intense movie Marvel has yet to make.  I said in my review for The Last Jedi that it was shocking.  While I do still believe that The Last Jedi has some truly shocking moments, it has nothing on Avengers: Infinity War.  Somebody needs to call the guys at Miriam-Webster, because I think Marvel just changed the definition of shocking without their permission.  I cannot emphasize enough how completely shocked everybody in my theater was when they stumbled back outside into the real world.  Alright, Infinity War is shocking, but is it good?  As the culmination of 10 years of storytelling, yes it is.  As a movie that can stand on its own, yes but less so.  I am about to turn 20 years old in exactly a month.  When Iron Man came out in 2008, I was about to 10.  I can genuinely say that I have grown up with this movies.  These characters that I've watched evolve for a decade have begun to feel like family.  I know them better than some of my roommates to be honest.  To me, and to millions of fans out there, Infinity War can stand on its own because we know what's come before it.  I really can't speak for first time viewers of the MCU.  It would be like choosing to start with the second to last Harry Potter movie.  You'd probably enjoy the movie, but you'd be doing yourself a great disservice.  Infinity War is less a movie than an event.  It features so many characters that as an audience member you get what I call movie whiplash, the feeling of \"whoa what the hell\" when the movie jumps all over the place.  But movie whiplash is unavoidable in a movie like this.  In order for this film to exist, it has to have it.  Also, shoutout to Whiplash, the underwhelming villain in Iron Man 2.  Speaking of villains, let's talk about Thanos, the big bad to beat all other big bads.  Thanos is not another Marvel villain.  He's not some uninteresting punk who we know is going to be defeated by the time the credits roll.  He's formidable and scary and his thinking is actually explained.  You aren't going to leave the theater (g)rooting for Thanos, but you will at least understand his assbag point-of-view.  I can't believe I just saw Avengers: Infinity War, and I can't believe what I just saw in it.  I've been waiting for this movie for so long that it is hard for me to accept that it's finally here.  But never fear I say to myself, because this is not the end.  Infinity War is the culmination of 10 years of filmmaking, but it's more like the first half of the climax to the first part of the story.  So fear not Marvel fans.  This is only the beginning...","displayName":"Winston B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:46:06.000Z","updateDate":"2018-04-26T23:22:45.000Z","user":{"userId":"955306490","realm":"RT","displayName":"Winston B","accountLink":"/user/id/955306490"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"Infinity War is the greatest cinematic experience ever!!!","displayName":"Christina%20 P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:44:32.000Z","updateDate":"2018-04-26T22:52:52.000Z","user":{"userId":"976407436","realm":"RT","displayName":"Christina%20 P","accountLink":"/user/id/976407436"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"I just finished  watching the movie and I can say it did meet my expectations. The fights, the story telling and even the jokes were on point. Great movie and even more excited after the post credit scene.","displayName":"Machioud S","displayImageUrl":"https://graph.facebook.com/v3.3/100003267666484/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:44:18.000Z","updateDate":"2018-04-26T22:46:57.000Z","user":{"userId":"922960706","realm":"RT","displayName":"Machioud S","accountLink":"/user/id/922960706"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"The impossible just became possible\nWell done Marvel","displayName":"Vicky D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:43:10.000Z","updateDate":"2018-04-26T22:45:05.000Z","user":{"userId":"977241215","realm":"RT","displayName":"Vicky D","accountLink":"/user/id/977241215"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"Throws you through a rollercoaster of emotions with a ending like no other ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:41:01.182Z","updateDate":"2018-04-29T02:56:06.789Z","user":{"userId":"260121301","realm":"RT","displayName":null,"accountLink":"/user/id/260121301"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"This film couldn't be as grandiose on its own merits. It requires the 10 years of backstory film we've joyously consumed. With that in mind, infinity war delivers on all cylinders and like driving passenger in a supercar, doesn't let up. Adrenaline and swooping strides between fear and hope make this an amazing journey with a very satisfying end. Taking it's own stride through the story, it differs from the comics leaving all but the major plot points in tact. I'm still dazed from the rush of seeing it and I'll be going back as fast as possible. Final thoughts: The smartest one in the room is always the magician... looking forward to the next!","displayName":"Ian J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:37:58.000Z","updateDate":"2018-04-26T22:49:57.000Z","user":{"userId":"977241202","realm":"RT","displayName":"Ian J","accountLink":"/user/id/977241202"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"This has to be marvel best film it has action all the way to the ending it had good comedy and was twisted no one knew what was going to happen. Non of the theory's I saw were correct everyone we expected to die didn't die and those we thought weren't  going to die ended up dead. This was truely worth the wait very emotional the best marvel film I have seen.","displayName":"Luis O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:37:11.000Z","updateDate":"2018-04-29T09:53:47.000Z","user":{"userId":"977241200","realm":"RT","displayName":"Luis O","accountLink":"/user/id/977241200"},"score":5,"timeFromCreation":"Apr 26, 2018"}]}