{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MDQzODkzMDMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMzBUMTY6MTk6NTQifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzYwNzY1NDMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMzBUMTY6NDQ6MDIifQ=="},"reviews":[{"rating":"STAR_4_5","review":"Avengers: Infinity War Review: \nAvengers: Infinity War is the newest film in the Marvel Cinematic Universe and it's all the culmination of 10 years of this universe. This film has a giant main cast and balances it very well. The Russo Brothers did a great job directing this (they also directed Captain America: The Winter Soldier and Captain America: Civil War, both very good movies). This movie doesn't follow your traditional three act setup, because this entire film is the third act of this universe. It doesn't take anytime to setup it's characters (because they already have over eighteen other films). The only character that they setup is Thanos, who is the main antagonise in this film. However I struggle to call him a villain. Because his intentions in this movie are (in a way) noble. Of course the way he goes about it is all wrong. But his plan is to save humanity (in his own special way). My only complaints with this movie are two things: my favorite character in this universe is Captain America and they barely gave him anything to do (I know when you have around 40 characters in a movie there not all gonna get a lot of screen time). I hope he has more to do in the sequel next year. And my second complaint is really only half of a complaint: which is the subplot with Thor, Rocket, and Groot; overall that subplot was fine, but when they meet a specific character that's there to help Thor. The story kind of comes to a stop. It's over very quickly, so it's not the biggest complaint (but still one). Overall this film is really good but not perfect (no film is). This a film that I totally recommend but you have to know going in its not your typical movie it's more like an event, a culmination of TEN years the nineteenth film in franchise! So you have to watch those films to get this one (or at least most of them). This film has already become a box office juggernaut, having the biggest box office opening of all time (beating out Star War: The Force Awakens).\n\nAvengers: Infinity War: A","displayName":"Sam B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T16:44:02.000Z","updateDate":"2018-05-21T08:23:53.000Z","user":{"userId":"976076543","realm":"RT","displayName":"Sam B","accountLink":"/user/id/976076543"},"score":4.5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_5","review":"This is a must-see movie. Truly awesome from start to finish. Loved every minute of it.","displayName":"Jak%20 R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T16:40:53.000Z","updateDate":"2018-04-30T16:43:34.000Z","user":{"userId":"976932809","realm":"RT","displayName":"Jak%20 R","accountLink":"/user/id/976932809"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_3","review":"Its a good movie for plebs and bandwagon, but for comic book fan. Its just a average film. Thanos getting nerf like Ultron and Malekith.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1680945985330662/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T16:38:23.000Z","updateDate":"2018-04-30T16:40:17.000Z","user":{"userId":"977251452","realm":"RT","displayName":null,"accountLink":"/user/id/977251452"},"score":3,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_5","review":"Thanos.. I hate you.. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T16:36:22.331Z","updateDate":"2018-04-30T16:36:27.221Z","user":{"userId":"260078045","realm":"RT","displayName":null,"accountLink":"/user/id/260078045"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_5","review":"This movie was absolutely terrific! They did an awesome. Job with all the characters. Thanos was probably the best portrayed Villlain in the MCU so far. Just an awesome movie!","displayName":"Julian C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T16:34:04.000Z","updateDate":"2018-04-30T16:43:28.000Z","user":{"userId":"977251448","realm":"RT","displayName":"Julian C","accountLink":"/user/id/977251448"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_4","review":"Going in to this movie, I was worried that the screenwriters would not be able to balance the character arcs and characters. Boy, did they prove me wrong.\nI liked nearly everything about this movie. First, they balanced the characters and plotlines to near perfection. There was one character arc that could have been handled better, but other than that, they did it perfectly. I can not congratulate the screenwriters enough for organically balancing the characters so well. This is a task that very few people can do, so it was great to see it done (almost) perfectly. That being said, the tone is a different story. When you switch between comedic characters and serious characters, the tone can get distracting and confusing. The opening scene is tragic and intense, and then it cuts to Tony and Pepper talking in a park and it was comedic, and that was annoying. Not that they really had a choice. There was also one plotline that was focused on for way too long.\nThose are about the only bad things I can say about the movie. The CGI was on point. There wasn't a single shot where the special effects were even remotely unconvincing. The acting was great all around, with standout performances from Chris Pratt, Tom Holland, Chris Hemsworth, Zoe Saldana, and of course Josh Brolin. Thanos was a villain that the MCU has lacked for years. He was motivated and intimidating to the point where I wanted to jump into the movie and tell the heroes to give up. He was established as such a powerful villain that it felt futile to even fight him. The humor was also great. I laughed a lot during the film, especially during sequences with the Guardians of the Galaxy. While the humor did often rely on knowledge of previous MCU films, there was enough that didn't to make it a funny experience to any viewer. Another thing this film does that recent MCU entries haven't is feel like it has stakes. While in most other MCU movies the tension of the action sequences isn't present, this film really felt like there were consequences to the actions. A lot of that is a result of the opening sequence. It sets up the villain so well and resonates through the rest of the movie. I got chills when the movie opened. A lot of that is also due to the way certain characters are set up in this movie. Despite having so many characters to balance,  there was character development that made you care about these characters even if you didn't before.\nOverall, Infinity War worked in nearly every way. The humor, CGI, and stakes were all well established and exceptionally done. The tone shifts around a lot, but the characters are balances very well. This one is definitely worth seeing, Marvel fan or otherwise.","displayName":"Reece L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T16:32:41.000Z","updateDate":"2018-04-30T16:48:44.000Z","user":{"userId":"976531864","realm":"RT","displayName":"Reece L","accountLink":"/user/id/976531864"},"score":4,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_5","review":"Awesome! Marvel manages the impossible task to juggle a huge cast and gives everyone a moment to shine. Some next level stuff, can`t wait to see what is next.","displayName":"Rune Y","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T16:31:17.000Z","updateDate":"2018-04-30T16:36:51.000Z","user":{"userId":"977251432","realm":"RT","displayName":"Rune Y","accountLink":"/user/id/977251432"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_3_5","review":"This movie is just kind of all over the place. So many talented actors and storylines converge into a just “uh” experience. Didn’t understand the lack of action in an action film. Worth seeing but keep expectations low. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T16:30:11.215Z","updateDate":"2018-04-30T16:30:11.215Z","user":{"userId":"942307794","realm":"RT","displayName":null,"accountLink":"/user/id/942307794"},"score":3.5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_5","review":"Love this movie. Simple amazing!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T16:28:11.584Z","updateDate":"2018-04-30T16:28:11.584Z","user":{"userId":"963567913","realm":"RT","displayName":null,"accountLink":"/user/id/963567913"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_4","review":"Wow. It's too long. At the end of the movie, went to the bathroom, waited in line, went back into the theater and caught the post credits scene at the very end. A good movie, but  way too long for me. Pulls multiple story lines together into one movie, that's tough to do. I wonder how this will all get resolved into the next Avengers movie. The ending was a big downer, still worth seeing if you've seen all the other Marvel movies. If you're a casual fan, this may be a bit confusing. Maybe Marvel could have shortened it by a half hour and come out with the Avengers 4 sooner?","displayName":"Ethan L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T16:19:54.000Z","updateDate":"2018-04-30T16:24:31.000Z","user":{"userId":"904389303","realm":"RT","displayName":"Ethan L","accountLink":"/user/id/904389303"},"score":4,"timeFromCreation":"Apr 30, 2018"}]}