{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcwNDIxMTYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDJUMjA6MDU6NDEifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MTU2MDIzNjIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDJUMjE6MDA6MzYifQ=="},"reviews":[{"rating":"STAR_3_5","review":"Marvel will make a lot of movies, but the more immature characters will be. It's proved by IW. Plus, this movie will not present you goosebumps like BP.","displayName":"Fadillah P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T21:00:36.000Z","updateDate":"2018-05-02T21:07:41.000Z","user":{"userId":"915602362","realm":"RT","displayName":"Fadillah P","accountLink":"/user/id/915602362"},"score":3.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_2_5","review":"Too many plot holes, CGI mistakes, broken story line, no proper epic introduction of Thanos. Too much focus on Guardian's of the Galaxy, not given much screen time to some of the major characters. Why most of the avengers were broken up, not one time where they fought him at ones. Let's break it down character by character as much as I can...... Thor, why did you make it seem like he doesn't need a hammer in Thor Ragnorak, then all of the sudden he spends most of his time looking for a hammer. Guardians of the galaxy, how is star lord a human with a damn gun going hand to hand with Thanos. Spider man, how did he get beaten by star lord? Where was his spider senses? So many questions about him. Iron man, how did get his ass whipped by Hulk in the Hulkbuster, but he turned into an iron Jet Li vs. Thanos?. Hulk, why was he even in the movie? Literally 20 seconds fight with Thanos....is that it?! Captain America, he got no screen time! A major character that should have given more time. Also, how did he handle Thanos, he is a superhuman not superman! How did survive a punch from a 6 stones Thanos? Black panther, they did him some justice, but he should have gotten more screen time. Doctor strange, was amazing favorite character in this movie. Thanos, let's talk about Thanos! Why does he want to cut half of the population? Didn't really go in details. Why was he emotional? He is a savage not a punk, he is a character that destroyed captain america through his shield with one hit! Common. \n\nOn the other hand, too much humor in the middle of the freaking end of the world, like a villain is about to destroy half of the universe and there's still funny moments! Like why?!?\n\nOverall, this movie wouldnt compete with Civil war, it had better story and great personality. This only competes with justice league which was a huge disappointment!","displayName":"Ahmed A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T20:53:01.000Z","updateDate":"2018-05-02T21:24:44.000Z","user":{"userId":"950028171","realm":"RT","displayName":"Ahmed A","accountLink":"/user/id/950028171"},"score":2.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_0_5","review":"This was the worst Marvel movie ever, poorly written and directed. Was not sure if I was watching the Notebook love story or a superhero film and that's a problem. The Hulk was totally emasculated and all they had to do was cut off the arm of Thanos but Marvel decided the Avengers were too stupid to figure that out so they all took turns getting their butts kicked from start to finish. Then most of them died because Thanos won. Really Marvel has taken their fans for granted! We will make a crappy movie and they will still come because it's the Avengers. They should change the name to The Biggest Losers. What a joke of a film. Marvel has to do better.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/182238969259030/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T20:50:06.000Z","updateDate":"2018-05-02T20:56:33.000Z","user":{"userId":"977254522","realm":"RT","displayName":null,"accountLink":"/user/id/977254522"},"score":0.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_0_5","review":"I haven't even seen it","displayName":"Yosvel M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T20:40:28.000Z","updateDate":"2018-05-02T20:41:29.000Z","user":{"userId":"977254514","realm":"RT","displayName":"Yosvel M","accountLink":"/user/id/977254514"},"score":0.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_5","review":"You won't be disappointed, an epic movie!","displayName":"Patrick K","displayImageUrl":"https://graph.facebook.com/v3.3/100000634881078/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T20:36:04.000Z","updateDate":"2018-05-02T20:36:40.000Z","user":{"userId":"897952026","realm":"RT","displayName":"Patrick K","accountLink":"/user/id/897952026"},"score":5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_4_5","review":"A villain that delivers and a director that managed to balance a massive cast, the films pacing, and the action ensured that, against all odds, marvel stuck the landing.","displayName":"Chris G","displayImageUrl":"https://graph.facebook.com/v3.3/1290073294/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T20:20:45.000Z","updateDate":"2018-05-02T21:31:55.000Z","user":{"userId":"895611648","realm":"RT","displayName":"Chris G","accountLink":"/user/id/895611648"},"score":4.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_5","review":"I watched the movie, and it was great, this is the greatest Marvel's movie ever, especially the ambiguous ending, made the audience wondering the second part. Congrats Marvel!","displayName":"Adhitya D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T20:18:58.000Z","updateDate":"2018-05-02T20:23:20.000Z","user":{"userId":"977254504","realm":"RT","displayName":"Adhitya D","accountLink":"/user/id/977254504"},"score":5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_4_5","review":"Great action, great CGI...all that you expect from any blockbuster tentpole anymore.  *yawn*\n\nLikeable characters that play well off each other, a with an ensemble given the proper time to be given their moment in the sun, and who, for the most part, seem to truly embrace their characters.  Well, that is what separates Marvel from some other franchises so far.  But, it helps a lot.\n\nBut, plot?  A captivating and interesting story?  That is rare.\n\nThat...well, Marvel has done well with that traditionally, but has been hit or miss as of late.\n\nI didn't really enjoy Civil War.  But, loved Guardians.  Didn't really like Guardians 2, but loved Ant Man.  Really wanted to see Black Panther, but couldn't make it to the theaters.\n\nWell, the murmurs hit the street, this movie is great.\n\nWell...it is.  And, the big brass cajones of the screenmaker to end it the way they did, and to treat the villian with the care and depth he deserved.\n\nThat's all I can say without getting into spoilers.\n\nBut, kudos Marvel.  You knocked it out of the park with this one!\n\n(also, after this, now I really REALLY want to see Black Panther!)","displayName":"Dan E","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T20:13:52.000Z","updateDate":"2018-05-02T20:18:42.000Z","user":{"userId":"976464358","realm":"RT","displayName":"Dan E","accountLink":"/user/id/976464358"},"score":4.5,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_3","review":"great action. great villain. drama, yes and about time. I just feel cheated. everything that happens in this movie will be undone in the next.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T20:07:04.675Z","updateDate":"2018-05-02T20:07:04.675Z","user":{"userId":"972358254","realm":"RT","displayName":null,"accountLink":"/user/id/972358254"},"score":3,"timeFromCreation":"May 02, 2018"},{"rating":"STAR_3_5","review":"All your favorite Marvel superheroes have to save the universe again but this time the bad guy is the ultimate final boss.\n\nWhat I liked\nAll the characters get their screen time.\nThe character interactions with each other are nice.\nThey did an excellent job bringing them all together and it doesn't feel forced.\nThanos' CGI is the best I've ever seen in any movie.\nBest villain in a superhero movie I've ever seen.\nThanos is not a one-dimensional villain.\nEbony Maw is so good he could have been the main villain.\nThe whole experience is like being on a rollercoaster ride. \n\nNitpicks \nStar Lord never goes to Earth.\n\"Get this man a shield\" was a great line followed by a big disappointment. \nEbony Maw gets a cheap and early death.\nBlack Widow is somehow able to stand toe to toe with the Proxima Midnight.\nThe Hulkbuster appears in Wakanda with no explanation.\nFloating Banner head in the  Hulkbuster suit due to bad CGI.\nWhy isn't Wakanda using all their helicopters and rhinos we saw in Black Panther?\nWhy doesn't Wakanda focus all their might on that small choke point opening instead of letting all the aliens get in and run wild?\nThor can hold the door open for a neutron star while all his clothes didn't burn right off.\nThor saved the Asgardiasns from Hela for nothing. \nThanos turns Drax and Mantis into jelly but he never uses this trick again. \nEventually the universe is going to re-populate and Thanos will have to snap his fingers again. \nWhy doesn't Thanos make more food and resources? \nThe truth is, no matter what Thanos decides do, it will always be a short term solution to an infinite problem. \nGamora wants to avoid Thanos because she has a secret, so she does the exact opposite and voluntarily joins the team that goes to where Thanos will be. \nIn fact, why don't the Guardians just avoid Thanos all together?\nGamora would rather save her sister than half the universe. \nWhat did Gamora think was going to happen when they got to Volmir? Why take the gamble?\nThanos' love for Gamora is so unconvincing even Gamora doesn't buy it.\nIf Gamora knows for sure he'll never stop until he gets the stones, why doesn't she just kill herself now and make sure that never happens?\nHeimdall can see the souls and lives of every living person in all the realms but doesn't see the attack coming.\nHeimdall can summon the Bifrost, and Loki has the Tesseract, but they don't use these abilities to evacuate the ship.\nWhy doesn't Strange create another time loop to keep Thanos at bay?\nWhy doesn't strange freeze time and pull the gauntlet off Thanos' hand?\nWhat's stopping Thanos from using the time stone to see all possible outcomes?\nThey could have killed Thanos while Mantis had him paralyzed. \nWhen they're trying to get the gauntlet off his hand, why is Nebula just standing there doing nothing?\nThe mind stone could have been destroyed when Thanos lent it out to Loki to conquer Earth.\nWhere's Mistress Death?","displayName":"Nitpicker .","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-02T20:05:41.000Z","updateDate":"2018-05-03T06:42:22.000Z","user":{"userId":"977042116","realm":"RT","displayName":"Nitpicker .","accountLink":"/user/id/977042116"},"score":3.5,"timeFromCreation":"May 02, 2018"}]}