{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzc3MjAxOTEiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMDEtMDlUMDc6MjU6NDkifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84MTM1ODU1OTAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMDEtMTFUMTY6NTg6MzQifQ=="},"reviews":[{"rating":"STAR_4_5","review":"Avengers: Infinity War\n(2018)\n\nPlot:\nAn unprecedented cinematic journey ten years in the making and spanning the entire Marvel Cinematic Universe, Marvel Studios' Avengers: Infinity War brings to the screen the ultimate, deadliest showdown of all time. The Avengers and their Super Hero allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos.\n\nReview:\nThis is definitely the best film of 2018! After watching it 4 times, and still seeing new elements to the complex storyline, I can honestly say that this is the best Marvel movie to date, and I can't wait to see Avengers: Endgame later this year. The action scenes, especially towards the end, are amazing and the magnificent cast all put in great performances. Although the superheroes were under so much pressure to stop the evil Thanos, I still found the witty scenes quite funny, and the CGI was totally on point. The emotional ending, and touching Gamora storyline was a great addition to this spectacular film, which has left the public questioning what will happen next. The director did a good job by not making the plot overcomplicated, even though most of the Marvel Universe were involved, but I would have liked to have seen the Hulk, who was brilliant in Ragnarok. Anyway, this movie sees the evil Thanos, killing everyone who gets in his way to get the 6 Infinity stones, which will give him the ultimate power to bring balance to the Universe. He believes that the universe will soon collapse because of the overpopulation of the intelligent species. He in his insane way had developed a possible solution to this problem: reduce the population by half so that the existing pressure on the resources will automatically reduce. He doesn't strive to eliminate the life form, rather he aims for wiping half of them randomly so that he can create a balance between intelligent life form and resources. To achieve his goal he needs 6 stones in his gauntlet, which include the Space stone, held by Loki, the Mind Stone, which is in Vision, the Reality Stone, which was given to the collector, The Power Stone, which is on Xander with the Nova Corp, The Time Stone which is held by Dr. Strange and the Soul Stone which is in Vormir held by the Red Skull. The superheroes from the Marvel Universe gather to stop Thanos causing mass destruction, but the more stones he gathers is the more power he gains. That's a quick rundown of the storyline, but believe me, it's very complex. When the superheroes gather in Wakanda to stop Thanos from getting the final stone, which is the Mind Stone, the epic final battle ends in disaster, which is why fans are speculating about the outcome. I must admit, when I first watched the movie in the cinema, the ending baffled me, but after talking to a few die-hard fans, I knew that all was not what it seems. With that aside, the directors have kept the next instalment close to there chest, so anything can happen. I just hope that it's in the same class as this movie because it's hard to find a fault with it. They even toned down Spider-Man, who did get on my nerves in his standalone movie, and they gave everyone an equal amount of screen time, even though there were big names in the cast. Anyway, I think you can tell that I thought this movie was great, and I can see myself watching it many more times. Great!\n\nRound-Up:\nThis movie was directed by Anthony & Joe Russo, who also brought you Welcome To Collinwood starring George Clooney, You, Me and Dupree, Captain America: The Winter Soldier and Captain America: Civil War. They are currently making Avengers: Endgame, so it's good to see that the directors of this movie are returning for the final instalment. If it wasn't for the Captain America movies, they would have been my last choice for this film, but boy didn't they do a good job. At this precise moment, this movie is number 4 in the highest-grossing movies of all time list, but they still have time to take over Star Wars: The Force Awakens, which is in 3rd place. I still can't believe that Avatar and Titanic are still at the top of the list, after so many years. Anyway, Josh Brolin was perfect for Thanos. His facial expressions and deep voice made his character intense, which the role needed. I was a bit sceptical when I heard that the Guardians were going to be involved with, mainly because I thought their comedic personalities would have taken away the intensity of the situation but they also fit in perfectly. The wit that Taika Waititi brought to Thor, was carried into this film, even though he was battered at the beginning, so the directors have obviously been listening to the fans. Bring on the final chapter!\n\nBudget: $400million\nWorldwide Gross: $2.50Billion (WOW!)\n\nGenre: Action, Adventure, Fantasy, Sci-Fi\nCast: Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Don Cheadle, Benedict Cumberbatch, Tom Holland, Chadwick Boseman, Zoe Saldana, Karen Gillan, Tom Hiddleston, Paul Bettany, Elizabeth Olsen, Anthony Mackie, Sebastian Stan, Idris Elba, Danai Gurira, Peter Dinklage, Benedict Wong, Dave Bautista, Vin Diesel, Bradley Cooper, Gwyneth Paltrow, Benicio Del Toro, Josh Brolin, Chris Pratt, William Hurt and Stan Lee. 9/10\n\nPlease check out my Movie Review blog at leonblackwood.wordpress.com","displayName":"Leon B","displayImageUrl":"https://graph.facebook.com/v3.3/543725801/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-01-11T16:58:34.000Z","updateDate":"2019-01-11T16:59:44.000Z","user":{"userId":"813585590","realm":"RT","displayName":"Leon B","accountLink":"/user/id/813585590"},"score":4.5,"timeFromCreation":"Jan 11, 2019"},{"rating":"STAR_5","review":"One of the best movie in my list.","displayName":"Vedesh P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-01-11T07:26:31.000Z","updateDate":"2019-01-11T07:27:21.000Z","user":{"userId":"977723832","realm":"RT","displayName":"Vedesh P","accountLink":"/user/id/977723832"},"score":5,"timeFromCreation":"Jan 11, 2019"},{"rating":"STAR_2","review":"I found his a boring movie and was disappointed by the movie itself","displayName":"Kyle S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-01-11T04:18:05.000Z","updateDate":"2019-01-11T04:19:47.000Z","user":{"userId":"977723607","realm":"RT","displayName":"Kyle S","accountLink":"/user/id/977723607"},"score":2,"timeFromCreation":"Jan 11, 2019"},{"rating":"STAR_5","review":"This movie is what the entire MCU has been building up to, and it does not disappoint. The story balances it's huge cast extremely well. While every hero gets screen time (rip Hawkeye), the focus is only on a few groups. Namely, the Guardians and Thor, The New York trio (Iron Man, Spidey, and Dr. Strange), and Vision and Scarlet Witch. But the main focus of the Movie is on the big guy himself, Thanos (also Gamora), which is exactly where it should be in a movie like this.","displayName":"Corwin S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-01-10T03:23:08.000Z","updateDate":"2019-01-10T03:31:20.000Z","user":{"userId":"976783119","realm":"RT","displayName":"Corwin S","accountLink":"/user/id/976783119"},"score":5,"timeFromCreation":"Jan 10, 2019"},{"rating":"STAR_0_5","review":"Most over-hyped nothing burger since Force Awakens. \n\nSpoilers follow:\n\nHuge purple guy with no powers somehow takes all the infinity stones without one single stone being used against him and kills all life in the universe, but because Tony Stark kicks his ass a little, he decides to spare half the population of earth. \n\nThe writers of this rubbish should hand in their keyboards. I could go on and on. This movie fails on so many levels it's scary, and it makes me sick that both critics and the general audience didn't see it. Yes the special effects were cool. But the dialogue was like listening to a failed comedian talk to himself. All the characters tried to be funnier than the last speaker--over and over.\n\nThis movie was awful. Good riddance Avengers. It's an attempt to justify killing half the population of earth because some big purple asshole thinks there are too many people for the resources--which is a lie.","displayName":"First L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-01-10T02:36:30.000Z","updateDate":"2019-01-10T02:41:48.000Z","user":{"userId":"900600063","realm":"RT","displayName":"First L","accountLink":"/user/id/900600063"},"score":0.5,"timeFromCreation":"Jan 10, 2019"},{"rating":"STAR_5","review":"One of the best, if not the best marvel movie. The plot is interesting, the caracters are awesome and all around the best movie of 2018!! Cant wait for Endgame!!","displayName":"Joakim O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-01-09T23:41:42.000Z","updateDate":"2019-01-09T23:43:20.000Z","user":{"userId":"977665552","realm":"RT","displayName":"Joakim O","accountLink":"/user/id/977665552"},"score":5,"timeFromCreation":"Jan 09, 2019"},{"rating":"STAR_5","review":"The biggest crossover in film history lives up to the hype and delivers on all notes with its 2 hour 40 minutes run time.","displayName":"Kieran W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-01-09T15:05:22.000Z","updateDate":"2019-01-09T15:06:50.000Z","user":{"userId":"977720688","realm":"RT","displayName":"Kieran W","accountLink":"/user/id/977720688"},"score":5,"timeFromCreation":"Jan 09, 2019"},{"rating":"STAR_4","review":"Couldn't follow the story that well, also I cried like 3 times so -1 star. The effects were really great tho!","displayName":"Kai F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-01-09T11:19:21.000Z","updateDate":"2019-01-09T11:20:08.000Z","user":{"userId":"977720475","realm":"RT","displayName":"Kai F","accountLink":"/user/id/977720475"},"score":4,"timeFromCreation":"Jan 09, 2019"},{"rating":"STAR_5","review":"I don't like giving 5 STARS but damn... \n\nJust damn.","displayName":"Aaron C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-01-09T09:03:17.000Z","updateDate":"2019-01-09T09:03:55.000Z","user":{"userId":"977720267","realm":"RT","displayName":"Aaron C","accountLink":"/user/id/977720267"},"score":5,"timeFromCreation":"Jan 09, 2019"},{"rating":"STAR_5","review":"Thank u Rusosï¿ 1/2(TM)ï¿ 1/2Â? 3/4ï¿ 1/2(TM)ï¿ 1/2Â? 3/4ï¿ 1/2(TM)ï¿ 1/2Â? 3/4","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10217943960461246/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-01-09T07:25:49.000Z","updateDate":"2019-01-09T07:26:24.000Z","user":{"userId":"977720191","realm":"RT","displayName":null,"accountLink":"/user/id/977720191"},"score":5,"timeFromCreation":"Jan 09, 2019"}]}