{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNzQwNzUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMThUMjA6NTE6NDgifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NTA1NzY0MDMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMTlUMDE6Mzc6MzkifQ=="},"reviews":[{"rating":"STAR_4_5","review":"The ratings from the audience say it all.  F the critics. The interchanges between Doctor Strange and Tony Stark are worth 4.5 stars by themselves.  Spider-Man was excellently portrayed (though I cannot remember the actors name as there have been so many).  His final scene was excellent.  Chris Hemsworth's Thor was a perfect balance between humor and 'seriousness'.  Thanos was a villain whose goal you might sympathize with but whose methods you would probably deplore.  The battle within Wakanda was superb and I 'walked' away from the event fully satisfied.  I cannot wait until May of 2019 but I have no choice","displayName":"Darryl J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-19T01:37:39.000Z","updateDate":"2018-05-19T01:44:31.000Z","user":{"userId":"950576403","realm":"RT","displayName":"Darryl J","accountLink":"/user/id/950576403"},"score":4.5,"timeFromCreation":"May 19, 2018"},{"rating":"STAR_5","review":"It's my favourite avengers movie","displayName":"Bobby N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-19T01:20:19.000Z","updateDate":"2018-05-19T01:20:44.000Z","user":{"userId":"977275850","realm":"RT","displayName":"Bobby N","accountLink":"/user/id/977275850"},"score":5,"timeFromCreation":"May 19, 2018"},{"rating":"STAR_5","review":"Let's not kid ourselves. Since this project's conception, everyone's initial & primary fear was if & how the Russo brothers would be able to incorporate all these superheroes into a single film. How would all these characters be handled in a cohesively structural way, both narrative-wise & screen-time-wise in order for the flow of the film to still feel organically soothing? \"Avengers: Infinity War\" has unquestionably the biggest ensemble of superhero characters ever seen side by side on the silver screen, making the duty of balancing them all together in a comprehensible manner more of a feat than a task.\n\nTherefore, the Russos had an unprecedented & almost impossible job ahead of them. Even before having to worry about the strength of their narrative, they had to climb a mountain just to keep the film from falling apart due to character overcrowdness. The Russo brothers knew this to be the case, so how did they figure this problem out? With the addition of all these superheroes, how did they solve this impractical equation? They simply, but effectively, removed all variables from said equation. By thinking outside the box, the Russos removed the spotlight from all the superheroes & instead chose to cast it directly at the film's villain, Thanos. By handling the mantle of protagonist to the antagonist, the Russo brothers had then the appropriate time & required breathing room to implement & revolve their many superheroes around the villain. Thus, Thanos takes center stage in the film & the story unravels primarily around him & through his own eyes.\n\nBy following this route, the Russos eliminated the probability of a single or a group of superheroes shining more than others. No superhero seems to eclipse one another, because no superhero is a supporting character to a protagonist superhero. The only mild, noticeable exception is Thor's story arc, about which we'll talk later on. In general though, all superheroes are supporting characters to the protagonist villain. All superheroes work together in their secondary roles &, while they do shine in their own way, they never outshine Thanos. Everything & everyone in this film revolves around or ultimately compliments the villain in one way or another.\n\nHowever, the decision to make Thanos the central figure of the film raised a new challenge for the Russo brothers. If the villain is to be the protagonist of the story then the caliber of the film rests predominantly on the shoulders of said villain. In other words, Thanos had to be an intimidating & powerful character for the film to have been any good. The film couldn't be deemed successful if Thanos was lacking, hence Thanos' & the film's fates were co-dependent.\n\nDuring the film's marketing campaign period & specifically during an interview that took place last January, the Russos went as far as to compare Thanos to Star Wars' iconic villain, Darth Vader. However strong a story or a character may be, when someone compares anything to Star Wars, the project or subject in question tends to fall flat on its head. As an avid Star Wars fan myself, I immediately felt a level of uneasiness upon reading said article. I vividly remember thinking: \"Russos, I love you guys but for the love of God, don't chew more than you can handle.\" Comparing Thanos to Darth Vader is in my opinion one of the boldest moves the Russo brothers have ever made because at that very moment I knew that if they didn't end up delivering what they promised, they would get heavily criticized & even laughed at.\n\nWhat many people may not completely understand or really comprehend is that when the original Star Wars trilogy was first being released, people were genuinely afraid of Darth Vader & were legitimately worrying for their heroes' lives. Every time a beloved character appeared on-screen alongside Darth Vader, people would fear for said character's fate. During these last decades, many villains have graced our silver screens but none of them carried that element of utter terror with them in that magnitude. I can say with certainty that the only other time I remember experiencing a similar feeling while watching a villain in any medium (except \"Star Wars\") was while watching \"The Terminator\" & \"Terminator 2: Judgment Day\" for the very first time. As far as I remember (& have watched), no other film has done it.\n\nThat goes to show you how rare said feeling really is. Darth Vader had a certain aura surrounding him wherever he walked, & for the Russo brothers to even claim to have successfully replicated it felt like a stretching, doubtful & conceited statement. Fast-forward 5 months after that article, a month after the release of \"Avengers: Infinity War\" & 2 personal viewings of said film & I have to say, I've never felt happier & more grateful to admit that I was completely wrong. The Russos have knocked it out of the park. During that 1st viewing, every scene that Thanos inhabited I kept holding my breath, preparing for the imminent fall of superheroes that have been keeping me company for years, some of them for even over a decade. The Russo brothers absolutely crashed it by delivering exactly what they promised.\n\nThe Russos advertised a villain as monstrous, imposing & ruthless as Darth Vader & they certainly delivered. Moreover, the previously discussed decision to make Thanos the protagonist of this story has gifted them the opportunity & screen-time to flesh out his character. From the film's opening scene it's established that Thanos isn't a villain to be trifled with. He is here & he means business. The film's 3 acts play around with how us viewers think & feel about Thanos.\n\nFear is what settles in everyone's heart during the film's 1st act, even from the opening scene. A fear which gets amplified with the Black Order's arrival on Earth. The 2nd act of the film serves as a Thanos humanization tool. We get a closer look at Thanos' past & delve deeper into his mindset & psyche which makes us viewers sympathize, understand & even go as far as justify his way of thinking & reasoning for his actions. All of these are swiftly overturned & ultimately come crumbling down with the execution of the film's 3rd act, where fear & sympathy are completely negated & forgotten to give way to pure hatred.\n\nFear, sympathy & hatred accommodate Thanos, hence successfully creating an exceptional multi-layered character. A smiling Thanos ends up dropping the film's curtain, knowing he has taken small pieces of our soul & has crashed them to dust. An execution that leaves us in disarray, asking questions, asking for more footage, for explanations, for answers, for retribution, for blood, for a need to be avenged, for May 2019 to arrive right now, for the release of Avengers 4.\n\nI could end the review here but I would like to address some minor gripes that in no way, shape or form lessen my personal rating. Given the fact that so many factors are in play, the pace of the film is exceptionally well done & phenomenally well put together. After a couple of viewings, the film's only element that feels dragging is Thor's subplot. In comparison to all the other superheroes' subplots, Thor's takes unnecessarily too much screen-time & because all the rest subplots do move on, Thor's ends up feeling like an abnormal one in this otherwise perfectly structured film. One other minor complain is the handling of the Black Order's adaptation. They should have been more powerful, should have more screen time & not be as easily defeated but as the Russo brothers explained, this was done as such in order to further highlight Thanos' strength & importance. The last noteworthy issue is not exactly a weakness of the film, but it's instead a feeling that was being developed while watching it. Everyone knew the story beforehand, even more so if they are comic-book fans. So more or less, we all knew how it would go down. Thanos would be gathering all 6 Infinity Stones. So, because I was expecting certain things to be done, that knowledge gave birth to a sense of a checklist or a to-do-list completion feeling, rather than watching the unfolding of an original story. Of course as I said, these are only minor issues, I just felt like addressing them to make this review as complete as possible without spoiling the film.\n\nThe only truly negative aspect of this film is that it marks the Russos' penultimate collaboration with the MCU (Marvel Cinematic Universe). \"Avengers: Infinity War\" is without question one of the best comic-book films ever created (at least so far) & is worth dozens, nay hundreds of iterative viewings. The Russo brothers have created something exceptional which will stand the test of time & will more importantly be a point of reference for what future superhero team-up films should keep in mind if they want to be successful.\n\n(Updated from 26/04/2018)","displayName":"Giorgos K","displayImageUrl":"https://graph.facebook.com/v3.3/100000845716701/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-19T01:16:10.000Z","updateDate":"2018-05-30T01:37:01.000Z","user":{"userId":"903259299","realm":"RT","displayName":"Giorgos K","accountLink":"/user/id/903259299"},"score":5,"timeFromCreation":"May 19, 2018"},{"rating":"STAR_5","review":"this movie was.awsome ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-19T00:51:02.423Z","updateDate":"2018-05-19T00:51:02.423Z","user":{"userId":"260134354","realm":"RT","displayName":null,"accountLink":"/user/id/260134354"},"score":5,"timeFromCreation":"May 19, 2018"},{"rating":"STAR_4_5","review":"While the ending was easy to predict and we know it's not permanent, because you know comic books, it was still a great time.  One of my favorite Marvel movies.  WAY WAY better then Ultron....of course that is a low bar to over come.","displayName":"Dean B","displayImageUrl":"https://graph.facebook.com/v3.3/100001392511537/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-18T22:12:05.000Z","updateDate":"2018-05-18T22:13:21.000Z","user":{"userId":"925751454","realm":"RT","displayName":"Dean B","accountLink":"/user/id/925751454"},"score":4.5,"timeFromCreation":"May 18, 2018"},{"rating":"STAR_5","review":"Really good movie, best one yet","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-18T21:41:13.468Z","updateDate":"2018-05-18T21:41:13.468Z","user":{"userId":"919079929","realm":"RT","displayName":null,"accountLink":"/user/id/919079929"},"score":5,"timeFromCreation":"May 18, 2018"},{"rating":"STAR_5","review":"Flawless and amazing!","displayName":"Armydude V","displayImageUrl":"https://graph.facebook.com/v3.3/100002281194471/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-18T21:02:20.000Z","updateDate":"2018-05-18T21:02:42.000Z","user":{"userId":"959815048","realm":"RT","displayName":"Armydude V","accountLink":"/user/id/959815048"},"score":5,"timeFromCreation":"May 18, 2018"},{"rating":"STAR_5","review":"Outstanding film. Best Marvel movie yet. So much of my wish list for this movie came to be. The Russo brothers are too good.","displayName":"Dok S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-18T21:00:12.000Z","updateDate":"2018-05-18T21:00:43.000Z","user":{"userId":"977275557","realm":"RT","displayName":"Dok S","accountLink":"/user/id/977275557"},"score":5,"timeFromCreation":"May 18, 2018"},{"rating":"STAR_5","review":"To bad Captain and Iron Man did not share a scene in the movie. Well planned and will definitely go and watch this movie again. To bad I won’t see another Stand Alone Iron Man or Captain America but this movie is worth the hype and wait","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-18T20:52:16.961Z","updateDate":"2018-05-18T20:52:16.961Z","user":{"userId":"907238391","realm":"RT","displayName":null,"accountLink":"/user/id/907238391"},"score":5,"timeFromCreation":"May 18, 2018"},{"rating":"STAR_5","review":"Fantastic example of a Disney company doing it right. Lucasfilm could learn from this team.","displayName":"Peter I","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-18T20:51:48.000Z","updateDate":"2018-05-18T20:52:37.000Z","user":{"userId":"977274075","realm":"RT","displayName":"Peter I","accountLink":"/user/id/977274075"},"score":5,"timeFromCreation":"May 18, 2018"}]}