{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MTYwNjY2MjUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMDg6Mzk6MjcifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84NzcyNjQyMzEiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMDg6NTE6MzMifQ=="},"reviews":[{"rating":"STAR_4_5","review":"This is going to be rather brief because it's difficult to discuss the film without spoiling anything.  That said, oftentimes there's a pivotal moment or a reveal that drives a film's viewership based solely on hype and fervor.  In such films, once the initial shock dissipates, there's little left to warrant rewatching, but it does encourage patrons to flood the box officer earlier than later. I suspect the studio push admonishing early moviegoers to avoid spoilers and inciting the hashtag movement, \"thanosdemandsyoursilence\", was likely a calculated tool to drive the hype. Infinity War, while having such pivotal moments, will probably stand as one of the better Marvel Studios films regardless of the hype. \n\nThe ensemble has matured together, and the on-screen chemistry is palpable. It's a blockbuster film that lends well to being seen in large-format or IMAX screenings.  The sound mix is also one of the better mixes from Marvel Studios in that despite heavy use of low frequency effects and steady starship droning, the dialogue was crisp and clear.  A friend of mine commented that the sound was fuller than other Marvel films and in many ways felt more like a Star Wars mix.  I can't disagree with that.  While there are jarring explosions and shrill screaming of streaking shrapnel and debris, the soundtrack was balanced with low rumbling, almost brooding, undercurrents.  Of course all of this was highlighted and even carried by Alan Silvestri's score.\n\nThere were a few minor editing missteps, but I feel they were done in the interest of time and pacing.  Despite this, I didn't notice continuity problems.  Given the various converging story lines in addition to the myriad of Hollywood headliners who all need their respective screen time, the Russo brothers held this together quite well.  In the wrong hands this easily could have become a theatrical Batman v Superman mess.\n\nIf you've read the 1990's Infinity Gauntlet comic story arc, you already have a good idea as to what's going to happen.  Even so, I encourage you to keep this information to yourself in order to avoid ruining it for those that did not read the comics. There is an element of elitism among some comic readers in that some of them disparage those whose only knowledge base of these characters is solely gleaned from the films.  I can also tell you, as a comic reader, you don't know everything that happens or even how it transpires.  The film adaptation in many ways is only loosely based on the comic.\n\nHowever, I am happy that they stayed true to the complex nature of  The Mad Titan.  Thanos was always a multifaceted villain.  The challenges of green-screen and motion-capture acting didn't interfere with the stellar performance of Josh Brolin.  Truly mad, but never unhinged, Thanos quite literally steals most scenes.  The performance was captivating as Brolin effortlessly vacillates between brutal cruel tyrant, pitiful broken father, and calculated and devious manipulator.  Thanos is a character Marvel Studios absolutely could not alter, and I'm pleased to say, this favored character was done justice.\n\nIn the coming weeks it will become increasingly difficult to avoid spoilers, so if you have any interest in the Marvel films, I encourage you to see this soon.  If, by chance, some elements are revealed to you prior to your making it to the theater, don't be discouraged.  If you're an Avengers fan, you will still enjoy this one.  If you're a Thanos fan, you must see this.","displayName":"Matt H","displayImageUrl":"https://graph.facebook.com/v3.3/100000009807887/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T08:51:33.000Z","updateDate":"2018-04-28T08:52:00.000Z","user":{"userId":"877264231","realm":"RT","displayName":"Matt H","accountLink":"/user/id/877264231"},"score":4.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Best MCU movie so far","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/483650672049856/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T08:50:54.000Z","updateDate":"2018-04-28T08:52:55.000Z","user":{"userId":"977245741","realm":"RT","displayName":null,"accountLink":"/user/id/977245741"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"stunning, sad, fun, mind blowing cant wait for more. go see this movie and enjoy. you'll be on the edge of your seat.","displayName":"Reid N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T08:49:37.000Z","updateDate":"2018-04-28T08:52:36.000Z","user":{"userId":"952872365","realm":"RT","displayName":"Reid N","accountLink":"/user/id/952872365"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Why did half the Avengers have to die to make this series any good?! Five stars. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T08:47:56.013Z","updateDate":"2018-04-28T08:48:13.049Z","user":{"userId":"906027341","realm":"RT","displayName":null,"accountLink":"/user/id/906027341"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"This movie is hands down the best marvel movie that has come out to date. All of the storylines packed into it made it so interesting to watch. 10/10 would watch it again.","displayName":"Kristian%20 H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T08:46:55.000Z","updateDate":"2018-04-28T08:48:46.000Z","user":{"userId":"977245734","realm":"RT","displayName":"Kristian%20 H","accountLink":"/user/id/977245734"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Infinity War surprisingly pulls off a wonderful film loaded with many characters. The talent of these directors truly shine through being able to properly balance between scenarios and many leads on screen. Josh Brolin's performance as Thanos outshines his comic book counterpart and is easily now the best villain in the MCU through his motives and decisions.","displayName":"Samuel S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T08:46:07.000Z","updateDate":"2018-04-28T22:06:24.000Z","user":{"userId":"904965491","realm":"RT","displayName":"Samuel S","accountLink":"/user/id/904965491"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_1","review":"I agree with some of the critics, this movie is a mediocre, ridiculous and poorly made film that really endangers the quality of American films, I sat for 2.5 hours to watch this movie and it makes me think what goes through the actors minds when they have to say the stupid lines of this movie. If you thought justice league was a fiasco this movie is even worst. \nNothing else can be expected when you put all the superheroes to act along a talking fox, a videogame addict tree that looks like a broccoli, and so many other blue, and green humanoids wanting to save and destroy the universe.  \nThe only good thing about this movie is that I did not have to watch the ridiculous character of loki for too long. I want my money back!!!","displayName":"Camilo A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T08:44:53.000Z","updateDate":"2018-04-28T08:57:54.000Z","user":{"userId":"977245715","realm":"RT","displayName":"Camilo A","accountLink":"/user/id/977245715"},"score":1,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"When Kevin Feige brought in Russo brothers to direct Captain America: The Winter Soldier, no one anticipated them to be handling the holy grail of Marvelverse, the Infinity War.\nSynopsis: To balance the universe from desolation, Thanos aims to snuff away half of its lifeform, which he believes can be done if he yields all the six infinity stones viz., reality, time, power, space, soul & mind. However, his imposing plan gets stalled by earth's mightiest heroes 'The Avengers' & 'Guardians of Galaxy'.\nWhat MCU had been lacking for so long, was a perfect villain. Loki did impose his mischief charisma in his earlier outings like in 'The Avengers' or 'Thor' but it never was as intimidating & terrifying as Josh Brolin's exhibition of Thanos. He not only nailed the character but demonstrated what a perfect nemesis can be, which not just dictates audience but admiration. Of course, his minions, the members of Black Order were no less daunting, look out for the character Ebony Maw flawlessly depicted by Tom Vaughan-Lawlor.\nKudos for putting in so many characters & yet making it perfectly balanced with coherent plot. Each member gets his share to shine. The action sequences were prodigious, something which we now are acquainted with & expect nothing short of spectacular from such franchise.\nInfinity War has ventured into an uncharted path, where very few movies will ever dare to do; stakes were high for Anthony & Joe Russo, as it could have gone either way as it did with last year's Justice League. It took a decade of meticulous planning of interlaced stories to finally unleash the wrath of mad titan. Did it pay off? Hell yeah, what did you expect! Infinity War is not just a movie but a cinematic phenomenon, ready to awe & shock both the reactionary followers of MCU franchise & general audiences alike. Be ready to be blown away. \nOh, I saw Tyrion Lannister, good lord did I just spoil it #@*!","displayName":"Debjyoti G","displayImageUrl":"https://graph.facebook.com/v3.3/769528499/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T08:41:46.000Z","updateDate":"2018-04-28T11:43:28.000Z","user":{"userId":"798493235","realm":"RT","displayName":"Debjyoti G","accountLink":"/user/id/798493235"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_0_5","review":"There was tons of bad language and suggestive material it disgusted me to the point where I just had to leave. My little brother came with me to see it and I felt horrible for him for having been exposed to that type of vulgarity. Even the plot of the movie was awful and had no planning. They tried to make you feel bad for the bad guy by using your compassion against you. I thought marvel really destroyed its franchised with this movie. Won't be going to see another any time soon!","displayName":"MAureen T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T08:40:03.000Z","updateDate":"2018-04-28T08:46:12.000Z","user":{"userId":"977245717","realm":"RT","displayName":"MAureen T","accountLink":"/user/id/977245717"},"score":0.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_3_5","review":"Not perfect,  but  it's thrilling and has the best ending of any MCU film I've seen.","displayName":"Richard P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T08:39:27.000Z","updateDate":"2018-04-28T08:40:36.000Z","user":{"userId":"916066625","realm":"RT","displayName":"Richard P","accountLink":"/user/id/916066625"},"score":3.5,"timeFromCreation":"Apr 28, 2018"}]}