{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MTQ3Nzg0MzEiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDZUMjE6MDk6NTYifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF83OTk1MjE3MDgiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDZUMjI6MDI6NDkifQ=="},"reviews":[{"rating":"STAR_3_5","review":"Well, this is it everybody. Marvel's insanely lucrative decade of films has all been leading up to this one, the BIG one, right? That's why we kept forking over cash every 3-6 months to keep up with all of the installments in Disney's gargantuan superhero saga? Missed it in theaters, you better believe we rented it, and bought the deluxe edition DVD, and then the BluRay because technology upgraded, and then the 20-disc box set. The Marvel movement that made superhero movies not only cool again, but impossible to compete with in the box office, has all apparently been leading up to this final film -- the war to end all wars, part one -- the end of the MCU before the next MCU begins! Everyone in Hollywood is in this film, guys! The credit roll for VFX designers was 75% of the entire credit reel, so this one must have the. very. best. CGI. Well friends, I did go see 'AVENGERS: INFINITY WAR' (in the theater, I might add) and...it was ... another Marvel film, but with even more sweet, sweet crossovers! Look, the Guardians of the Galaxy are hanging out with Iron Man and Spider Man! Look, there are alien ships completely destroying New York City again, only to escape through a massive portal! Look, there are pop culture references that make this both relevant to millennial AND comically self-aware! I can't believe Thanos is played by Josh Brolin! You know, I can't hate on this film anymore than all the sour pusses that have already bashed it, and for anyone to do so critically is wasting their time. This film wasn't made to serve as the perfect bookend to an epic series, to tie everything up nicely a la 'LORD OF THE RINGS: RETURN OF THE KING'. It was made to close the door on the actors and actresses who have now been putting on their super-suits for a quarter of their lives before they have aged too much, and even more, before paying audiences get over their characters. Sorry, Chris Hemsworth, charming as you are, we can't watch another f**king Thor movie. And RDJ, Iron Man WAS great, but you're approaching Magneto-season, bud. Step aside, old MCU, so a NEW generation of superheroes can have their shot this decade. To be completely serious, Thanos was my favorite part of the movie, and his character was drafted well and portrayed well by Brolin, but there are just no damn stakes in these movies anymore. A beloved character dies, and it doesn't seem like such a devastating loss because there are still so many other characters to keep track of. One to the next one. How many times can you watch the same epic battle scene chaotically devastate through a metropolitan city before you realize that it will just happen again and again in the next installment. Why does anyone still live in New York City when aliens keep coming once a year and making the commute 100 times worse? We saw this same chaos in (pretty much) every other Marvel movie, and Infinity War failed to make it seem any more important or necessary than the others. The CGI is top-notch, do not get me wrong. But where is the heartbeat? When do we get a new Marvel movie that truly changes the process and causes us to actually think: \"damn, that was nothing like what I was expecting.\" I'm afraid that the answer is that we won't, at least not with this routine - the numbers are too big and why fix it if it isn't broken, I guess. Infinity War had over a decade to prepare to give us something colossal as a finale, but with part one already here I just don't see it happening. Please find a way to prove me wrong, Disney, because I'd like to think it was all really worth it.","displayName":"Jake R","displayImageUrl":"https://graph.facebook.com/v3.3/765117636/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T22:02:49.000Z","updateDate":"2018-05-28T20:05:44.000Z","user":{"userId":"799521708","realm":"RT","displayName":"Jake R","accountLink":"/user/id/799521708"},"score":3.5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_4_5","review":"Takes a lot to get a perfect score from me so four and a half stars should say it all. Infinity war straddles the line with perfection. It was heart felt and action packed all the way through. It is one of Marvel's best and better than both of the previous Avengers movies. It was a tough task to get all of the heros screen time as well as their own action scenes but this movie juggled this quite well. Thanos is the best villian to date of any comic and that includes Heath Ledgers joker and Loki. Again a tough sell but nicely done by marvel. when a movie is really good, I usually see it twice. Infinity war easily makes the cut. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T21:50:33.492Z","updateDate":"2018-05-06T21:55:33.869Z","user":{"userId":"969749669","realm":"RT","displayName":null,"accountLink":"/user/id/969749669"},"score":4.5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_1","review":"Good special effects but bad guy wins, no real message and a stupid story where the bad guy is like Malthus apparently not realizing Malthus theories have long ago been discredited because technology allows us to do more with less. I guess comic book bad guys don't read enough earth history to know any better. I regret wasting my time with this movie","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T21:40:56.044Z","updateDate":"2018-05-12T19:57:00.319Z","user":{"userId":"260027935","realm":"RT","displayName":null,"accountLink":"/user/id/260027935"},"score":1,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"The Russo brothers have been responsible for some of my favorite Marvel films over the last few years. That being said, \"Infinity War\" is their crowning achievement. This movie is a joyous celebration of a decade of fun movies with great characters. The movie does an exceptional job of juggling many characters and story arcs and they come together in the final act very nicely. This movie just blew me away in every aspect. The action and humor are all great, as it typically is in a Marvel movie. I found myself laughing at the jokes and enjoying all of the fight scenes in the movie. However, this movie does a few things movies in the MCU don't frequently pull off. For one, it may have the best villain we've seen in a very long time with Thanos. The opening scene makes it clear that he is a force to be reckoned with and every second feels like a real danger. The other aspect of the movie that truly surprised me is how boldly shocking the conclusion is and how it truly has an emotional center. I won't get into what happens, but this is the first time where I genuinely have no idea what is to come next in this universe. The conclusion of the film left me speechless and my heart racing. This is an absolutely fantastic film that has both set the bar for the upcoming summer season very high and just might be the best movie Marvel has brought to us yet that will leave you begging for the next chapter. It will blow you away.","displayName":"Yash B","displayImageUrl":"https://graph.facebook.com/v3.3/100000592764041/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T21:33:11.000Z","updateDate":"2018-05-19T15:37:33.000Z","user":{"userId":"915900746","realm":"RT","displayName":"Yash B","accountLink":"/user/id/915900746"},"score":5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_2","review":"Beautiful and clever, but also way too violent and sad. I understand creating motivation for the characters, but this is seriously over the top. Way too much for the resolution.","displayName":"Karla F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T21:27:42.000Z","updateDate":"2018-05-06T21:31:51.000Z","user":{"userId":"977260022","realm":"RT","displayName":"Karla F","accountLink":"/user/id/977260022"},"score":2,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"I was surprised how good this was. It’s actually one of the best Marvel movies. It’s a major accomplishment that they could have this many characters and not make it feel overcrowded. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T21:25:30.064Z","updateDate":"2018-05-06T21:25:30.064Z","user":{"userId":"813893730","realm":"RT","displayName":null,"accountLink":"/user/id/813893730"},"score":5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_4_5","review":"Now that's a \"villain\".","displayName":"Mark Conrad R","displayImageUrl":"https://graph.facebook.com/v3.3/1685477412/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T21:24:13.000Z","updateDate":"2018-05-06T21:24:17.000Z","user":{"userId":"879508022","realm":"RT","displayName":"Mark Conrad R","accountLink":"/user/id/879508022"},"score":4.5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_3_5","review":"Bold but worthwhile.","displayName":"Brendan H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T21:16:20.000Z","updateDate":"2018-05-06T21:18:14.000Z","user":{"userId":"976150925","realm":"RT","displayName":"Brendan H","accountLink":"/user/id/976150925"},"score":3.5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"Outstanding movie! The twists were so good! And as my friend Ben said: “The Good Guy finally wins”","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T21:15:06.632Z","updateDate":"2018-05-06T21:15:06.632Z","user":{"userId":"925769845","realm":"RT","displayName":null,"accountLink":"/user/id/925769845"},"score":5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"An amazing movie that will leave you feelings lots of things at the end. A great movie for any Marvel lover.","displayName":"Taylor H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T21:09:56.000Z","updateDate":"2018-05-06T21:10:35.000Z","user":{"userId":"914778431","realm":"RT","displayName":"Taylor H","accountLink":"/user/id/914778431"},"score":5,"timeFromCreation":"May 06, 2018"}]}