{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyMzEwMzIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjFUMTU6MDU6NDgifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY5MDA4NzgiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjJUMDk6MjE6NTAifQ=="},"reviews":[{"rating":"STAR_5","review":"THIS IS THE BEST ONE TO DATE. True to alot of the comics and suspenseful. Leaves you wanting more in the second part.","displayName":"Luke J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-22T09:21:50.000Z","updateDate":"2018-04-29T13:41:16.000Z","user":{"userId":"976900878","realm":"RT","displayName":"Luke J","accountLink":"/user/id/976900878"},"score":5,"timeFromCreation":"Apr 22, 2018"},{"rating":"STAR_5","review":"I've watched! And I wanna watch it again.","displayName":"Sidan I","displayImageUrl":"https://graph.facebook.com/v3.3/100001373227050/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-22T04:53:58.000Z","updateDate":"2018-04-28T12:24:11.000Z","user":{"userId":"966276381","realm":"RT","displayName":"Sidan I","accountLink":"/user/id/966276381"},"score":5,"timeFromCreation":"Apr 22, 2018"},{"rating":"STAR_5","review":"Best movie i have ever watched","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/195600297908340/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-22T03:07:29.000Z","updateDate":"2018-05-25T18:50:11.000Z","user":{"userId":"977231903","realm":"RT","displayName":null,"accountLink":"/user/id/977231903"},"score":5,"timeFromCreation":"Apr 22, 2018"},{"rating":"STAR_4_5","review":"After 10 years following the MCU, and after 2 viewings of this film, I feel I can finally give a definitive rating and review. This is a Marvel (get it?) of film-making. The Russo brothers did an amazing job pulling off this film packed full of characters and plotlines while keeping it fun, cohesive, dramatic, and emotional. The story is one which has been building in the Marvel Cinematic Universe since The Avengers in 2012 and finally culminates in this dramatic film which leaves you in tears. The acting is superb as always, but what I find quite surprising is that a lot of my favorite characters from this particular film were characters which I didn't care about as much thus far in the MCU. Characters such as Captain America and Iron Man have had plenty of shine since their on screen debut, but characters like Thor and Scarlet Witch had left a lot to be desired for me. This movie changes that. While it is disappointing to see some of my favorite characters have less screen time than I wanted, the movie makes up for it by giving those underwhelming characters much more screen time and development making me love and care for them much more than I would have otherwise. In particular when it comes to good characters in this film is the main antagonist, Thanos. Thanos, played by Josh Brolin, is by far one of the best, and likely my favorite marvel villain to date. This is an achievement I feel the movie needed to get right if it wanted to succeed. We already love most of these characters thanks to their solo adventures and other team ups, so giving Thanos the opportunity to be the star of the flick is a great idea and made for a better film. He's compelling, intimidating, he steals the screen everytime he shows up, and Josh Brolin does such a wonderful job conveying true emotion even through a CGI character. The score is also amazing and I find myself listening to it on Youtube. I need not say much for the climax as to not spoil, but as you may already know, it is quite the emotional ride. Some few minor complaints would be some of the humor breaks up otherwise emotional scenes (I'm looking at you Drax) and I just wish there was more time for a few more character moments. However, these are minor complaints considering the sheer massive achievement this movie brings to the table. This is a must see!","displayName":"Ashton L","displayImageUrl":"https://graph.facebook.com/v3.3/322097568123221/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-21T22:19:33.000Z","updateDate":"2018-05-23T19:16:19.000Z","user":{"userId":"975241140","realm":"RT","displayName":"Ashton L","accountLink":"/user/id/975241140"},"score":4.5,"timeFromCreation":"Apr 21, 2018"},{"rating":"STAR_5","review":"NO SPOILER REVIEW I PROMISE \nLAUGHED, HAPPY SCREAMED, YES SCREAMED, FANGIRLED, EMOTIONAL, TERRIFIED, CRIED... Just a simple few words that describe how I reacted watching Avenger: Infinity War. The best way to describe this movie is as stated by the guy behind \"SO NOW DISNEY GOT THE BALLS TO DO THIS\". I literally was on a freaking roller coaster, where not a single moment left me feel bored. There was great action, great visuals, and just badass. Remember how Marvel has a villain problem? Well.. Thanos defies everything. Never have we had a very complicated yet menacing villain in Marvel history. And there are loads of surprises and shocks, like literally to the point where I crapped my pants. Whatever you do if you are reading this, go to the freaking theaters right now to watch Infinity War. You will understand how dangerous and cruel Thanos is. I'm still shaking btw. Watching it again tomorrow and more in the future","displayName":"Raisa R","displayImageUrl":"https://graph.facebook.com/v3.3/100000712686194/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-21T21:57:37.000Z","updateDate":"2018-04-26T22:51:38.000Z","user":{"userId":"901509082","realm":"RT","displayName":"Raisa R","accountLink":"/user/id/901509082"},"score":5,"timeFromCreation":"Apr 21, 2018"},{"rating":"STAR_5","review":"Most Messed Up Cliff Hanger Ever in a Movie in this Decade. Which is a good thing. Marvel have strung along characters and balanced them well. The only negative being Captain America and the gang having a short screen time.","displayName":"Riley X","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-21T19:31:54.000Z","updateDate":"2019-02-21T04:35:24.000Z","user":{"userId":"977231448","realm":"RT","displayName":"Riley X","accountLink":"/user/id/977231448"},"score":5,"timeFromCreation":"Apr 21, 2018"},{"rating":"STAR_4","review":"Good LONG movie. Sucks we have to wait another year to wrap the movie up, but I'm looking forward to what they come up with and with Captain Marvel coming into the mix next year will be exciting. Stay after the credits obviously, as usual.","displayName":"Brandon P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-21T18:46:41.000Z","updateDate":"2018-04-28T13:48:59.000Z","user":{"userId":"977208131","realm":"RT","displayName":"Brandon P","accountLink":"/user/id/977208131"},"score":4,"timeFromCreation":"Apr 21, 2018"},{"rating":"STAR_5","review":"Great movie, lots of fun. I didnt think the run time was to long, could have kept watching .","displayName":"Adam S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-21T16:39:34.000Z","updateDate":"2018-04-27T13:41:00.000Z","user":{"userId":"977231119","realm":"RT","displayName":"Adam S","accountLink":"/user/id/977231119"},"score":5,"timeFromCreation":"Apr 21, 2018"},{"rating":"STAR_3_5","review":"I'm really mixed to positive on this one. It's hard to explain my feelings about the movie without spoiling it, so I'll say this: the things that this movie does well, it does it REALLY well. Thanos was great as villain (his motives, not so much), the action scenes were good, I liked most of the character interactions, there were some emotional scenes that were done well, and a few things will transpire that you won't see coming, which was very exciting. After Thor's last atrocious solo outing (Ragnarok), I didn't really care much for his character but this time around, the Russo's brought the thunder (pun intended); he was my favorite of all the Avengers in this film (even though there were some still some residual Ragnarok traits, I'm willing to forgive them). The things that it does bad, it does REALLY bad. A lot of the humor was contrived; some of those emotional/dramatic scenes were ruined by poorly timed jokes, something that Ragnarok and GotGv2 suffered from immensely. Towards the middle of the film, the scenes seemed to kind of jump all over the place but that's just a small nitpick on my part. Certain characters were handled in a way that really bothered me, but I can't divulge on that point without spoilers. Lastly, the ending just fell flat for me; I understand what they were trying to do with the ending and it DID work to some degree, but for everything that happened in the movie and for it to end the way it did...it just didn't sit well with me. Overall, I thought the movie was good...the Russo Brothers are excellent directors (Winter Soldier is still, by far, my favorite MCU film) and I'm ready to see what they have in store for Avengers 4!!! 3.5/5 Stars","displayName":"Jelani W","displayImageUrl":"https://graph.facebook.com/v3.3/1053104867/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-21T16:21:05.000Z","updateDate":"2018-04-27T08:44:46.000Z","user":{"userId":"827144356","realm":"RT","displayName":"Jelani W","accountLink":"/user/id/827144356"},"score":3.5,"timeFromCreation":"Apr 21, 2018"},{"rating":"STAR_5","review":"Best movie ever. How Thanos is a villian is amazing. There is nothing left to say. Infinity is the best movie of all time.","displayName":"Kameron M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-21T15:05:48.000Z","updateDate":"2018-04-27T19:11:45.000Z","user":{"userId":"977231032","realm":"RT","displayName":"Kameron M","accountLink":"/user/id/977231032"},"score":5,"timeFromCreation":"Apr 21, 2018"}]}