{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyMzI0ODUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMDY6MDI6MTUifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNDU0NDMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMDY6MjU6MDYifQ=="},"reviews":[{"rating":"STAR_5","review":"The best movie by marvel cinematic universe though it's a shock at the end . Now I m just waiting for avengers 4 to see","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/2027082147614044/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T06:25:06.000Z","updateDate":"2018-04-28T06:26:16.000Z","user":{"userId":"977245443","realm":"RT","displayName":null,"accountLink":"/user/id/977245443"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Avengers: Infinity War is the best MCU movie till date. No doubt about it.\nThe movie had a build-up of ten years, all leading up to this. \nA battle of epic proportions which carries the weight of the Universe; dark, gritty, emotionally devastating; sarcastic, quirky and funny moments; and everything you can hope for.\n\nGranted, the movie is all of that, only and only if the viewers have watched all of the previous MCU movies. For a casual first time viewer,, the movie will be an epic action-adventure packed space orgy. But that's it nothing more nothing less.\nThe Infinity stones are explained, but much won't be told, and much won't be understood.","displayName":"Bibek B","displayImageUrl":"https://graph.facebook.com/v3.3/811247295696611/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T06:20:28.000Z","updateDate":"2018-04-28T06:34:33.000Z","user":{"userId":"976295497","realm":"RT","displayName":"Bibek B","accountLink":"/user/id/976295497"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4_5","review":"WOW. LOOK HOW FAR MARVEL CAME WITH THE MCU....10 YEARS, 18 MOVIES AND A PLETHORA OF TELEVISION SHOWS THAT SPAN MULTIPLE STATIONS (EVEN IF THEY AREN'T MCU CONNECTED TO SOME DEGREE); AND FOR THOSE OF US WHO STUCK BY MARVEL IN THE BEGINNING STARTING WITH, \"IRON MAN\" (2008) AND ON OUT THIS MOVIE IS A BIG THANK YOU..............BUT ALSO A BIT F*** YOU IN A INTERESTING WAY, BUT WE WELL GET TO THAT. \n\nAVENGERS: INFINITY WAR  IS THE 19TH MOVIE IN THE MARVEL CINEMATIC UNIVERSE (MCU) AND ITS THE CULTIVATION OF EVERY MOVIE THAT DEALT WITH OR COME ACROSS THE INFINITY STONES AND THE TEASING OF A MAJOR THREAT TO THE KNOWN UNIVERSE IN THE FORM OF THANOS (PLAYED BY JOSH BROLIN) WHO THROUGHOUT MOST OF THE MCU STARTING WITH THE AVENGERS  (2012) AND RIGHT INTO GUARDIANS OF THE GALAXY (2014) HAS BEEN TEASED AND MADE A VERY SIGNIFICATION AND IMPORTANT CHESS PIECE IN THE MCU HAS FINALLY MADE HIS PRESENCE KNOWN AND THIS TIME HE'S NOT ALONG IN HIS QUEST FOR NOT JUST POWER...ANY BAD GUY CAN WANT POWER, BUT TO SET A \"BALANCE\" THAT IN HIS MINDSET THERE'S AN IMBALANCE IN THE UNIVERSE THAT NEEDS TO BE ANTIQUATED. \n\nTHIS MOVIE IS IMPORTANT, NOT JUST BECAUSE IT'S THE 3RD AVENGERS MOVIE AND THE END OF THE 3RD PHASE; BUT MORESO IT'S IMPORTANT FOR WHAT'S GOING TO HAPPEN NEXT IN THE MCU WHICH I EXPECT GREAT AND TERRIBLE THINGS TO BE EXACT. THIS MOVIE IN EVERY SENSE OF THE WORD.....BROKE ME; NOT BECAUSE THE ABUNDANCE OF CHARACTERS THAT FILLED UP THE SCREEN THAT WAS ALWAYS AN AWESOME THING SEEING TONY STARK WITH DR. STRANGE (THE MUSTACHE BROS) OR  ROCKET RACCOON TEAMING UP WITH THOR AND THE AVENGERS. NO, THIS MOVIE BROKE ME FOR THE AMOUNT OF EMOTIONS THAT STEM FROM THE CONSEQUENCES AND REPERCUSSIONS WHICH IS THE CENTRAL THEME OF THIS MOVIE CAUSE THERE'S A LOT OF THAT GOING AROUND AND WHILE THE TRAILERS AND TV SPOTS SHOW YOU SOMETHING THAT FUNNY, ACTION-PACKED AND A THRILL RIDE A MINUTE ITS WHAT'S UNDERNEATH THAT THEY DON'T SHOW....AND HOW DARK THIS MOVIE GETS AND HOW FAST THE STAKES ARE RAISED AND THE IMPACT AND AFTERMATH OF WHAT WILL START PHASE 4 AND NOT TO MENTION THE IMPACT ON THE MOVIE GOER WHO SEES THIS MOVIE AND EXPECT SOMETHING ONLY TO GET SOMETHING ELSE AND IF YOU HAVE YOUR THEORIES OR IDEAS GET READY.... CAUSE IN THE WORDS OF LUKE SKYWALKER FROM 'THE LAST JEDI', \"THIS ISN'T GOING TO GO THE WAY YOU THINK\". \n\nTHE TAKEAWAY FROM A MOVIE LIKE THIS IS ESPECIALLY SINCE ITS A FILM THAT BRING TOGETHER A LOT OF THE HEROES FROM BOTH EARTH AND SPACE IS THAT YOU HAVE TO MAKE A FILM THAT DOESN'T CONFUSE THE MASSES; AND I THINK WHEN IT COMES TO THAT I BELIEVE THE RUSSO BROTHERS GOT THAT IN CHECK; THEY FOUND SOME WAY TO GET 20+ CHARACTERS AND HAVE THEM WORK IN A WAY THAT ITS NOT CONFUSING...AND IT WON'T MUDDLE THE MINDS OF ANYONE COMING INTO THE MCU BY WAY OF BLACK PANTHER BUT MAKE NO MISTAKE THIS IS ESSENTIALLY FOR THE FANS BY AND LARGE AND THERE ARE CHARACTERS THAT WE HAVEN'T SEEN SINCE PHASE 1 THAT ENDS UP MAKING A SURPRISING APPEARANCE THAT MAY CONFUSE THOSE NEW COMERS WHICH IS WHY FOR STREAMLINING PURPOSE FOR THOSE COMING INTO THE MCU SHOULD WATCH AT LEAST 4 OR 5 PREVIOUS MCU MOVIES THEN GO SEE THIS MOVIE. BUT HAVING A MAJORITY OF HEROES ON ONE SCREEN SERVES AS A POSITIVE, AND A NEGATIVE DEPENDING AND WE WILL GET TO THAT. \n\nEACH CHARACTER GETS A MOMENT TO SHINE IN SOME FORM OR MEASURE; THE QUALITY OF THE RUSSO'S WAY OF HANDLING TEAM-WORKMANSHIP IS REMARKABLE AS WELL AS THE FIGHT CHOREOGRAPHY....THEY ARE EASY TO SEE, NO SHAKY CAM AND THEY ARE VERY ABUNDANT. THERE ARE MULTIPLE FIGHT SEQUENCES AS WELL AS BATTLE SEQUENCES THAT GIVES A SENSE OF URGENCY FOR THE SAKE OF THE WORLD AND UNIVERSES.  \nAS I SAID, THE MAJOR OVER-ARCHING THEME IS 'CONSEQUENCES AND REPERCUSSIONS' AND WHEN THE JOKES ARE OVER AND THE SERIOUSNESS KICKS IN....SERIOUSLY, THE IDEA THAT NO ONE IS SAFE GOES INTO OVERDRIVE AND TRUST ME WHEN I SAY WHEN THE THIRD ACT IS REACHED YOU BECOME EMOTIONALLY BROKEN AT WHAT TRANSPIRES WHICH FEELS LIKE DESPITE WHAT YOU SEE IN THE TRAILERS AND COMMERCIALS MARVEL HAD THE BALLS TO MAKE THIS CHOICE AND TRUST ME I'M NOT COMPLAINING I FELT IT WORKED FOR THE STORY AT HAND BUT THE SET UP AND HOW IT WAS EXECUTED WAS SO PIVOTAL, SO EMOTIONAL IT FEELS LIKE A BIG F-U (IN A GUTSY WAY) BUT A ALSO A WAY TO GET PEOPLE AMPED FOR WHAT COMES NEXT IN THE MCU....WHEN KEVIN FEIGE SAYS THIS IS THE BEGINNING OF THE END OF THE MCU I DIDN'T KNOW WHAT HE MEANT UNTIL I SAW THIS MOVIE!! \nAGAIN THIS MOVIE BROKE ME!! \n\nTHOR (CHRIS HELMSWORTH) SEEMS TO BE THE OVERALL MVP IN THIS MOVIE ASIDE FROM THANOS; THE MAJORITY OF THE TIME HE SEEMS TO BE THE CENTRAL FOCUS AS HE LOOKS FOR A WEAPON TO KILL THE MAD TITAN;  BUT THIS IS ENTIRELY THANOS STORY; HIS REASONING, HIS MOTIVATION, HIS QUEST IS ENTIRELY FOCUSED. AND WHAT MAKES HIS CHARACTERS REASONABLE IN A WAY YOU UNDERSTAND IS THIS BELIEF; HE'S A BELIEVER AND VERY STRONG IN HIS IDEAS...WHEN HE SPEAKS IT MAKES SENSE AND YOU UNDERSTAND WHY HE'S DOING WHAT HE'S DOING AND NOTHING IS SCARY THAN A PERSON WITH A BELIEF AND CONVICTION THAT WHATEVER THEY ARE DOING CRAZY OR GENOCIDAL IS THE RIGHT THING TO DO. \n\nTHE BLACK ORDER MAKES AN APPEARANCE (LACK THERE OF..) FOR THE FIRST TIME IN THE MCU; AND WHILE I'LL GO ON RECORD AND SAY I LOVE THE BLACK ORDER THEY TREATED THESE GUYS LIKE SECOND RATE MINI-BOSSES; MEANING THEY SHOULD HAVE BEEN GIVEN MORE TIME TO GROW AND HELL MAYBE EVEN BECOME LATER ENEMIES IN THE FUTURE OF THE MCU CONSIDERING THAT ITS GOING MORE INTO SPACE STORIES THAN THAT ON EARTH. EBONY MAU WAS THE ONLY STAND OUT CHARACTER AND HE WAS PRETTY AWESOME; HIS MANOR AND TONE WAS VERY MUCH A STAND OUT AMONG THE OTHER THREE BUT OTHERWISE THEY NEEDED MORE SCREEN TIME. \nTHIS MOVIE IS An EXCELLENT ADVENTURE, A RIDE IN WHICH I DIDN'T WANT TO GET OFF....EVERYTHING LEADING UP TO THE 3RD ACT AND CLIMAX WHICH IS BOTH SHOCKING AND UNNERVING ...IT WILL LEAVE EVEN THE MOST FANS OF THE MCU SPEECHLESS AND EVEN HEARTBROKEN AND LEAVE YOU WANTED TO KNOW... WHAT NOW?\n\nTHE DOWNSIDE OF THIS MOVIE IS THAT EVEN THOUGH THE DIRECTORS TRIED TO GIVE EVERYONE SPOTLIGHT TO SHINE...NOT EVERYONE DID AND I WISHED THEY TRIED TO INCORPORATE THEM INTO THE FOLD AND NOT GIVE THEM SECONDS. ALSO, A PARTICULAR CHARACTER SHOULD HAVE BEEN BROUGHT INTO THIS FILM INSTEAD OF HAVING US WAIT.....BUT I'M A PATIENT MAN. \n\nTHE EVENTS THAT TRANSPIRE IN THIS MOVIE I FEEL WILL CHANGE EVERYTHING IN THE MCU FOREVER; AND ALSO (POSSIBLY) BRING IN A CERTAIN BAND OF MUTANTS OR MAYBE A CERTAIN FIRST FAMILY OF HEROES. EITHER WAY THIS MOVIE IS A MUST SEE AND IT WILL BE IN YOUR HEAD AFTER THE CREDIT ROLLS; I FEEL I HAVE TO SEE THIS MOVIE AGAIN JUST TO AT LEAST GRASP THE FACT THAT THESE THINGS HAPPENED CAUSE EVEN THOUGH I COULDN'T STOP THINKING ABOUT IT. AND THAT'S THE POWER OF THE SCREEN WRITING... \n\nGOOD JOB MARVEL \nSORRY DCU! \n\n4 - 1/2 STARS \n\n-CHRIS","displayName":"Chris W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T06:19:21.000Z","updateDate":"2018-05-21T11:45:31.000Z","user":{"userId":"947529150","realm":"RT","displayName":"Chris W","accountLink":"/user/id/947529150"},"score":4.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Another solid Marvel offering. Exceeded my expectations, and I can't wait to see the conclusion in part 2.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T06:17:30.369Z","updateDate":"2018-04-28T06:17:30.369Z","user":{"userId":"260027964","realm":"RT","displayName":null,"accountLink":"/user/id/260027964"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Fantastic film. Lives up to every bit of hype that led up to it. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T06:13:04.810Z","updateDate":"2018-04-28T06:13:04.810Z","user":{"userId":"908682610","realm":"RT","displayName":null,"accountLink":"/user/id/908682610"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Avengers: Infinity War is a jaw dropping, spine tingling blockbuster that leaves you permanently at the edge of your seat. It combines 10 years worth of story-telling and character development into a HUGE monument of wonder that leaves you paralyzed by both shock and anticipation for what is yet to come! \n\nDC take notes...","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1278519498956786/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T06:09:27.000Z","updateDate":"2018-04-28T06:17:11.000Z","user":{"userId":"977245415","realm":"RT","displayName":null,"accountLink":"/user/id/977245415"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"They actually managed to pull it off.","displayName":"Jeremy L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T06:07:52.000Z","updateDate":"2018-04-28T06:30:25.000Z","user":{"userId":"977245413","realm":"RT","displayName":"Jeremy L","accountLink":"/user/id/977245413"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"As a Marvel fan I can say that this movie was definitely something new. The movie takes quite a twisted and dark ending that may threaten the normal feel of the Marvel Cinematic Universe, however a movie where Thanos loses would have left an extreme amount of room for plot holes. Characters with a single infinity stone have mowed down entire planets, so a story in which a few advanced people take down a being with all six infinity stones would be complete nonsense. Thanos had to win regardless of the horror that followed. There is still a lot of room to judge this movie seen as the second part hasn't come out yet. Overall, I think the story was great as Marvel didn't try to mimic the style of Civil War and mash all the different heroes together. The choice to have various plots that sometimes merge yet are all connected was a great choice.","displayName":"Dong D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T06:07:09.000Z","updateDate":"2018-04-28T06:14:05.000Z","user":{"userId":"977245412","realm":"RT","displayName":"Dong D","accountLink":"/user/id/977245412"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4_5","review":"The \"professional critics\" on rotten tomatoes are either all smoking crack, or paid off (or both). You go to Star Wars the Last Jedi, and you see raving reviews for possibly one of the objectively worst films in history (as the audience score accurately reflects) and then you come to Avengers 3 and see a bunch of baseless complaints and a low score. If you come to Rotten Tomatoes, just stick with the audience score. The critics have no clue what the hell they are talking about. Avengers 3 was a superhero movie and no \"Godfather\", but what did you expect? As superhero movies go, it's the best I've seen and it was really well done and wrapped up the previous movies amazingly well. Screw the critics. GO SEE THIS MOVIE.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/783477415171386/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T06:05:37.000Z","updateDate":"2018-04-28T06:09:46.000Z","user":{"userId":"976917769","realm":"RT","displayName":null,"accountLink":"/user/id/976917769"},"score":4.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4","review":"Love the movie!! THE ENDING???","displayName":"Bendik O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T06:02:15.000Z","updateDate":"2018-04-28T08:50:05.000Z","user":{"userId":"977232485","realm":"RT","displayName":"Bendik O","accountLink":"/user/id/977232485"},"score":4,"timeFromCreation":"Apr 28, 2018"}]}