{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84MDg2MDU5ODYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMTJUMTk6MDQ6MTgifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzA2MTAzNDQiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMTJUMjE6MzE6MjgifQ=="},"reviews":[{"rating":"STAR_4_5","review":"Arguably the most anticipated movie of 2018, Infinity War has a tricky job on its hands: Trying to include so any characters, good and bad, in a balance that will create a satisfactory narrative while also leaving space for development and growth. Fortunately, the film mostly accomplishes this. At times it definitely feels overloaded, but the individual strands of the movie do coalesce nicely when required, but also exist on their own like fragments of a much bigger plot. Everyone is on top form, and rarely have I seen a movie which so effectively conveys an 'End of the world' feeling. Thanos, who previously suffered from the James Bond villain ailment of sending henchman to do their dirty work before opting to do it themselves, is a fantastic antagonist. With the bulk and brutality of Bane but the eloquent outspokenness of Loki or Ultron, Josh Brolin brings to life a being who sees destruction not as a choice, but as a necessity, and has devoted himself to achieving this mission, even at the expense of what he holds dear. There's plenty of comedy peppered into the script, and all the heroes get their chance to shine. It never felt like it was 2 and a half hours, largely thanks to the blend of exciting action and heartfelt drama, as the characters we've seen flourish in their own standalone movies and previous collaborations grapple with the weight of their task, and what they and others have to lose. It succeeds dramatically because the film isn't afraid to allow bad things to happen to the protagonists. In the latter Fast & Furious films the main cast survive ridiculous odds time and again without expending so much as a drop of blood. Here we have heroes either losing badly or only making it out by the skin of their teeth. There's a lot to lose, and you feel that in every battle. Infinity War never feels like a mere precursor to a bigger and more important conflict, but like a real step towards complete and utter annihilation. See it as soon as you can.","displayName":"Wayne K","displayImageUrl":"https://graph.facebook.com/v3.3/10205949674155460/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-12T21:31:28.000Z","updateDate":"2018-07-11T10:47:36.000Z","user":{"userId":"970610344","realm":"RT","displayName":"Wayne K","accountLink":"/user/id/970610344"},"score":4.5,"timeFromCreation":"May 12, 2018"},{"rating":"STAR_1","review":"Most of the movie and ok for some scenes but my god, the ending. Like some writer had to get fired for that. I mean come on!it was stale and didnt do anything to impress me. marvel just  wants to rack in more money if they make a second movie and it would probably make a worse ending. They could have easily made a much better ending and make the ending better but no.","displayName":"Aidan P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-12T21:22:18.000Z","updateDate":"2018-05-12T21:31:15.000Z","user":{"userId":"977266498","realm":"RT","displayName":"Aidan P","accountLink":"/user/id/977266498"},"score":1,"timeFromCreation":"May 12, 2018"},{"rating":"STAR_5","review":"This movie was so intense I kept getting goosebumps. The ending made me sad, yet anxious for part two of Infinity Wars.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-12T20:32:43.059Z","updateDate":"2018-05-12T20:32:43.059Z","user":{"userId":"976453744","realm":"RT","displayName":null,"accountLink":"/user/id/976453744"},"score":5,"timeFromCreation":"May 12, 2018"},{"rating":"STAR_5","review":"I loved it. I haven't even seen any of the other Avengers films but my 6 year old wanted to see this. We were still able to follow along quite well and we loved the action scenes. Also was absolutely hilarious ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-12T20:09:29.283Z","updateDate":"2018-05-12T20:09:29.283Z","user":{"userId":"791230366","realm":"RT","displayName":null,"accountLink":"/user/id/791230366"},"score":5,"timeFromCreation":"May 12, 2018"},{"rating":"STAR_5","review":"Amazing Movie, non stop action. Great job of bringing 10 years or marvel movies together. I cant wait for the second part. If you haven't seen it yet stop what your doing and go.","displayName":"Mustafa K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-12T20:07:37.000Z","updateDate":"2018-05-12T20:09:10.000Z","user":{"userId":"888928616","realm":"RT","displayName":"Mustafa K","accountLink":"/user/id/888928616"},"score":5,"timeFromCreation":"May 12, 2018"},{"rating":"STAR_5","review":"Amazing how they told a story that developed well with so many characters","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-12T20:06:26.297Z","updateDate":"2018-05-12T20:06:26.297Z","user":{"userId":"260027917","realm":"RT","displayName":null,"accountLink":"/user/id/260027917"},"score":5,"timeFromCreation":"May 12, 2018"},{"rating":"STAR_2","review":"One of the worst of the MCU movies to date. Proves one thing Marvel can't do is a dark and serious movie. Instead of letting the storyline naturally build the sense of dread and doom the opening scene should have established, the movie constantly undercut it's needed emotion with poorly written and poorly timed humor that mostly fell flat. And instead of allowing the ending to have its natural impact on the audience, the movie tries to hit us over the head with what we're stopped to feel by dragging it out and overdramatizing it to the point that it very quickly lost all of its impact. The story itself was exceptionally good, with what should have been a great ending, but the movie just couldn't get out of its own way.","displayName":"Eric D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-12T19:39:22.000Z","updateDate":"2018-05-12T19:52:50.000Z","user":{"userId":"911925207","realm":"RT","displayName":"Eric D","accountLink":"/user/id/911925207"},"score":2,"timeFromCreation":"May 12, 2018"},{"rating":"STAR_5","review":"Okay, so I just seen Infinity War for the 3rd time since it's release, and in all honesty this is truly an epic, powerful, and even dark mega awesome super hero movie that any fan of Marvel, The MCU, or comics will undoubtingly exit the theatre, physically shaking, as the adrenaline of this films sheer scope and magnitude pumps its great & powerful awesomeness through your veins, thrusting to contain its meaty beauty on the screen, bring a napkin, because you will exit a mess of joy & depravity, ??????","displayName":"Justin B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-12T19:30:41.000Z","updateDate":"2018-05-12T19:40:45.000Z","user":{"userId":"977266404","realm":"RT","displayName":"Justin B","accountLink":"/user/id/977266404"},"score":5,"timeFromCreation":"May 12, 2018"},{"rating":"STAR_4_5","review":"Great movie. Though there’s still a problem of overstuffing a lot into one movie, this is still a magnificent blend of action, humor, intense emotion, comic faithfulness and major consequences that features great direction, visual effects and performances from its cast, especially Downey, Jr, Holland, Ruffalo and Brolin.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-12T19:27:42.671Z","updateDate":"2018-05-12T19:27:42.671Z","user":{"userId":"918143389","realm":"RT","displayName":null,"accountLink":"/user/id/918143389"},"score":4.5,"timeFromCreation":"May 12, 2018"},{"rating":"STAR_1","review":"I finally watched Avengers: Infinity War and I thought the movie suuuuuuucked! Before I explain why I didn't like it, I just wanna say that nobody needs a reason to like or dislike something when it comes to media. You have a right to like/dislike whatever you want. That's what an opinion is! People who want an explanation on why someone doesn't like something only wants that information as fuel to fight back and tell them why they are wrong. Nobody is wrong! It's a f*cking opinion, IT CAN'T BE WRONG! Anyway, moving on. Infinity War sucked! And if you wanna know why I thought it sucked, then read on. \n\n\tTo me, Avengers is a corporate, mass produced, bullshit product. Avengers is like the Roman Reigns of high budget movies! \n\n\tFirst off, why did Captain America have beard? Why was Black Widow's hair blonde? Why did Thor gain a new weapon? I'll tell you why. it's to SELL MORE TOYS! All the hardcore collectors who have multiple version of Captain America toys, why should they buy this \"Infinity War\" version? Because he has a beard! I'm not saying that Marvel Studios is wrong for doing this. It obviously works because they make a gajillion dollars selling merch. Anyway, on to the movie.\n\n\tI can't feel for any of the characters in this movie. These heroes are created specifically for kids to like them. Captain America, Iron Man, Thor, Hulk, are super strong and have no weaknesses! It's like a 5-year old saying \"you can't hurt me, i have a force field and i'm very strong!\" That's why I always preferred X-Men, because they have relatable weaknesses. I have no emotional attachment to any of these characters in Infinity War. Yes, many heroes died, but they only killed off the new and secondary heroes. I thought they were gonna go somewhere bold and kill off Iron Man, but nope, they played it safe. Therefore everyone who died in the movie, I didn't really care. (I didn't want Spider-Man to die though, I thought Spider-Man was cool.) People say that you gotta watch the other Marvel movies to feel attached to these characters. Well, I watched a ton of them last year, and I felt no attachment to any of the characters or their recycled worlds. \n\n\t Another reason why I thought Infinity War sucked is because it's a CGI mess! CGI EVERYWHERE! I give zero f*cks about the Hulk, because he's just CGI. I actually like Mark Ruffalo playing the normal guy way more. Another example of the CGI mess is that battle on Wakanda. So many generic looking beasts. The only reason they were created is to have big explosions on screen. I gave zero f*cks about that fight because we all know the heroes were going over (wrestling terminology lol). The beasts were just jobbers and so were Thanos' henchmen. Predictable AF. \n\n\tInfinity War was so not funny and so slow. I thought most of the dialogue that was trying to be funny was not funny to me. Everyone in the theater was laughing their asses off which is great! I'm glad they were having fun, but most of the \"witty banter\" went on too long, and felt even longer since it wasn't funny to me. I did laugh at Peter Dinklage's line when he said \"Yeah, that's what dying means...\" During these parts of the movie, there obviously was no action going on, which is the reason I watch these movies to begin with. There was much less action in this Avengers movie compared to the first two movies. Also, the movie was extremely predictable. Maybe, that's by design? Who knows. I saw Thanos killing Gamora from a mile away. And Thanos is supposed to be this \"deep\" character who's not just pure evil. That didn't connect with me either because he was just a big ass CGI blob just like the Hulk. \n\n\tAgain I say, if you enjoy Marvel movies, that's great! I'm not gonna try to tell you to stop watching them. Even if I did, boycotting the movie won't stop these movies from happening because too many people love them. I just wanna say, that if someone doesn't like Infinity War, don't badger them! Don't tell them they gotta explain why they didn't like it. Just don't be a dick! If someone doesn't like something you enjoy, that shouldn't ever stop you from enjoying it. This is why I stay from reviews from things I actually like. Anyway, if you've read this far, you're a beast! Thanks!","displayName":"Bryan B","displayImageUrl":"https://graph.facebook.com/v3.3/1013386557/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-12T19:04:18.000Z","updateDate":"2018-05-12T19:05:03.000Z","user":{"userId":"808605986","realm":"RT","displayName":"Bryan B","accountLink":"/user/id/808605986"},"score":1,"timeFromCreation":"May 12, 2018"}]}