{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MzY2OTgxODUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMTNUMTQ6NDk6MTYifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Njk5MDQ0ODkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMTNUMTc6NTA6MDcuMzM4WiJ9"},"reviews":[{"rating":"STAR_5","review":"left me gobsmacked many times it's all been worth it. how they're gonna top this in the second movie leaves me salivating","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T17:50:07.338Z","updateDate":"2018-05-13T17:50:07.338Z","user":{"userId":"969904489","realm":"RT","displayName":null,"accountLink":"/user/id/969904489"},"score":5,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_5","review":"It was the best MCU movie ever!!!!!! It had me on the edge of my seat at the theater the whole time!! For those of you saying it was terrible, YOU ARE A BUNCH OF FOOLS!! If you didn’t watch the movie, DONT LISTEN TO THESE FOOLS!! Watch the movie and you be the judge!! No matter the ending REMEMBER it has a Part 2 next year!!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T17:26:39.109Z","updateDate":"2018-05-13T17:26:39.109Z","user":{"userId":"260131704","realm":"RT","displayName":null,"accountLink":"/user/id/260131704"},"score":5,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_4_5","review":"It was awesome, but I understand but I hate that their was a cliffhanger.","displayName":"Brian N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T17:15:24.000Z","updateDate":"2018-05-13T17:16:17.000Z","user":{"userId":"977267570","realm":"RT","displayName":"Brian N","accountLink":"/user/id/977267570"},"score":4.5,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_1_5","review":"As usual the violence is way over the top and seriously! The ending? Puhleez! If ever there was a lame lead-in to a sequel that was it. Could we, just for once, actually have some real character development? I thought Thanos might just reach for the depth of an interesting and tragically evil character but no. He's just a badGuy. And really! Trading the Universe for one friend? Anything but noble;just silly. Could the writers please read Campbell about archetypes? Please?","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T17:00:04.070Z","updateDate":"2018-05-13T17:26:26.505Z","user":{"userId":"906711514","realm":"RT","displayName":null,"accountLink":"/user/id/906711514"},"score":1.5,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_4_5","review":"Was a great film,now one of my favorite marvel films but I had one problem and that was hulk he seemed down graded from previous films.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T16:32:41.484Z","updateDate":"2018-05-13T16:32:41.484Z","user":{"userId":"976332247","realm":"RT","displayName":null,"accountLink":"/user/id/976332247"},"score":4.5,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_2","review":"I would give 5.9 out of 10, because it had a bad lighting (the most obvious moment is when they are in Titan and all are backlit), poor dialogues, filler scenes, bad logic (because instead of killing random people could duplicate resources ) also clear, having a lot of superheroes and being that Nick Fury knew what was happening (although it is not very clear in the movie) he decides to keep scratching the navel and at the last moment send a superhero who luckily survived the little breakup realistic of the existing living beings in the film.\nBut of course, the genocidal of Thanos prefers to create an excuse nothing substantiated to make his egalitarian universal massacre caused by a bad perception of reality (Malthusian theory)","displayName":"Ricardo C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T16:22:59.000Z","updateDate":"2018-05-13T16:29:01.000Z","user":{"userId":"977267511","realm":"RT","displayName":"Ricardo C","accountLink":"/user/id/977267511"},"score":2,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_2_5","review":"While it was a good movie because of Thanos and most of the acting, the picture is too dark throughout most of the film (which makes it hard to see), and the acting of Ruffalo (the Hulk) is just down right embarrassing.  The comedy didn't land all that well. Thanos, Strange and Thor save this movie.","displayName":"cole d","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T15:58:07.000Z","updateDate":"2018-05-13T16:01:45.000Z","user":{"userId":"976981270","realm":"RT","displayName":"cole d","accountLink":"/user/id/976981270"},"score":2.5,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_0_5","review":"The movie was all over the place in my personal opinion. From the begining to the end I'm still confused. It was extremely underwhelming.","displayName":"Sasha M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T15:19:37.000Z","updateDate":"2018-05-13T15:21:46.000Z","user":{"userId":"977267457","realm":"RT","displayName":"Sasha M","accountLink":"/user/id/977267457"},"score":0.5,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_5","review":"Infinity War succeeds in bringing together a bunch of mini-Marvel universes into the grand MCU with humor, action, and a bit of drama. While it falters at times, it's overall one of the best action movies of the year and a can't-miss for any Marvel fan. Unfortunately, the ending leaves a lot to be desired for anyone with a bit of intelligence, though I guess its impact would be greater for little kids. The biggest knock on Infinity War is more of an ode to its predecessors - the \"solo flicks\" are just so much better than the \"Avengers flicks\".","displayName":"Andrew R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T15:00:10.000Z","updateDate":"2018-05-13T15:05:10.000Z","user":{"userId":"784290919","realm":"RT","displayName":"Andrew R","accountLink":"/user/id/784290919"},"score":5,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_3_5","review":"After seeing Infinity War a handful of times, I can safely say that I am one of the few in the world who did not enjoy the movie. As much as I loathe how this reinforces my hipster status, there are multiple hang-ups I have with the film I cannot get past. I'll start with the obvious: the heroes lose, largely due to their own \"human\" error. In it of itself, that conclusion doesn't bother me. Characters like Christopher Nolan's Batman or the Daniel Craig iteration of James Bond embody imperfect saviors who are capable of causing destruction the same as preventing it. But while their respective universes were built for that kind of outcome, Infinity War was not. I applaud the risk it took in attempting something different than its large assortment of preceding movies- but it becomes so tonally opposite of these other films, particularly in the intensity of the heroes' flaws and failures, that there is nothing gratifying about re-watching the movie. While the humor is surprisingly (for the first time in a while) on par for the action, reliving the stupid mistakes of characters only made me more frustrated. \n\nThe fact that this is a set-up movie affects my rating as well. To spend two and a half hours watching an incomplete story is wasteful, especially when there was no prior indication that this was anything but a self-sufficient film (at least with Lord of The Rings: Fellowship of the Ring, you knew it was a trilogy). Just as this affects my re-watching the movie, I think over time, once the \"novelty\" of \"losing heroes\" is lost to the following movies in the franchise, people will not be too eager to boot up this experience again. \n\nAvengers Infinity War also misses (like Age of Ultron) what made the first Avengers movie so special. What made The Avengers work so well was that the different heroes across the universe combined to fight the enemy WHILE the enemy had already been adequately introduced. Like in Ultron, significant runtime is devoted to give Thanos a proper intro and backstory to the point that it cuts into the time watching different characters fight together. Thanos deserved a spotlight through the movies that led up to this one, perhaps maybe his own- but to use a considerable amount of this movie's story sharing Thanos's own does a disservice to the actual Avengers, whose solo movies worked up an anticipation as to how they would all intersect in this one. \n\nLastly, not only is the ending to Infinity War partial, it's also open-ended. For all the risk-taking the movie does in conveying fallible heroes, the events in this movie could possibly all be undone in the next one or two movies, by virtue of elements not completely explained. Disney is infatuated with never-ending stories, bringing back characters from the dead and adding new plots, so the ambiguity of certain objects and events shouldn't come as a surprise. It cheapens the experience instead, crying \"wolf\" where danger isn't really dangerous and death can be manipulated. If most or all of what happens in Infinity War can be undone, why not skip the movie altogether?\n\nIf you haven't seen Avengers Infinity War yet, it's worth it to wait until a proper ending to the story.","displayName":"Alex Bonafide A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T14:49:16.000Z","updateDate":"2018-05-13T14:49:23.000Z","user":{"userId":"936698185","realm":"RT","displayName":"Alex Bonafide A","accountLink":"/user/id/936698185"},"score":3.5,"timeFromCreation":"May 13, 2018"}]}