{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcwOTcxMTciLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjZUMTY6MjM6NTAifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84Nzc2NzY0OTAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjZUMTc6MTA6MjAifQ=="},"reviews":[{"rating":"STAR_5","review":"An absolute masterpiece!!","displayName":"Wayne B","displayImageUrl":"https://graph.facebook.com/v3.3/1675456493/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T17:10:20.000Z","updateDate":"2018-04-26T17:11:08.000Z","user":{"userId":"877676490","realm":"RT","displayName":"Wayne B","accountLink":"/user/id/877676490"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"Wow. That is the one word to describe the ending of this film. Through 10 years of storytelling in the MCU, Infinity War is the huge payoff. Epic on so many levels, including interactions between Avengers and Guardians, this film deserves all the praise. The Russo Brothers have done the impossible in tying in so many characters to deliver a film that does not feel forced/too many pointless sub-plots (looking at you Age of Ultron), \nAlthough the film could have used a deeper dialogue between characters, it is understandable why it wasn't done; this is the culmination of many films throughout the last 10 years, so this movie (righteously so) is going 100 from beginning to the post-credit scene (there's one, but a perfect follow-up). Remember the \"villain problem\" MCU films received complaints on? Well, this whole \"phase 3\" has had some of the most memorable ones, including the big bad in the film: Thanos. \nJosh Brolin delivers as the character after the Infinity Stones, and even at times makes you want him to succeed. He has one of the most gut-wrenching scenes a villain has ever had throughout all the MCU films, so he was definitely worth the 10 year build-up.\nThis was such a massive ending for Disney/Marvel, the whole audience was left speechless right when the credits started rolling. People will be talking about this ending for years, especially with the ambiguous ending that Avengers 4 needs to resolve, that it feels as if the movie should have been named Avengers: Infinity War Pt 1. \nAll in all, this movie does not disappoint, as it should be the holy grail for shared universes. From  the die-hard fans to the casual viewer, it is enjoyable for everyone. \nKevin Feige, you're a madman for coming up with this idea of franchise crossovers. \nAnd Russo Brothers, you're the geniuses who pulled it off.","displayName":"Michael Douglas H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T17:07:37.000Z","updateDate":"2018-04-27T11:48:22.000Z","user":{"userId":"943147068","realm":"RT","displayName":"Michael Douglas H","accountLink":"/user/id/943147068"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_4_5","review":"I think it's really exciting to watch all my favorite héroes on the movie, and they're perfectly fine, I feel that the actors have that chemistry, that harmony between them, it's partly what makes it an excellent movie. Thanks to the Russo brothers, cause they did a masterpiece.","displayName":"Victoria V","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T17:06:21.000Z","updateDate":"2018-04-26T17:14:15.000Z","user":{"userId":"977240521","realm":"RT","displayName":"Victoria V","accountLink":"/user/id/977240521"},"score":4.5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"It’s about to go down!!!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T17:03:43.970Z","updateDate":"2018-04-26T17:04:15.746Z","user":{"userId":"882440783","realm":"RT","displayName":null,"accountLink":"/user/id/882440783"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"Unlike every other movie I have reviewed ever we have all waited 6 years for Avengers Infinity War and the time has officially come (well three weeks ago it did I am just always late for everything but you guys know this by now). The Avengers Infinity War is the 19th film in the Marvel Cinematic Universe and is directed by the Russo brothers and stars……… many people who I am not going to list because it will just make the review go on longer than it probably should. And is basically about Thanos played by Josh Brolin and his quest to collect all of the Infinity Stones and all of the heroes find out about this and try to stop it. If you only allow yourself too know that going into the movie it will make the experience 10000x better for you. So I was obviously excited about going to this movie in fact I think all of us were and do I really need too give a reason as to why because I think we all know why. Anyway this is probably the biggest movie event like ever and there was a lot of anticipation for it and I am just going to say it straight out this is my favorite movie in the MCU. This movie had so much to live up to and holy **** (gotta keep it clean) it lived up to Every. Single. One. Of. My. Expectation. The best part about this movie is…….. huh….. guys there is so many things about this movie that I love that I can’t even tell you what my favorite aspect is. ONE of the many best things about this movie is how all of the characters are played out. And the reason I say this is because this is a huge cast and usually when movies have casts that are this big there is always going to be something or someone that is bound to mess up. However that is absolutely not the case here all of the characters are introduced and played out masterfully too the audience. Another thing I loved about this film were the action sequences. Now before I get into detail on those I just want to say for those of you that don’t know the Russo brothers helmed both Captain America: The Winter Solider (2014), and Captain America: Civil War (2016) and if you guys can remember a waaaaaaaaaay back when I started this blog I gave both of those movies five stars. So I wasn’t really surprised too see that they helmed great action sequences in this movie. However unlike both Winter Solider and Civil War were the action scenes relied a lot on shaky cam this movie doesn’t really have a lot of that. And I have to praise them for side stepping that and still managing to make their movie so good. However its not that the movie doesn’t have shaky cam in it just not as much as the previous films that they directed. The movies action sequences are perfect. Yes, they do rely on CGI however the CGI that is used here is like perfect and if we are being completely honest CGI doesn’t suck bad CGI sucks. Another great thing that this movie does is in the films story telling. Unlike previous marvel movies this movie follows three different groups that are doing different things in different locations that are all in the name of stopping Thanos, and because the movie chooses too tell the story that way it leads to a lot of jumping around. But for a movie that jumps around consistently I have to say they pulled it off fantastically. And because the film has so many different locations for our characters it can get a little hectic at times to pay attention to BUT it makes the movie all the more exciting. Now something that I was concerned with going into this movie was how the cast was going to play out because there have been instances where big budget films that have big casts don’t always work for instance The Last Jedi (2017), Independence Day: Resurgence (2016), Suicide Squad (2016), Batman v Superman (2016), etc. That is not the case with Infinity War though everyone in this massive cast have great chemistry, which is almost hard to believe but it is true. This brings me to the next thing I loved about the movie, which are the characters and the performances. Now I do have a couple of favorite characters in terms of Marvel heroes. But in my opinion the best characters in this film were Iron Man, Doctor Strange, and Spiderman. Not only did these three have the best plots in the film but the performances from Benedict Cumberbatch, Tom Holland, and Robert Downey Jr. were all phenomenal. And look I am not at all saying that the other performances and characters sucked I at all I am just simply saying those three in my opinion were my favorites. And because I am on the topic of performances still lets talk about Thanos. HOLY **** Josh Brolin crushed it as Thanos. I have said this probably a million times before in previous reviews but I don’t care I am going to say it again there was no other actor that could have played this character other than Josh Brolin. There have been many years of Thanos build up and the intensity that Brolin gives to this villain was completely worth the wait. This was Brolins best performance since No Country for Old Men (2007). And what is so great about Thanos is as a villain is hes not just a bad guy for the sake of being a bad guy he truly believes that what he is doing is the best thing possible for existence and that he is the hero of his story. Also I have to give this film props for some of the decisions that the Russo brothers made as directors. And the final praise worthy aspect I will give to this movie because this is getting to be a really long review is the guys behind the visual effects. The motion capture work done on Thanos and the way some of these action scenes play out all look phenomenal. Look I saw this movie yesterday and I honestly can not think of a single flaw or something that was out of place with this movie. But I will say this, unlike previous marvel films were you can watch them as just fun action films that isn’t the case with this film you should watch a couple of the previous films or like have an understanding of the other movies before watching this one. However if you managed or manage to watch the movie, and enjoy it without seeing the other ones then good for you (I mean it not being sarcastic). In the end The Avengers Infinity War was fantastic and is a great way to kick start the summer. It had so much to live up to and it truly lived up to the hype. If you are a fan of marvel movies and are looking for an action packed, and sometimes funny film that will keep you on the edge seat then I highly recommend The Avengers: Infinity War for you I guarantee you will not be disappointed. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T17:00:23.295Z","updateDate":"2018-06-18T19:11:05.709Z","user":{"userId":"260000049","realm":"RT","displayName":null,"accountLink":"/user/id/260000049"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"Finally got to the show to see it three weeks after it opened. I had seen some of the critic reviews and was a little worried ... I should know not to listen to them after they gave Black Panther such a glowing review that it didn't deserve, IW was the fastest two hours and 40 minutes I've ever had. Enjoyed every minute of it, only bad thing waiting for the finale in infinity wars 2. If you're a fan of the Marvel Universe, I mean a real fan with decrement, you're gonna love this movie.","displayName":"Pamela L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T16:54:03.000Z","updateDate":"2018-05-16T16:17:39.000Z","user":{"userId":"938847020","realm":"RT","displayName":"Pamela L","accountLink":"/user/id/938847020"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"What civil war should have been!!!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T16:37:12.732Z","updateDate":"2018-04-27T03:42:37.627Z","user":{"userId":"904679038","realm":"RT","displayName":null,"accountLink":"/user/id/904679038"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"so exciteddddddddddd","displayName":"Caleb W","displayImageUrl":"https://graph.facebook.com/v3.3/1847821563/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T16:35:52.000Z","updateDate":"2018-05-13T03:16:20.000Z","user":{"userId":"955475625","realm":"RT","displayName":"Caleb W","accountLink":"/user/id/955475625"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_4","review":"Avengers: Infinity War (2018) isn't flawless, but it sure is one hell of a ride! It's an emotional rollercoaster of excitement, thrills, laughs, and gasps that will leave the audience stunned, and wanting more. The film attempts to balance its large ensemble of talented cast members and does so with incredible focus and cohesion. Some of our beloved heroes take a back seat on this one, giving the spotlight to the highly-anticipated purple supervillain, Thanos. Josh Brolin's motion-capture performance is extremely captivating, and the incredible attention to detail on the intricate expressions and modeling of the fully-CGI character is breath-taking to behold. Thanos is easily one of the best and memorable villains in a comic book film ever. Tons of surprises for die-hard MCU fans! Great character interactions, spectacular action sequences, and the stakes are higher than it's ever been before. Alan Silvestri's score truly elevates the film's grandeur and seamlessly weaves the frequent shifts in tone. Infinity War is a cinematic event that no one should miss.","displayName":"Amir L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T16:30:05.000Z","updateDate":"2019-03-01T19:51:31.000Z","user":{"userId":"977240481","realm":"RT","displayName":"Amir L","accountLink":"/user/id/977240481"},"score":4,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_4_5","review":"really good film filled with thrilling action sequences, great special effects, great characters, good humour and heavy emotion. Another big positive is i didnt feel it's run time and wasnt bored once.\nA couple of very minor nitpicks, and at times felt like they were trying to squeeze in a lot, but overall definatly lived up to it's hype, and a brilliant addition to the Avengers Canon.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10209569148860196/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T16:23:50.000Z","updateDate":"2018-04-26T16:26:48.000Z","user":{"userId":"977097117","realm":"RT","displayName":null,"accountLink":"/user/id/977097117"},"score":4.5,"timeFromCreation":"Apr 26, 2018"}]}