{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzU2NzIyNTgiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjlUMjI6MDM6MDguODU4WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzU1MjY0ODMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjlUMjI6MTQ6NTkifQ=="},"reviews":[{"rating":"STAR_4_5","review":"(Spoilers)\nI loved this movie. I understand why someone would say that it is overstuffed, too long, unfocused. But as I watched the movie, it was refreshing that these thoughts did not come to mind. Being a facsinated fan since the age of 11 while watching the first Avengers, this movie was very special to me. I grew up with these heroes and have watched almost every single marvel movie in theaters. All these movies have been leading up to this moment, the fight against Thanos. I didn't know how they would pull off so many characters in one movie, but they did. I admit that it didn't have too much time to focus on characters individually but the dialogue and interactions between everyone was so much fun. Everyone fit well together fighting side by side. And the heartbreak. Oh how I almost cried. These characters you've followed for so many years and invested so many hours into struggling and failing. Dying. It was heartbreaking but necessary. It set the stakes high, this is the boss level after all and you felt it. No more easy villians. Thanos is a decently interestingv villian but nothing we've never seen before. Big bad space guy, wants to destroy half the universe to ensure its survival etc. etc. But he was still pretty engaging in his fights against the heroes. In regards to visuals, I mean i expect nothing less from what Marvel delivered. The fight scenes were exciting and fast-paced, beautiful space visuals, great shots. Just attractive in general. Watching these with my parents who did not really remeber the years of marvel movies, they were pretty unfazed for what happened. It made me realize that if you do not remember everything that has happened in the universe, do yourself a favor and catch up on stuff so that you can enjoy this movie to the fullest extent.  The Russo borthers had a huge space for error yet they made this movie the best it could be. Having so many chracters in one movie could make it feel like their was no breather but splitting it into two parts help open up space.  \nI know, im rambling. In conclusion, great humor, heartbreaking scenes, amazing visuals, incredible characters, ambitious yet effective strotytelling.","displayName":"Giovanna A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T22:14:59.000Z","updateDate":"2018-04-29T22:39:01.000Z","user":{"userId":"975526483","realm":"RT","displayName":"Giovanna A","accountLink":"/user/id/975526483"},"score":4.5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_0_5","review":"Highly agitated movie watcher. This movie was disjointed. You can do better Marvel.","displayName":"Adrien D","displayImageUrl":"https://graph.facebook.com/v3.3/360962344284615/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T22:14:52.000Z","updateDate":"2018-04-29T22:23:14.000Z","user":{"userId":"976017828","realm":"RT","displayName":"Adrien D","accountLink":"/user/id/976017828"},"score":0.5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_4","review":"It just blew me away","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T22:10:55.356Z","updateDate":"2018-04-29T22:10:55.356Z","user":{"userId":"893553897","realm":"RT","displayName":null,"accountLink":"/user/id/893553897"},"score":4,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Heartbreaking, but absolutely amazing.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T22:08:23.650Z","updateDate":"2018-04-29T22:08:23.650Z","user":{"userId":"260012170","realm":"RT","displayName":null,"accountLink":"/user/id/260012170"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Thousands of jaw-dropping scenes. Truly emotional and the fan payoff is insane. Although not many people understood the reference, I'm glad a friend of mine told me about him. Mar-vell? :)","displayName":"Oliver T","displayImageUrl":"https://graph.facebook.com/v3.3/533862056780127/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T22:07:26.000Z","updateDate":"2018-04-29T22:11:24.000Z","user":{"userId":"971577144","realm":"RT","displayName":"Oliver T","accountLink":"/user/id/971577144"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Was worried about juggling ALL of these amazing characters in one film and getting enough screen time for them........oh my goodness GREAT film. Deserves a higher rating.  Get in the 90s!!!!","displayName":"Robert H","displayImageUrl":"https://graph.facebook.com/v3.3/100003920015054/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T22:06:59.000Z","updateDate":"2018-04-29T22:09:28.000Z","user":{"userId":"970780126","realm":"RT","displayName":"Robert H","accountLink":"/user/id/970780126"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_3_5","review":"Full of action, a spectacle of non stop action with all of the characters from all the movies put together. It was fun and I loved all of the funny one liners from Thor, Spider-Man, and Starlord. It was emotional for a superhero movie and combined the characters’ stories well. I did not like the ending, I much prefer applauding at the end to a movie rather than feeling gypped and saying, “It’s over?”, especially after 2 1/2 hours! The ending was not an ending, it was a sad cliffhanger and an ending undeserving to its superheros that we have come to love and cheer for. Many kids were bummed by the ending and many adults felt let down, however the first 2 hours and 15 minutes were great! ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T22:06:33.166Z","updateDate":"2018-04-29T22:07:12.087Z","user":{"userId":"926085750","realm":"RT","displayName":null,"accountLink":"/user/id/926085750"},"score":3.5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_4","review":"There is so much to take in and absorb in Marvel's penultimate film in the culmination of the Marvel cinematic universe that it is hard to write a concise and to the point review. Will suffice to say that Infinity War is one hell of a movie and a lesson in superhero film making to the DCEU. Infinity War picks up after the events of Thor Ragnarok, Black Panther and Guardians 2 with the almighty Thanos seeking out the remaining infinity stones to complete his collection and snuff out half the universe's population with a click of his fingers. It is not an easy job handling so many characters, give them depth and time but Russo brothers do it with such great style that nobody feels left out. The movie benefits from MCUs trademark comic style, humorous and for the first time is heavy on emotion. There are a lot of heart rendering moments as well as a lot of complicated relationships especially between Thanos and Gamora and it is so amazing to see that for once you can hate as well as kind of agree with Thanos' intentions and identify with his psyche. Josh Brolin's Thanos gets the lion's share as far as script and screen time is concerned and thankfully the movie doesn't pan out into a mind numbing CGI chaos. I thoroughly enjoyed the multiple hoots and cheers for MCUs stars as they made their more than awesome entries and re-entries into the film. You know you are witnessing a true blockbuster when you experience that. The second installment of Infinity War comes out next year with a very interesting post credits scene in this film that signals the arrival of a major MCU character. I can't wait to see what happens when Thanos meets his match!","displayName":"Kaustubh H","displayImageUrl":"https://graph.facebook.com/v3.3/506031367/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T22:06:11.000Z","updateDate":"2018-04-30T00:40:50.000Z","user":{"userId":"800041764","realm":"RT","displayName":"Kaustubh H","accountLink":"/user/id/800041764"},"score":4,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_3","review":"This movie entertained me!  Epic battles, I laughed, cried, was impressed with the CGI, decent story (doesn't hurt that a decade of buildup helped with that).  One of the best MCU flicks.","displayName":"Bug M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T22:03:18.000Z","updateDate":"2019-02-16T20:03:59.000Z","user":{"userId":"977088393","realm":"RT","displayName":"Bug M","accountLink":"/user/id/977088393"},"score":3,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_2_5","review":"I feel this movie could of made 2 or 3 Avenger movies to make more money and have the story mode with more action with all the characters. Putting all the characters in one was a mistake.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T22:03:08.858Z","updateDate":"2018-04-29T22:03:08.858Z","user":{"userId":"975672258","realm":"RT","displayName":null,"accountLink":"/user/id/975672258"},"score":2.5,"timeFromCreation":"Apr 29, 2018"}]}