{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwODY0NjUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjlUMTA6MjA6MTkuMDE4WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MDU1NDUyOTMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjlUMTA6MzI6NTUifQ=="},"reviews":[{"rating":"STAR_5","review":"Masterpiece!!! I cannot describe how fantastic this movie is, it's just amazing, amazing, amazing. Woooooooooooooooooooooooooooow. Ten years and the wait bring to us one of most unforgettable movie of the all times. Incredible. (5/5)","displayName":"João P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T10:32:55.000Z","updateDate":"2018-04-29T10:34:17.000Z","user":{"userId":"905545293","realm":"RT","displayName":"João P","accountLink":"/user/id/905545293"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_4_5","review":"B+ (8.5/10)\nAvengers: Infinity War is another entertaining addition to the MCU, capable of balancing emotional storytelling with the exhausting high stakes action.\n\nSTORY: 3/4  Although it evokes shades of \"I've seen this before,\" the story here is simple, effective, and makes good use of all the previous films and characters.\n\nSCRIPT: 3/4  The screenplay can be cheesy sometimes and forgo logic, but the dialog and action are clearly well-written for the most part; there are twists and turns, mouthwatering character combinations, and a whole sequence dedicated to building an ax in space.  I mean, come on.  It's pretty awesome.\n\nCHARACTERS: 3/4  For a cast of characters this size, Marvel pulled it off.  Each character is given their moment to shine, and those who get the most moments are still as fun and memorable as they are in the previous movies.  People die in this one, adding to the stakes and heightening the action, and making you actually care for the characters instead of just passively watching mindless CGI trash (Justice League).\n\nDIRECTION: 4/4  Remember, this is directed by the Winter Soldier/Civil War directors.  They've proved time and again--and here as well--that they can handle these movies.  They got the tone right, they got the action right, and they got the characters right.  It's an impressive feat, and although no director can make a movie alone, what the Russo Brothers have accomplished is commendable.  The film is thankfully not a cluster****.\n\nCINEMATOGRAPHY: 4/4  Avengers: Infinity War is pretty well-shot, no complaints there.  The colors are great, the action looks good, the shot composition is neat... Whoever did it will probably continue to get jobs in the industry I guess.\n\nPERFORMANCES: 3/4  It's hard for every actor to be good all the time in every scene in a movie this size, and no it isn't Oscar bait.  Yet each performance had something nuanced about it, even if some of the line delivery was a bit meh, but that's also due to the script.\n\nEDITING: 4/4  Flawless.  Instead of constantly cutting between scenes, what we get is chunks of each subplot, and they're all quite well-strung together, and not without pretty good pacing because the movie didn't feel too long.\n\nSOUND: 4/4  The Marvel movies always have great sound, and here is no exception.  The sound is transportive and realistic.\n\nMUSIC: 3/4  The musical score was better and more exciting than previous Marvel installments, especially the other Avengers movies.\n\nACTION/SFX: 3/4  The story does take a backseat to the action for much of the film for sure, but you actually care about the characters--even the antagonist--making the action exciting and unpredictable.  It's clear, well-shot, well-edited action with some questionable CGI but overall pretty balanced. \n\nOVERALL - 8.5/10\nThe story is kind of standard, but Avengers: Infinity War is fun, awesome, and a well-earned success for Marvel.","displayName":"Movie R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T10:32:27.000Z","updateDate":"2018-05-23T14:11:16.000Z","user":{"userId":"976845912","realm":"RT","displayName":"Movie R","accountLink":"/user/id/976845912"},"score":4.5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"A very good movie but don't go expecting a finale. This is a lot of very well thought out, well planned story lines converging into an outcome that we won't see until next year..... Very much the way The Empire Strikes Back was in the original Star Wars trilogy. It stands well on it's own but I think the best is yet to come.","displayName":"Michael K","displayImageUrl":"https://graph.facebook.com/v3.3/100006025172084/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T10:29:23.000Z","updateDate":"2018-04-29T10:35:17.000Z","user":{"userId":"958585489","realm":"RT","displayName":"Michael K","accountLink":"/user/id/958585489"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_4","review":"A great 'popcorn' movie. Go, sit, eat popcorn and get lost in a great, fun movie. Hats off the the Russo Bros. Must mention Josh Brolin as Thanos, superb performance. Looking forward to the sequel.","displayName":"Mark H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T10:28:59.000Z","updateDate":"2018-04-29T10:33:30.000Z","user":{"userId":"977202313","realm":"RT","displayName":"Mark H","accountLink":"/user/id/977202313"},"score":4,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Exactly how a movie should be made. Bringing together ten years of good to excellent movies. From Capt. America to the Vision, outstanding. The villain, Thanos, perhaps the greatest comic villain in any superhero movie. It will never happen but I'd put Josh Brolin up for an Academy Award any day of the week. The layers to his villain are incredible. An unexpected benefit of this movie was Thor ending up one of the most popular, if not the most popular hero in the MCU. Just my thoughts without going into to much detail. Hope you enjoy the movie!","displayName":"Richard R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T10:28:26.000Z","updateDate":"2018-05-31T15:29:24.000Z","user":{"userId":"505958163","realm":"RT","displayName":"Richard R","accountLink":"/user/id/505958163"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Marvel's 10 year culmination has come true. The film is everything you're hoping for and yet nothing like what you're expecting. It's epic, visually stunning, funny, dark, and emotional as Marvel unleashes their greatest and and scariest threat ever put to screen: Thanos.","displayName":"Facebook U","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T10:27:57.000Z","updateDate":"2018-04-29T10:34:40.000Z","user":{"userId":"942006216","realm":"RT","displayName":"Facebook U","accountLink":"/user/id/942006216"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Wow. Just wow. It's extremely rare that a blockbuster lives up to its extremely high expectations, and even rarer that it exceeds them. It's a common phenomenon to see ones that crumble under the weight of their predecessor's successes. Infinity war is the culmination of over 18 movies, an inevitable result of over a decade of thought-out, masterful planning, and in many ways, makes you rethink the definition of a great movie should contain; no, this isn't hyperbole, read on if you're curious why.\n\nThis movie, by no means, should have been a success. Even in hindsight, it is confoundingly bizarre. With over 50 main characters, facing off against a singular entity in the possession of unimaginable, exaggerated power,who has yet to be developed, should've been impossible. But this movie works for the sole reason that it exists, its nature. It embraces the fact that its a superhero movie, the fact that its standing on a stage which has painstakingly been built over the course of 18 movies, and the fact that its a Marvel movie. Make no mistake, this not an adventure movie like LotR which can afford one major fight sequence and hours of face-to-face talking, this is a movie that realizes its an action movie, its scope by keeping your right on the edge of your seat for the entirity of its run, and blatantly tells that \"We've spent a DECADE developing the characters, you know who they are, and why they're here. Now let's have some fun bumping them off each other\" and for good reason. With a cast of gigantic proportions, each of them who have their own part to play in a story, its highly unreasonable to expect any sort of character development, quite odd considering its one of the hallmarks of great cinema.\n\nThe film is by far, the darkest movie Marvel has ever graced the screen with, and the darkest superhero movie of all time, save for Watchmen. Notwithstanding that, it seems odd that there is no shortage of one-liners, all of which that work really well while keeping in line with the established ethos of the character involved. There are very few scenes that exude humor, however, they do serve as respite against the movie's grim, apocalyptic backdrop. All characters are utilized perfectly, given proportional screen time. Gamora, in particular, has a fleshed out arc, and Thor, Iron Man and Banner all get stand-out moments. \n\nThe movie is extremely fast paced, and warrants multiple viewings to fully appreciate its qualities. It has no slow and/or weak moments, and keeps you on the edge of your seat till you exit the theater (After which it haunts you for an unreasonably long time). Make no mistake, this is Thanos's movie, and he is irrefutably the protagonist of the movie. This is HIS story, evident by the end, and the movie does a surprisingly good job of making him a sympathetic, resonant character, yet one that is commanding, frightening, and one that scares the audience and heroes alike with his intentions every time he makes an appearence.\n\nThe third-act deserves unimaginable praise; this is Marvel's Empire Strikes Back. It's that good, with a devastating gut-punch of a cliffhanger. Nay,its even better. Its one that leaves you with an assortment of emotions, the big pay off; the endgame, Those are the moments that the movie leads up to, and they are gloriously executed. Casual moviegoers might be a bit shocked, people who have little knowledge of the MCU will be speechless, and for the fans? Make no mistake, they will require a therapist to sort out their mind by the end of the movie. \n\nThere you have it.Infinity War might not be seen as one of the greatest movies ever by the academy, but there are excellent reasons why it should. It does't do things the way normal movies do, it doesn't develop any main character completely, its strength does not lie in its grounded nature, it jumps from planet to planet and its based off of a highly successful run of comics decades ago. Yet, movies have gotten to the point where we have to second-guess what the definition of a good movie is. Doesn't the very fact that it subverted expectations to be a good movie when it should've been a mess qualify it as something special? Doesn't the fact it lives up to the hype levels despite being the biggest movie ever warrant applause? Doesn't the fact that it is a culmination of 18 movies and that it gives each character wonderful moments without ever feeling stuffed to most people mark it as a cinematic achievement? And lastly, doesn't the fact that the movie has a strong protagonist (Thanos), make you laugh, cry, pump your fist in the air like a manic by experimenting with already fully developed characters make it extremely versatile? This movie gets SO MUCH right, so incredibly right, and anyone who has seen what the MCU has to offer will leave the theater in a haze. \n\nFranchises have long been derided for a variety of reasons, sequels, in particular, have never been taken seriously for not standing on their own two legs, for replying on the first movie to set the characters and their motivations. Infinity War is a testament to why this question in particular should be revisited, how a movie that relies on so many that come before it could do something so amazing. Because, truly, its a nigh-impossible task to take 18 movies worth of build-off and create something magical. And that deserves credit.","displayName":"Thejus R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T10:27:44.000Z","updateDate":"2018-05-01T08:24:47.000Z","user":{"userId":"977245842","realm":"RT","displayName":"Thejus R","accountLink":"/user/id/977245842"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Best marvel movie ever?","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/2041317492790825/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T10:25:56.000Z","updateDate":"2018-04-29T10:26:14.000Z","user":{"userId":"977248593","realm":"RT","displayName":null,"accountLink":"/user/id/977248593"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"First time I have ever watched a movie 2 nights in a row. If only Star Wars could plan ahead and put out 19 great movies in a row.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10156138953324836/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T10:20:51.000Z","updateDate":"2018-04-29T10:22:48.000Z","user":{"userId":"976932528","realm":"RT","displayName":null,"accountLink":"/user/id/976932528"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_4_5","review":"The only reason this isn’t getting 5 stars is because I’m a weird dude that doesn’t believe in absolutes. This was amazing, easily the best of the MCU so far. I didn’t even mind the cliff hanger and eagerly await the next installment. I’d get more into it but if you’re thinking of seeing it then you don’t want spoilers. Go watch Infinity War. You will not regret it. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T10:20:19.018Z","updateDate":"2018-04-29T10:20:19.018Z","user":{"userId":"260086465","realm":"RT","displayName":null,"accountLink":"/user/id/260086465"},"score":4.5,"timeFromCreation":"Apr 29, 2018"}]}