{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNzM3NjkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMTdUMjI6MTI6MjIifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MTcwNzIyNjYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMThUMDQ6NDY6NTAifQ=="},"reviews":[{"rating":"STAR_3_5","review":"Marvel fans have spent the last ten years and eighteen movies engrossed in a variety of superheroes and villains duking it in order to save Earth and other galactic empires. Some have proven more successful than others, yet Marvel fatigue never seems to set in even after all these years. They're coming off one of my favorites and their biggest hit to date, Black Panther, which came out in February. A few of those characters along with roughly thirty other Marvel heroes are coming together for the first time to take on the ultimate villain, Thanos, portrayed by Josh Brolin via motion capture technology. Infinity War picks up with Thanos and his army of minions capturing a space station carrying Thor (Hemsworth), Loki (Hiddleston), and the Hulk (Ruffalo). Thanos is looking for the tesseract which holds one of six infinity stones he's looking to get his hands on. His massive golden glove holds the power once all six stones are set in place. The stones represent six different elements: time, reality, space, mind, power, and soul.\n\nIf you've been following along with every other movie, you may remember that these stones are in hiding for this very reason. The time stone is guarded safely around Doctor Strange's (Cumberbatch) neck, but when the Hulk is transported back to New York, Strange and Iron Man (Downey) know something must be up. What the Hulk doesn't know is that the Avengers separated ways following the events of Captain America: Civil War making this new mission against Thanos a bit complicated. One of the other stones coming into play is embedded into the forehead of Vision (Bettany) who's off in hiding with Scarlet Witch (Olsen). Thanos and his swarm don't make it easy for any of our heroes who are forced to make life-altering decisions in order to save their loved ones and the galaxy from Thanos' reign.\n\nAt the helm of this giant epic are brothers Anthony and Joe Russo who are no strangers to the Marvel Cinematic Universe having brought the previous two Captain America films to the big screen along with writers Christopher Markus and Stephen McFeely. The four of them are a winning team, and frankly, the only ones who could have brought everyone together given their stake in the MCU. We, the audience, may know all of these characters inside and out, but it's easy to forget that the characters don't always know each other, and they've done an remarkable job at pairing them together. It's fun to see the supremely arrogant nature of Tony Stark try to match knowledge and wit with the like-minded Doctor Strange. The Guardians of the Galaxy led by Star-Lord (Pratt) answer a distress signal that comes from the spaceship Thor was on that opens the film. The banter perfectly fits for the brawny Thor trading jabs with the dashing Star-Lord who's used to being the number one man in charge of his ship. Without giving too much away, the writing team makes good use out of sending part of our team to Wakanda to meet Black Panther (Boseman), Okoye (Gurira), and Shuri (Wright).\n\nInfinity War is the first of a two-part conclusion to this chapter. Avengers 4 is due in theaters next year. Going in with the right expectations is key if you think of it like Harry Potter and the Deathly Hallows Part I or The Hunger Games: Mockingjay Part I. By nature, these films don't have the traditional arc or character development we're used to from other movies in the series. Marvel doesn't need to fully develop these characters all over again as that's what the first eighteen movies were for. Instead the writing duo have the daunting job of trying to cram in as many characters as possible while adhering to their individual voices as laid out by previous writers. Some characters like Tony Stark/Iron Man or Steve Rogers/Captain America are aged and weathered having been put through the ringer far too many times. They don't have the plucky attitude of the teenage Spider-Man (Holland). A majority of them just feel like they're supporting roles with limited dialogue as they're separated into different groups each in their own combat battle. It's as if we're watching a season of Game of Thrones played out where you're going from one group of characters and their storylines to the next. It may be fifteen or twenty minutes before someone like Iron Man or Star-Lord returns on screen. We only really get each character a fraction of the time that we're used to and then clamoring for them to hopefully be united as one army by the end.\n\nWhat we do see here are a few new relationships played out that are vital in giving this story an emotional weight behind it. The father/daughter relationship between Thanos and Gamora (Saldana) is brought to the forefront to the point of us seeing a backstory between them with flashbacks to young Gamora. The other relationship worth noting is the romantic one between Scarlet Witch and Vision. This provides them with some of their best moments in all of Avengers movies.\n\nThe film comes with a hefty run time of two and a half hours, yet the Russo brothers know there is no time to waste and get the ball rolling with an explosive opening. Thanos makes his presence known, and we get our first taste of the fatalities at hand. There's really no slowing down from there, and the runtime flies by faster than expected. It culminates into a massive battle sequence in Wakanda as well as a few other locations. This is a war film after all, and it's far darker in tone and atmosphere than say the bright Guardians of the Galaxy movies or even Thor: Ragnarok. The cinematography is quite moody adhering to dark blues, grays, and purple tones. As the final scenes were playing out, I wanted the Russo's to have made some bolder, more definitive choices. Given the major death that occurs in the opening, I wanted that same emotional punch to happen again, but I was left in a state of befuddlement. On one hand, it ends with a giant cliffhanger as everything holds in the balance as to where it's going to go next. The Russo's leave it up to the viewer to determine what just played out in the final moments. Some may see it as the end, but knowing that there's another film makes it all the more ambiguous and open for the rules to be changed.\n\nAvengers: Infinity War is a tricky one as it doesn't quite feel complete given it's natural order within the collective universe, and for the fact it's the really the first half of this story. The Russo's remarkably unite our heroes together, and it's great fun to see their initial interactions together. There are plenty of witty one-liners with jabs passed from one character to another as well as a self-deprecating nature to this idea of a character heavy movie. One character clarifies that there's both an Ant-Man AND a Spider-Man. Josh Brolin does an admirable job at bringing Thanos to life without drowning under the motion capture. He's a brutal and unapologetic villain. There are a few new characters that come with his army, but I wouldn't call any of them memorable. The end leaves you wanting more as there are far too many questions left unanswered. No Marvel fatigue yet, but hopefully by the the end of Avengers 4 I will feel emotionally exhausted, which should have happened with this movie.\n\nIs It Worth Your Trip to the Movies? Buckle up Marvel fans\n\nRATING: 3.5 out of 5 TICKET STUBS","displayName":"Paul M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-18T04:46:50.000Z","updateDate":"2018-05-18T04:46:52.000Z","user":{"userId":"917072266","realm":"RT","displayName":"Paul M","accountLink":"/user/id/917072266"},"score":3.5,"timeFromCreation":"May 18, 2018"},{"rating":"STAR_5","review":"A must watch film, never cried so much and enjoyed it so much while watching the film. Greatest film ever definitely be back for 6th round. Absolutely hype for the next one","displayName":"Ash A","displayImageUrl":"https://graph.facebook.com/v3.3/788429317993433/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-18T03:59:42.000Z","updateDate":"2018-05-18T04:04:59.000Z","user":{"userId":"976533749","realm":"RT","displayName":"Ash A","accountLink":"/user/id/976533749"},"score":5,"timeFromCreation":"May 18, 2018"},{"rating":"STAR_2","review":"Bad Plot, should not be made.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-18T03:40:36.971Z","updateDate":"2018-05-18T03:40:36.971Z","user":{"userId":"975625734","realm":"RT","displayName":null,"accountLink":"/user/id/975625734"},"score":2,"timeFromCreation":"May 18, 2018"},{"rating":"STAR_5","review":"Great movie, non-stop action and over the top twists and turns. Must see!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-18T03:11:54.539Z","updateDate":"2018-05-18T03:11:54.539Z","user":{"userId":"941799077","realm":"RT","displayName":null,"accountLink":"/user/id/941799077"},"score":5,"timeFromCreation":"May 18, 2018"},{"rating":"STAR_5","review":"Another slam dunk for Marvel. Enjoyed the movie - will definitely be seeing it again in theaters to catch all the things I might have missed.","displayName":"Jordan C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-18T01:45:44.000Z","updateDate":"2018-05-18T01:50:47.000Z","user":{"userId":"977273992","realm":"RT","displayName":"Jordan C","accountLink":"/user/id/977273992"},"score":5,"timeFromCreation":"May 18, 2018"},{"rating":"STAR_5","review":"A monumental task that works out almost perfectly, managing to balance colourful fun and tragedy remarkably well. While some things are fairly linear and predictable, the overall package is vibrant, rich, and engaging.","displayName":"Pietro P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-18T01:26:23.000Z","updateDate":"2018-05-19T00:30:20.000Z","user":{"userId":"977273989","realm":"RT","displayName":"Pietro P","accountLink":"/user/id/977273989"},"score":5,"timeFromCreation":"May 18, 2018"},{"rating":"STAR_2","review":"As usual with the MCU, the fun and jokes are great. But the high-stakes premise called for dramatic weight and tension that just isn?t there at all.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-18T00:45:12.133Z","updateDate":"2018-12-29T20:51:45.625Z","user":{"userId":"975843687","realm":"RT","displayName":null,"accountLink":"/user/id/975843687"},"score":2,"timeFromCreation":"May 18, 2018"},{"rating":"STAR_4","review":"A Marvel film which finally manages to find the balance between heart, humour and action.","displayName":"Jake L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-17T23:30:22.000Z","updateDate":"2018-05-20T14:30:00.000Z","user":{"userId":"937590014","realm":"RT","displayName":"Jake L","accountLink":"/user/id/937590014"},"score":4,"timeFromCreation":"May 17, 2018"},{"rating":"STAR_5","review":"One of the best movies I've ever seen. Marvel Studios did an excellent job building up to this moment. Even though the grand finale was a bit underwhelming, the movie as a whole is fantastic!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-17T23:30:20.093Z","updateDate":"2018-05-17T23:30:20.093Z","user":{"userId":"260133628","realm":"RT","displayName":null,"accountLink":"/user/id/260133628"},"score":5,"timeFromCreation":"May 17, 2018"},{"rating":"STAR_4_5","review":"Loved this film. Saw it in 3d in Imax and could not get enough of it. I cant want to see what happens next :)","displayName":"simone%20%20 w","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-17T22:12:22.000Z","updateDate":"2018-05-17T22:13:43.000Z","user":{"userId":"977273769","realm":"RT","displayName":"simone%20%20 w","accountLink":"/user/id/977273769"},"score":4.5,"timeFromCreation":"May 17, 2018"}]}