{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzIxNDE0MDQiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMDI6MzU6NTkifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwNjUyMjciLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMDI6NDg6MTQuMjE1WiJ9"},"reviews":[{"rating":"STAR_5","review":"Hands down best mcu movie to date","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T02:48:14.215Z","updateDate":"2018-04-27T02:48:14.215Z","user":{"userId":"260065227","realm":"RT","displayName":null,"accountLink":"/user/id/260065227"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Go see this movie, whether you are a comic/superhero fan or not, you will be blown away.","displayName":"Aaron W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T02:47:58.000Z","updateDate":"2018-04-27T02:55:06.000Z","user":{"userId":"977241715","realm":"RT","displayName":"Aaron W","accountLink":"/user/id/977241715"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4","review":"Thanos is not only the hero we needed, he is the hero we deserve.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T02:45:45.291Z","updateDate":"2018-08-24T01:23:13.532Z","user":{"userId":"900992727","realm":"RT","displayName":null,"accountLink":"/user/id/900992727"},"score":4,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4","review":"Sad how everyone dies. So many fans in the theater left crying. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T02:45:20.688Z","updateDate":"2018-04-27T02:45:20.688Z","user":{"userId":"953768186","realm":"RT","displayName":null,"accountLink":"/user/id/953768186"},"score":4,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"I went to into Avengers: Infinity War with high hopes and holy sh*t I wasn't disappointed! Right from the get go Thanos shows off how much of a threat he is to not just Marvels heroes but to the universe itself. \n\nThroughout the film my jaw was on the floor or I was cheering through the fights as they have you on the edge of your seat, just waiting to see the outcome. \n\nWithout spoiling the movie, the ending will shock everyone that watches the movie. It will make the wait for Avengers 4 that much more unbearable! But do go see this movie NOW! It's now rated my favourite film of all time.","displayName":"Kyle C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T02:43:10.000Z","updateDate":"2018-04-27T02:43:10.000Z","user":{"userId":"957932793","realm":"RT","displayName":"Kyle C","accountLink":"/user/id/957932793"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Wow.  The Russo brothers totally delivered!  I was afraid that this movie would have a bunch of cheesy CGI battle scenes, much like the battle scenes in Black Panther (sorry, I was very underwhelmed by that movie).  But that was not the case.  All the battles in Infinity War were so expertly done, it looked so realistic, and gripping, and epic!  Still in shock that the movie was so good.  When I saw that the critics score on Rotten Tomatoes was only 86%, I started to get really nervous that it would only be mediocre.  Went with my wife, and my teenage son, and we all loved it!  Thanks, Marvel, and all you amazing actors and workers for teaming up and treating usl to an amazing film!  Such heart in this film.  We're all sitting here at home trying to recover from the emotional journey you just took us on.  Great stuff!!!  'Nuff said.","displayName":"Craig P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T02:40:35.000Z","updateDate":"2018-04-27T02:45:23.000Z","user":{"userId":"977241703","realm":"RT","displayName":"Craig P","accountLink":"/user/id/977241703"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4","review":"If you were to culminate almost every element the MCU has been building up to at this point in time then you get the most gargantuan cinematic event of 2018. This film does it's part in delivering the epic scope and spectacle such a film directed by the Russo's is able to deliver crossing all manner of locations and settings all tied to their biggest ever threat; Thanos, exceptionally played by Josh Brolin. While the overabundance of all these heroes, conflict and settings can be jarring from standing point, eventually due to it's culminating of the entire plot it all fits together to be the massive bloated epic it was pitched to be. Even in it's incredibly long 2 hours and 40 minutes run-time, it's build up can be slow, but be prepared cause it's all worth it when the pacing picks up it's speed. Even whilst delivering on the cathartic twists and turns this franchise has built upon, it's worth every minute up until the penultimate end-credit sequence. Overall, great scope, action, team-ups, twists and style/direction the franchise is being taken delivering upon the hype needed for such a massive event of a film, needed to be seen on the big screen.","displayName":"Luke E","displayImageUrl":null,"isVerified":false,"isSuperReviewer":true,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T02:40:13.000Z","updateDate":"2018-04-27T03:36:49.000Z","user":{"userId":"905413030","realm":"RT","displayName":"Luke E","accountLink":"/user/id/905413030"},"score":4,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_3_5","review":"It's a bit of fun, if stretched a bit thin.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T02:39:08.388Z","updateDate":"2018-04-27T02:39:08.388Z","user":{"userId":"911873801","realm":"RT","displayName":null,"accountLink":"/user/id/911873801"},"score":3.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Wow. Just wow. A lot of moving parts but flows together very well for one hell of an ending. Well done Marvel. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T02:36:17.914Z","updateDate":"2018-04-27T02:36:17.914Z","user":{"userId":"976516740","realm":"RT","displayName":null,"accountLink":"/user/id/976516740"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"FINALLY.. It's SPOILER-FREE so Go Ahead..\n\nWe've waited 10 years for this Mega Showdown.. Well, I'll say, Worth The Wait.. The Debts been paid off.. :B It's MASSIVE.. Huge Sets, Awesome Cinematography, Fantastic Actors, Characters we've known since the first Iron-Man.. All in One movie, Together.. Fangasm.. :3\n\nSo, the story was so secret nobody knew what's gonna happen.. except the Director-duo & the editor.. But Thanos is Bad news for the Avengers.. It's not Spoiler, guys, you know it.. He can wipe out half the universe with just the snap of his fingers.. Just like that..\n\nThanos is the Mad Titan as they say.. He won't listen to anybody.. He's Ruthless.. Wants to collect all 6 Infinity stones to rule the Universe as he see fit.. Can he manage to do that.? Well the movie has been made to get some answers.. So Go.. Get them..\n\n~ Starky, Ma Man RDJ in the house, baby.. uh-ah.. Started this MCU journey with the first Iron-Man.. Glad that happened..So perfect Starky.. :B\n\n~ Thor, Hemsworth.. He's a God.. Can't say much.. ;) But He was Awesome..\n\n~ Banner, :D :D didn't write Hulk there.. Watch the movie.. Ruffalo was so funny.. He's the Most Humorous Avenger (Of course after Starky)\n\n~ Cap Stave Rogers, as we live & breathe.. 150 year old dude, still kicking A.. THE BEST ENTRY ANY SUPERHERO COULD EVER HAD.. LOVE & SALUTE YOU, EVANS.. :B\n\n~ Natudi.. Romanoff.. How can one manage to stay Fit for that long.? Hats Off :B  ScarJo Forever :3 :*\n\n~ Doc, Betch of Cumber.. So Good.. Even his cloak had some funny moments like the movie Doctor Strange.. Time Stone did the Most Struggle..\n\n~ Spidey, Holland.. He got a new Suit.. Yaaayyyyy :D This is also not Spoiler.. Homecoming has this Coming here..\n\n~ BP, Black Panther, T'Challa, Boseman was So Good.. His personal bodyguard, Okoye, also was Very Good..\n\n~ Wanda, My Precious Witch.. :* Olsen is So Beautiful (& Powerful) Only She can save the Uni. But can she.?  Watch the movie..\n\n~ Rocket, Cooper was Hilarious.. :D Groot, Diesel.. Was playing video games half the time.. I AM GROOT.. ;)\n\n~ Gamora, Saldana.. Thanos' daughter.. So, she had to be serious.. She was Good.. Bravo..\n\n~ Thanos, Brolin.. Did Excellent Job.. The Best Villain Marvel has shown on screen till now..\n\n~ There're so Many Superheroes, I can't write individually.. So..\n\n~ War Machine, Nebula, Loki, Vision, Falcon, Winter Soldier, Wong, Mantis, Heimdall, Drax, Pepper Potts.. All did Very Good Job..\n\nThere are Many Surprises as the movie unfolds.. Guys, This Movie Is Worth The 10 Years Wait.. JUST GO & WATCH THE MOVIE.. YOU WON'T BE DISAPPOINTED.. That's for Sure..\n\nMy Rating for the movie is *drum rolls*\n\nAWESOMETECULAR = AWESOME + SPECTACULAR (Yeah, It's Stolen..)","displayName":"Jitatman P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T02:35:59.000Z","updateDate":"2018-04-27T02:45:50.000Z","user":{"userId":"972141404","realm":"RT","displayName":"Jitatman P","accountLink":"/user/id/972141404"},"score":5,"timeFromCreation":"Apr 27, 2018"}]}