{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzM1NjY5NzQiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjZUMjI6NDk6MDIifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNDEyNDUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjZUMjI6NTc6MTgifQ=="},"reviews":[{"rating":"STAR_5","review":"I have seen this movie twice now. I wouldn't really even call it a movie it's more just payoff for the marvel cinematic universe, so for a casual viewer that might of only seen one or two mcu films, it might not be as emotionally impacting, but nevertheless it is still an absolutely amzing and beautiful film that makes you want to see more, I definitely recommend to anyone","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/383158608827923/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:57:18.000Z","updateDate":"2018-04-26T23:00:24.000Z","user":{"userId":"977241245","realm":"RT","displayName":null,"accountLink":"/user/id/977241245"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_0_5","review":"They made a joke that ripped on Christianity and that kind of ruins the movie for me. Don't take jabs at the core beliefs of anybody. It makes it so that endorsing the film goes against their body of belief, which will win out every time, no matter the film's quality.","displayName":"Barry A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:56:26.000Z","updateDate":"2018-04-26T22:57:36.000Z","user":{"userId":"977241241","realm":"RT","displayName":"Barry A","accountLink":"/user/id/977241241"},"score":0.5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"This movie did not disappoint, especially if you've been waiting for this all these years.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10203944562361424/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:56:13.000Z","updateDate":"2018-04-26T22:57:14.000Z","user":{"userId":"976932442","realm":"RT","displayName":null,"accountLink":"/user/id/976932442"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"It’s a great movie, everything you’d expect in a Marvel film but with a lot more no holds barred type brawls going on all over the place. They always do a good job of timing humor and levity completely out of nowhere and Infinity War was really excellent in that sense, Drax had a couple one-liners that actually had me laughing pretty good. If you’re a fan of most of the other Marvel movies then you’ll enjoy this, I know I’m looking forward to seeing how it all ends!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:54:33.798Z","updateDate":"2018-04-29T19:47:12.102Z","user":{"userId":"260010792","realm":"RT","displayName":null,"accountLink":"/user/id/260010792"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"Infinity/Infinity Nuff Said!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/575741106131509/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:53:22.000Z","updateDate":"2018-04-26T22:53:52.000Z","user":{"userId":"977241237","realm":"RT","displayName":null,"accountLink":"/user/id/977241237"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_3_5","review":"There's a lot going on here. I absolutely love the action and the back story to Thanos, but it seems like too much was tried to jam into a single film. At points, I felt confused in regards to how many different characters arcs were progressing at once. Overall, it is a LOT of fun and I will probably need another screening (or two) to comprehend everything.","displayName":"Shane S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:53:09.000Z","updateDate":"2018-04-26T22:55:25.000Z","user":{"userId":"953507433","realm":"RT","displayName":"Shane S","accountLink":"/user/id/953507433"},"score":3.5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_4","review":"Entry number 19 in the Marvel Cinematic Universe (MCU), all roads have been leading to Infinity War since a Thanos-teasing end credits stinger in 2012's The Avengers (and more broadly since Iron Man kicked it all off in 2008). With Thanos (Brolin) the biggest and baddest threat Earth's mightiest heroes have had to face - and many of the franchise's original stars at the finishing line of lucrative multi-film contracts - the stakes are higher than ever. Even the most popular MCU icons are in life-threatening danger this time around. In the unenviable position of juggling over 20 established characters in a satisfying manner, whilst also delivering the high-end action expected from this series, directors Joe and Anthony Russo get a lot right. Two and a half hours allows for a plethora of mammoth set pieces and the Russos don't hold back. The choreography isn't the most stylish (nor the CGI as polished as it should be), but every dollar of the considerable budget is utilised to craft wall-to-wall action. An exciting first-act sequence teaming up Dr Strange (Cumberbatch), Iron Man (Downey Jr), Spider-Man (Holland) and Bruce Banner (Ruffalo) quickly sets the all-or-nothing tone, but also demonstrates just how difficult the balancing act will be across the lengthy runtime. Whilst Iron Man gets an electrifying entrance (arguably the best moment of the whole movie), Strange never gets to show off his coolest trick, use of the mirror dimension. And where Spidey gets a suit upgrade, Banner gets underwhelming assistance from the Hulk. These trade-offs are littered throughout, with some more egregious (Clint?) than others; however, the narrative pace is so lightning fast that a few character absences or minimisations become more of a concern after the credits have rolled. Where the filmmaking brothers really strike gold is in the barb-heavy dealings between our favourite heroes. Thor (Hemsworth) and Star-Lord (Pratt) are hilarious in their one-upmanship, Strange and Iron Man build a bromance through witty insults, and Black Widow (Johansson), Scarlett Witch (Olsen) and Okoye (Gurira) combine for one scene that tantalises the oft-rumoured all-female Avenger flick. It is a shame though, that whilst Thanos is given the time and dedication to be fleshed out as one of the better villains of the series, his four hench-creatures are visually bland and narratively unnecessary, their design and execution reminiscent of Steppenwolf in Justice League. Although it doesn't break through into the very top echelon of MCU outings, it's not far off either; a few sneaky cameos, consistently delightful character interactions and one of the franchise's best climaxes ensures Infinity War is an immense crowd-pleaser.","displayName":"Troy C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:50:59.000Z","updateDate":"2018-04-26T22:51:00.000Z","user":{"userId":"901318118","realm":"RT","displayName":"Troy C","accountLink":"/user/id/901318118"},"score":4,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"The rotten tomatoes score is wrong. It should be 100%. Marvel fans will not be let down. This is the best movie in the universe. I believe that it will only be outdone by Avengers 4.","displayName":"Gregg R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:50:55.000Z","updateDate":"2018-04-26T22:53:18.000Z","user":{"userId":"977241227","realm":"RT","displayName":"Gregg R","accountLink":"/user/id/977241227"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_5","review":"This movie,  is non stop, no holds barred,  full throttle  action packed!  I mean WOW!  It was so good that when it was over,  I wish I hadn't seen because I want to see it again and be surprised all over again! This movie deserves a 100 percent rating from the critics. Nothing more for me to say but DAMN,  I WANNA SEE IT AGAIN!!!","displayName":"Steven H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:49:50.000Z","updateDate":"2018-04-26T22:53:56.000Z","user":{"userId":"976144869","realm":"RT","displayName":"Steven H","accountLink":"/user/id/976144869"},"score":5,"timeFromCreation":"Apr 26, 2018"},{"rating":"STAR_1","review":"Same as every other marvel film.","displayName":"Richard C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-26T22:49:02.000Z","updateDate":"2018-04-26T22:49:02.000Z","user":{"userId":"973566974","realm":"RT","displayName":"Richard C","accountLink":"/user/id/973566974"},"score":1,"timeFromCreation":"Apr 26, 2018"}]}