{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNDQ0NzEiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMjE6MTY6NDEifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8xODAxNzM0NjEiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMjE6MjQ6NTcuNjY5WiJ9"},"reviews":[{"rating":"STAR_4","review":"still digesting this huge meal, one dislike kind of a spoiler...,,,, ....,..............,,..,.. I don't likecliffhangerss","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T21:24:57.669Z","updateDate":"2018-04-27T21:24:57.669Z","user":{"userId":"180173461","realm":"RT","displayName":null,"accountLink":"/user/id/180173461"},"score":4,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"It's an amazing and emotional movie. Avengers Infinity War Ian my new favourite movie. I love how they got most of the Marvel characters into one amazing movie","displayName":"Mia H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T21:24:05.000Z","updateDate":"2018-04-27T21:25:54.000Z","user":{"userId":"977244478","realm":"RT","displayName":"Mia H","accountLink":"/user/id/977244478"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"The best movie ever from marvel ..left me both mind blown and heart broken at the same time....it really broke my heart seeing almost all heroes dead and thanos really won the war........in total the so astoundingly perfect in every way...people say its overstuffed...but it isnt....its really enjoyable and i am pretty damn sure it blew your heads off...that much fantastic...and the dark setting adds a majestic power to the filim....if you hear or see any bad review about inifinity war just realise that review is given by some DC fan who dosnt know how to admire a superb movie...atleast these DC fans should understand marvel is not stupid enough to make a movie like that dumb Justice League of DC...........to be frank i am not a fan of both DC or Marvel ...i am just an admirer....but i really think Russo brothers nailed the last nail to DCEU's coffin.....even though DC have so many great brilliant comics they really suck when it comes to movies...............and once again marvel shows their dominance through Marvel Avengers Infinity War.......# its a must watch movie??","displayName":"Jithin E","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T21:23:29.000Z","updateDate":"2018-04-27T21:37:38.000Z","user":{"userId":"977244481","realm":"RT","displayName":"Jithin E","accountLink":"/user/id/977244481"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Absolutely amazing Must see movie but you need to watch every \nMCU movie before watching this one.","displayName":"Shaun L","displayImageUrl":"https://graph.facebook.com/v3.3/100002615110888/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T21:23:26.000Z","updateDate":"2018-04-27T21:25:38.000Z","user":{"userId":"932337033","realm":"RT","displayName":"Shaun L","accountLink":"/user/id/932337033"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Not only did this movie go places that I've never seen an action movie go before, but it was also one of the most unique and at the same time downright fun big budget movies I've seen in a long time.\n\nGreat characterization of the villain in a Marvel movie for once(Black Panther excluded), a fantastic script, and superb pacing/editing make it possibly the best Marvel movie yet.","displayName":"Ben W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T21:22:57.000Z","updateDate":"2018-04-27T21:26:29.000Z","user":{"userId":"909916590","realm":"RT","displayName":"Ben W","accountLink":"/user/id/909916590"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Amazing job of juggling storylines by the Russo Brothers. If you're a die-hard MCU fan you'll follow it easily. This movie was a rollercoaster of emotion, a see-saw of fun and devastation. Fantastic! I can't wait to see it again.","displayName":"Ted E","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T21:21:38.000Z","updateDate":"2018-04-27T21:24:27.000Z","user":{"userId":"976932744","realm":"RT","displayName":"Ted E","accountLink":"/user/id/976932744"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"Wow so much to say about this movie, the fact that Marvel has been able to steer their ocean liner of a multi film franchise through the dense sea of icebergs that defines the hit and miss nature of Hollywood blockbusters is a monumental task in itself. But the real achievement is the fact they have been able to tie up that franchise relatively unscathed, that in itself is groundbreaking and something WB would probably begrudgingly acknowledging right about now if not maybe when the first weekend numbers arrive. \nIs Infinity War the type cinematic perfection that the harshest critics have panned it for not being, No. Is it good enough when considering the mammoth task required to string together numerous plots that have played out over nine years and 18 films, I say a resounding hell yeah. \nMy personal Highlights was the thrill of seeing the evolution of Tony Stark and the Ironman Tech which for me was perfectly illustrated in the film with his utilization of the Nano technology in the initial conflict and throughout the film especially during said conflicts. I felt RDJ's onscreen rapport with Benedict Cumberpatch was a little hit and miss, but his screen time with Tom Holland more than made up for this. The teaming up of Thor and the Guardians payed instant dividends with some of the more memorable moments of humor punctuated by Thor's parting words of encouragement \"We bid you farewell and good luck Morons\". \nNow to the big baddie of the film Thanos. The task of portraying a character with the cartoonish visual presence of Thanos and making that character emotionally complex in a way that audiences could empathize with requires acting chops few in the industry are capable off and relies heavily on the audience to meet the character somewhere in the middle of their imagination. Josh Brolin facilitates this in a way very few in his profession could ever hope too. From the moment he choked the life out of Loki, you could see the this was a character that had the difficult task ahead of him in getting the audience to believe that this character had the ability to become the complex villain he eventually became by the time we see him sitting outside his hut pondering his handy work while watching the sunset, he has set the groundwork for a character that has the potential to leave his mark on the future of the MCU and its fans. \nThe casualty of this film are the scenes depicting the team assigned to protect Vision in Wakanda, which is mildly underwhelming up till the point that Wanda Maximoff enters the Fray and Thor makes his appearance which for all intents and purpose had monumental cinematic moment written all over it.\nPacing of the film has been one of the center points of critics and yet if you consider that the movie is billed as a race to recover and/or protect six infinity stones was there ever a question that the movie was ever going to be anything other than (Pardon the Pun), fast and furious. \nAvengers Infinity War has something for anybody that enjoys an escape. If you didn't enjoy it you we're probably never a fan in the first place, as for Marvel fans it is the gift that will continue to give at least until the release of Avengers 4 in 12 months' time. But my guess is it will be some time if ever that this ocean liner turned battle ship Called the Marvel Cinematic Universe gets sunk by an iceberg. The movie is a 5/5 for shear achievement, but 4.5/5 in reality.","displayName":"Glenn P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T21:20:58.000Z","updateDate":"2018-04-27T23:46:02.000Z","user":{"userId":"977244454","realm":"RT","displayName":"Glenn P","accountLink":"/user/id/977244454"},"score":4.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Hilarious, heartbreaking, fun, dark. The culmination of 10 years of Marvel movies and it does not disappoint. Thanos is easily the best Marvel villain to date ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T21:18:54.955Z","updateDate":"2018-04-27T21:18:54.955Z","user":{"userId":"969484527","realm":"RT","displayName":null,"accountLink":"/user/id/969484527"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4","review":"I really appreciate how they let the villian win. unique!","displayName":"Andrew T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T21:17:26.000Z","updateDate":"2018-04-27T21:21:41.000Z","user":{"userId":"948430711","realm":"RT","displayName":"Andrew T","accountLink":"/user/id/948430711"},"score":4,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4","review":"Hace unas semanas una película llamada Ready Player One trajo la magia de vuelta al cine y esta no es la aspiración que tienen los Avengers, ellos van un paso más allá, ellos en este día nos definen nuevamente lo que a mi perspectiva es el cine y no hablo desde los zapatos de un fan lo hago desde la perspectiva de cineasta, uno que creció y fue educado en la cultura pop y hoy se siente satisfecho al ver el crossover más ambicioso de la historia. \n\nMarvel estudios lanzó una propuesta arriesgada en 2008 con un camino firme por construir y confió en nosotros los espectadores para mantener un universo a flote, esto no habría sido posible sin sus emblemas que con carisma y pasión nos hicieron conocer al personaje como un ente en la realidad y al verlos relacionarse entre ellos a una escala y evolución mayor el espectador puede sentirlos parte de sí, una relación que no se desgasta en 150 minutos, crece y nos da más. \n\nLa película nos atrapa desde la ya reconocida intro Marvel estudios y comienza de una impactante manera, y a lo largo de esta se mantiene el humor característico y nuevas secuencias de acción formidables aprovechando la cantidad de personajes en pantalla, con una historia que atrapa y te mantiene expectante retorciendo todo lo que creímos saber para así llegar a una conclusión insólita hasta ahora en el género de las películas de superhéroes y en la fórmula Hollywood en general. \n\nUna vez terminada la función nos deja con miles de cuestionables, tanto en el MCU como en la vida real ¿que sigue a partir de aquí? ¿Este es el clímax y ocaso de la era de los superhéroes? O acabamos de ver la entrada de un universo mayor, pues esta película tiene la decencia completa de lo que es experimentado por los lectores de cómics, al ver a los personajes finalmente interactuando, visitando diversos mundos, una visión perfectamente construida a lo largo de 10 años. \n\nHoy salgo de la sala con lágrimas en los ojos, una mitad de mi vida finaliza aquí y volveré a mi punto inicial, sé que para los críticos más duros el filme no es merecedor de nombre y alabanza, muchos podrán decir que no hay arte en él, pero después de presenciar la frenética madrugada de hoy y el fenómeno que sigue en los cines aún, no podemos negar la grandeza de esta, \"no todo lo popular es bueno\" es cierto y habló desde mi corazón que ama el séptimo arte al decir que estoy agradecido por esta noche, al competir con miles de personas lo que es el cine, al ver gente haciendo filas por horas para comprar un guantelete del infinito, al ver personas reír, levantarse de sus asientos, gritar y hasta llorar, agradezco ver persona vistiendo prendas de su héroe favorito y verlas salir en shock de la sala al igual que yo; \"el fin está cerca\" eso dijo Thanos pero después de hoy yo les puedo asegurar que no es así, hoy más je nunca tenemos fe y creemos en los héroes, hoy más que nunca la gente tiene inspiración, hoy las salas de cine están llenas y hoy todos nos sentimos personajes y si eso no es el cine no tiene caso que sueñe con el, habrá muchas críticas sobre el chinche y la ideología que se nos intenta vender pero un mundo de héroes en donde quiero vivir. \n\nHoy me levanto de la silla y me pongo el traje con más orgullo que nunca, Marvel después de 10 años volvió al mundo geek, hoy no hay nerds por ser fan de los súper héroes, hoy no te escondes para leer un cómic, se ganó la guerra \"ñoña\" y en 10 años hubo un cambio cultural. \n\nPosiblemente Infinity War no será la mejor película de la historia en términos artísticos y técnicos, pero debemos dejar de juzgar, las pasiones y la relevancia en nuestra cultura es realmente el legado que el cine intenta dejar; hoy el cine vive gracias a Marvel, pero más importante gracias a todos por el amor brindado a este universo.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1538665676230801/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T21:16:41.000Z","updateDate":"2018-04-27T21:39:07.000Z","user":{"userId":"977244471","realm":"RT","displayName":null,"accountLink":"/user/id/977244471"},"score":4,"timeFromCreation":"Apr 27, 2018"}]}