{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNTAyNzIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMzBUMDI6MTQ6MDkifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MTk4MDA5NzQiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMzBUMDI6MzY6MjYuODMyWiJ9"},"reviews":[{"rating":"STAR_5","review":"this movie made be both laugh and cry","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T02:36:26.832Z","updateDate":"2018-04-30T02:36:26.832Z","user":{"userId":"919800974","realm":"RT","displayName":null,"accountLink":"/user/id/919800974"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_4_5","review":"There was sooooooo much going on. Need to watch again. Great movie and awesome cinematography.","displayName":"Jamie P","displayImageUrl":"https://graph.facebook.com/v3.3/1739329045/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T02:30:57.000Z","updateDate":"2018-04-30T02:32:03.000Z","user":{"userId":"881637951","realm":"RT","displayName":"Jamie P","accountLink":"/user/id/881637951"},"score":4.5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_3_5","review":"The movie was good but I expected a more closed movie when they shrugged off the whole part 1&2 narrative","displayName":"Reagan B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T02:29:24.000Z","updateDate":"2018-04-30T02:33:39.000Z","user":{"userId":"977250290","realm":"RT","displayName":"Reagan B","accountLink":"/user/id/977250290"},"score":3.5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_5","review":"Avengers: Infinity War is a cinematic masterpiece. Marvel has spoilt us with 10 years of mostly great superhero movies with a plethora of amazing characters and stories. I am happy to say that there is no greater reward than watching Infinity War after all the hype and excitement surrounding this movie and to all the fans who have stuck for every movie in the 10 year we have experiences with the franchise. Infinity War delivers with excellence on another level that I believe no other movie has ever done before. The movie was for me, half heart bursting laughs and other half, heart bursting emotion. This movie brought me to my emotional peak, well done to directors Joe and Anthony Russo. \n\nNow, there has to be something said about the main villain, Thanos. Performed ecstatically by Josh Brolin, the character is realistically driven, capturing, understandable and a formidable foe for all of the Avengers. Making him definitely among the best if not the best superhero villains of all time.\n\nIn a movie with so many characters they managed to get every avenger, some more than others, a spotlight and a truly awesome moment each, a hard task with there being around 30 Avengers. We get to see all the characters we all love and seen and that we are already so invested in, come together for the first time. Gamora, Scarlet Witch, Thor, Iron-Man and Star-Lord being some of my star favourites in this movie. With there being lots of different heroes coming together (like the Guardians coming), that comes into play with some awesome duos. For example Thor and Rocket, they were great together. The directors smartly combined the characters together to get some unforgettable interactions and moments, for example, Star-Lord and Thor, made me laugh the hardest I've had in a long time and also Scarlet Witch and Vision made for some really impactful moments. \n\nThanos' \"Black Order\" were a terrifying threat as well. After I left the theatre my mind was blown, Marvel was ballsy, I left the theatre absolutely wrecked. I had that lump in my throat by the end and was breathing heavy and trying to keep my composure. The action, even from the first scene was spot on. The directors said when they were making this movie that the action was there for the drive of the characters for the characters, and what is the hardest situation to put them in and test them in. And it definitely paid off, it was evident, dripping off the screen.\n\nNow for the problems that I had with the film. Firstly, I wanted more Captain America and Black Widow. Now I know it's hard, in a movie with so many characters, to get all the characters you like to get more screen time than others. We did get a good amount but they definitely weren't the lead in this one. It just left me wanting a bit more from these characters. All I can say is I hope we see them more of them in the next one. And boy am I excited for the next Avengers! Or any Marvel movie after that concerning that mater. \n\nOne other tiny nitpicks is that the movie was filmed in IMAX and I saw it in a non IMAX screen. So some of it looked a bit weird. One shot looked like it was stretched and another shot, of a character in a shot looked like it was blurry and pixelated. So if you have the chance, definitely see it in IMAX.\n\nThis truly is an \"Event Film\" a milestone for cinema history. Now about the ending. The ending truly is awesome... without spoilers that is all I can really say. Another thing I can say with the utmost confidence is that, as a Marvel fan myself I was surprised throughout every step of this movie. A lot of the time I was looking over to my friend with a half smile half my mouth wide open dropped to the floor! Now that I've had \"some\" time to think about it while it still being fresh in my mind, Avengers: Infinity War is probably ranked in place 1 or 2 in my favourite Marvel movies of all time. In contestant with Captain America: Civil War, for me, still have to dwell on it to properly make up my mind. And to pick up my nerd blown and shattered brain parts off of the floor and put it back together again, hope I can do it as soon as possible, hopefully...\n\nAvengers: Infinity War isn't the best movie ever made. But as an extreme Marvel fanatic this movie made me as happy as I could ever wish for, and above. I am also overly excited to see what the impressive MCU is going to offer moving towards the future.","displayName":"Justin U","displayImageUrl":"https://graph.facebook.com/v3.3/1870129713272646/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T02:25:05.000Z","updateDate":"2018-04-30T15:28:20.000Z","user":{"userId":"976136491","realm":"RT","displayName":"Justin U","accountLink":"/user/id/976136491"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_5","review":"Incredible FIlm. Great balance of characters as well as character development. Filled with fun, excitement, fear and action. Outstanding villain","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1886208511678074/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T02:23:31.000Z","updateDate":"2018-04-30T02:25:27.000Z","user":{"userId":"977250283","realm":"RT","displayName":null,"accountLink":"/user/id/977250283"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_5","review":"Another brilliant entry for Marvel Studios. But this time, they really seem to have gone the extra mile. A big cast such as this in my opinion doesn't often work but the Russo brothers have managed to to work everyone into a cogent story. My only niggles with the film was 1. A lot of the cast didn't have much time on screen nor enough dialogue and 2. People taking off the masks to talk. Why bother wearing a mask if your going to whip it of every time you have some dialogue?","displayName":"Ali M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T02:22:22.000Z","updateDate":"2018-04-30T02:28:58.000Z","user":{"userId":"966515325","realm":"RT","displayName":"Ali M","accountLink":"/user/id/966515325"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_4","review":"Stunning, great CGI, beautiful shots and action scenes. The MCU finally delivers a good Villain. Only draw back is that the secondary villain gets killed off, they were couple who seemed really interesting.","displayName":"Rotten%20 T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T02:16:25.000Z","updateDate":"2018-04-30T02:20:38.000Z","user":{"userId":"977250276","realm":"RT","displayName":"Rotten%20 T","accountLink":"/user/id/977250276"},"score":4,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_4","review":"I loved the movie but what i don't like is the wanna be fake fans that FLOODED the THEATRES that don't read the comics and dudes if you haven't seen the movie wait till the post credit scene","displayName":"omar m","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T02:14:21.000Z","updateDate":"2018-04-30T02:21:32.000Z","user":{"userId":"977250274","realm":"RT","displayName":"omar m","accountLink":"/user/id/977250274"},"score":4,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_5","review":"I wish Marvel Studios was in charge of making the Star Wars movies, they get how to make an awesome movie.","displayName":"stephen c","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T02:14:13.000Z","updateDate":"2018-06-21T07:26:46.000Z","user":{"userId":"977250273","realm":"RT","displayName":"stephen c","accountLink":"/user/id/977250273"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_5","review":"Absolute masterpiece. Emotional and action packed as well as funny from start to the end.","displayName":"Alejandro V","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T02:14:09.000Z","updateDate":"2019-02-26T07:45:55.000Z","user":{"userId":"977250272","realm":"RT","displayName":"Alejandro V","accountLink":"/user/id/977250272"},"score":5,"timeFromCreation":"Apr 30, 2018"}]}