{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNTE3NjMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMzBUMjA6NTE6MDcifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NjQ5NjY3OTMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMzBUMjE6MTk6MDcifQ=="},"reviews":[{"rating":"STAR_5","review":"QUE FILME É ESSE!!!! IMAGINA O VINGADORES 4?!","displayName":"Sandro A","displayImageUrl":"https://graph.facebook.com/v3.3/100002357289425/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T21:19:07.000Z","updateDate":"2018-04-30T21:19:45.000Z","user":{"userId":"964966793","realm":"RT","displayName":"Sandro A","accountLink":"/user/id/964966793"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_4","review":"A very good movie, filled with action, Easter eggs, and practically every superhero from the MCU. The action is excellent, character interactions are awesome, and there are emotional scenes that are extremely powerful. Two criticisms: the plot reminded me of a transformers movie, where it just keeps running and running and stuff just keeps happening, without a real story arc, and I could not recite plot if I tried. Secondly, to those new to the MCU 90% of the plot will make zero sense, making this movie just an action punch out to them. Regardless, a very good superhero film, flawed, but one of my favorite MCU movies. Definitely will see it again on Blue Ray.","displayName":"Jared Y","displayImageUrl":"https://graph.facebook.com/v3.3/479002942451927/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T21:11:54.000Z","updateDate":"2018-04-30T21:18:34.000Z","user":{"userId":"976468209","realm":"RT","displayName":"Jared Y","accountLink":"/user/id/976468209"},"score":4,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_5","review":"Exceeded expectations in almost every way.  As an experience, I'd say The Dark Knight is a distant second.","displayName":"Matthew S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T21:10:14.000Z","updateDate":"2018-04-30T21:11:43.000Z","user":{"userId":"901361437","realm":"RT","displayName":"Matthew S","accountLink":"/user/id/901361437"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_0_5","review":"This movie is full of discrepancies, a lot of the characters switch between ridiculously pathetic to suddenly more powerfully then before. Or they just stayed pathetic the entire time. And the ending was a pathetically chosen ending to ensure people would go see it next year","displayName":"Zoey T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T21:05:47.000Z","updateDate":"2018-04-30T21:23:24.000Z","user":{"userId":"977251778","realm":"RT","displayName":"Zoey T","accountLink":"/user/id/977251778"},"score":0.5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_2_5","review":"How does one scrutinize a film that is almost entirely devoid of any sort of literary ambition? That was the question I was asking myself when Justice League came out last fall, when Rampage came out last month, and when I saw this film yesterday. These movies are so bereft of any sort of gravitas despite the gargantuan stature of their primary components, yet they are massive box-office successes. 9 out of 10 people you run into on the street would take the time to watch these silly, overlong headaches and be somewhat satisfied with the time spent. So, please accept this review as my ringing endorsement for your impending voluntary lobotomy.\n\nNow we have Avengers: Infinity War, the \"Red Wedding\" episode of Marvel's Cinematic Universe. It's the darkest hour for these characters, some of whom have waited a decade (others 3 months) for this \"payoff\". Just like that, many of them are dead or disintegrated, but you know they won't stay that way unless their Disney contract ran out. Even in such an ambitious crossover event requiring dozens of characters who've finally moved on from their respective origins stories, this still ends up being another origin story, that of purple CG Josh Brolin's Thanos.\n\nEven more distressing than seeing your favorite color of spandex dying off might be the prospect that as long as these movies make money, you are trapped in an infinite story for no other purpose than to waste your money and time. Quippy Avengers will come and go, \"fully realized\" villains will rise and fall, simplistic moral conundrums will be touched upon and glazed over, and the money machine will keep on churning them out two to three times a year. Perhaps more frustrating than the headache I get from being subjected to the barrage of expertly rendered video game cut scenes is the fact that, as a text, there will be no end to this random CG generator. It seems essential that there should be some sort of finality to a text in order to sufficiently analyze it, but there is none in sight.\n\nYou could say that the life and death of one of these superheroes could be taken as a character study, but you know that at any time another magical glowing thing could bring them right back to life. Life and death is meaningless in these stories, and the Christ metaphor has been exhausted. How could you find yourself caring for one of these characters when you only get to know them for an hour or two, they ultimately do nothing of consequence, and their stories aren't even placed in a context by which to ascertain their value? Well, there's always the funny little gags they do and giant shit exploding. Maybe that says it all: nobody gives a damn about what anyone does, and they all just want to watch the world burn, giggling mindlessly from the comfort of a recliner.","displayName":"K Nife C","displayImageUrl":"https://graph.facebook.com/v3.3/770380186/picture","isVerified":false,"isSuperReviewer":true,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T21:04:54.000Z","updateDate":"2018-04-30T21:05:03.000Z","user":{"userId":"861487476","realm":"RT","displayName":"K Nife C","accountLink":"/user/id/861487476"},"score":2.5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_5","review":"\"Fun isn't something one considers when balancing the universe. But this... does put a smile on my face.\" And believe me, you will leave the theater with a smile in your face!!! Best Superhero movie of all times!!!","displayName":"Marvin P","displayImageUrl":"https://graph.facebook.com/v3.3/1411507720/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T21:04:14.000Z","updateDate":"2018-04-30T21:06:47.000Z","user":{"userId":"907337267","realm":"RT","displayName":"Marvin P","accountLink":"/user/id/907337267"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_5","review":"Awesome movie! Great ending! ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T21:03:11.513Z","updateDate":"2018-04-30T21:03:11.513Z","user":{"userId":"966220287","realm":"RT","displayName":null,"accountLink":"/user/id/966220287"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_5","review":"What can I say but, go see it!! fantastic movie. Marvel's best yet. I will go see it again.","displayName":"Tony A","displayImageUrl":"https://graph.facebook.com/v3.3/1291900802/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T20:59:03.000Z","updateDate":"2018-04-30T21:00:02.000Z","user":{"userId":"930034288","realm":"RT","displayName":"Tony A","accountLink":"/user/id/930034288"},"score":5,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_4","review":"Yes, it's worth watching on the big screen for the incredible MCU-multi-main-character action showdown sequences, that all these films have built up to, as well as the relentless pacing from it's \"medias res\" opening.  It's also a welcome change because it pulls the rug from under most triumphalistic (Disney) American films in that it's wiling to eliminate characters and leave the audience at a loss to how the narrative will move forward in a world where the ones you're counting on are so utterly defeated.  But what's most striking, and terrifying, is how timely the film is (the Russo brothers' helmed Marvel films have said a lot about our socio-political realties) with a villain that views the world as a zero-sum game and so believes it is righteous to cast aside entire populations.","displayName":"David  K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T20:57:26.000Z","updateDate":"2018-04-30T21:03:13.000Z","user":{"userId":"634806864","realm":"RT","displayName":"David  K","accountLink":"/user/id/634806864"},"score":4,"timeFromCreation":"Apr 30, 2018"},{"rating":"STAR_4_5","review":"Fantastic Movie with many surprising and hilarious scenes. Epic fight scenes all around. Can get emotional at parts.","displayName":"Trey W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-30T20:51:07.000Z","updateDate":"2018-04-30T20:53:05.000Z","user":{"userId":"977251763","realm":"RT","displayName":"Trey W","accountLink":"/user/id/977251763"},"score":4.5,"timeFromCreation":"Apr 30, 2018"}]}