{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF83OTcxMzQxMzQiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMjNUMTA6NDQ6MDEifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MDEwOTMzNjciLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMjNUMTQ6MzQ6NTYifQ=="},"reviews":[{"rating":"STAR_5","review":"Greatest movie of all-time! Step aside Star Wars bums!","displayName":"Chris W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-23T14:34:56.000Z","updateDate":"2018-05-23T14:40:17.000Z","user":{"userId":"901093367","realm":"RT","displayName":"Chris W","accountLink":"/user/id/901093367"},"score":5,"timeFromCreation":"May 23, 2018"},{"rating":"STAR_5","review":"great film that me and my dad enjoyed together, the only part i don't like is that i have to wait nearly a year for avengers 4","displayName":"Tom N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-23T14:02:31.000Z","updateDate":"2018-05-23T14:08:11.000Z","user":{"userId":"977285090","realm":"RT","displayName":"Tom N","accountLink":"/user/id/977285090"},"score":5,"timeFromCreation":"May 23, 2018"},{"rating":"STAR_5","review":"saw it in theaters a bit late but was not disappointed. great effects, great acting from the whole cast. jokes were well placed and not over used. will see the next one for sure","displayName":"James P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-23T13:31:45.000Z","updateDate":"2018-06-08T10:16:19.000Z","user":{"userId":"911742470","realm":"RT","displayName":"James P","accountLink":"/user/id/911742470"},"score":5,"timeFromCreation":"May 23, 2018"},{"rating":"STAR_2","review":"Now that most everyone has seen it, I can post a review/opinion piece on the mega-blockbuster gone wrong. Spoilers included, so if you haven't seen it, don't read any further. I am going to spend time defending my 2/5 rating rather than praising the good aspects of the film. The action sequences are adequate, even good, and the acting is fine and dandy too. What isn't fine, is the fact that the movie stages four scenarios that are each the exact same thing. An ultimatum for a single \"hero\" to choose either one person's life or half of humanity's life and choosing the prior. These are not heroes at all. This is not sacrifice. This is emotional manipulation of an audience that has grown to care deeply about characters due to previous films that are far superior to this one. \n\nSo the film is very singular in its purpose. Explain how Thanos gets all 6 infinity stones, then finally show what the stones can do, which may have been devastating if The storytelling had even a whisper of variability. However, they opted for the aforementioned ultimatums (one of which I guess you can excuse, which I will explain if you're not already like \"yeah, I know\"). So two of the stones are simply mentioned as acquired by Thanos, the one left by the guardians on that one planet that Thanos has just come from at the beginning of infinity war, and the one that is acquired from the space garbage man. Both by treachery and murder of course. Then we see the other four obtained. Since you've seen the movie I will be brief. First, Loki chooses Thor over half of humanity by relinquishing the tesseract. That's not selfless because Thor would've rather had him let Thanos kill him I'm sure. But alas, Loki is a villain, so I guess at least he's not supposed to be a hero, per se. Then we have Gomorrah protecting her sister by revealing the location of the soul stone to Thanos. Again, not a hero, and another stupid decision. Then we have Doctor Strange overturn an infinity stone in order to save a VERY injured Tony stark (however, since earlier in the movie there's that incredibly out of place scene where Doctor Strange sees the one out of a million outcomes that doesn't end bad (relative term I guess), we can forgive him as he must have had some insight as to that being the best (again, relative term) thing to do). Lastly, you have everybody trying to spare Vision, WHO NOBODY CARES ABOUT AND IS A SENTIENT COMPUTER PROGRAM, over half of humanity. In the end, Scarlet Witch does decide to try to destroy the stone, but not before nice, fun Wakanda girl (T'Challa's sister genius) tries to remove the stone after pointing out how stupid the way they installed the stone was. I guess that part of the movie was pointing out that all along Tony Stark was actually an idiot? Or it's just another gimmicky plot device to drag out an emotional climax. Yes, it's emotional, but not because of any of the work that brothers Russo have contributed to the universe. Infinity war does nothing original, and simply plays off of the emotional connection that fans have to the characters. Instead of giving the audience more reason to care about the characters, it's simply emotionally manipulates us over and over. I have a litany of other issues with the movie, most notably Peter Parker's ability to disappear slower than anyone else in order to further emotionally manipulate the viewer, however I only see it necessary to attack its entire core to defend my intense dislike of infinity war. Hopefully brothers Russo have a part 2 in tow that can completely render me speechless and have me gain much appreciation for part two of this \"grand finale.\" I know it's possible thanks to the powerhouse that is Kill Bill Vol. 2 (another double feature filmed at the same time and released separately, though closer together), which enhanced and legitimized any directorial indulgence present in part 1. Lets hope this goes the same way. In the meantime, I walked into Infinity War expecting to like it, and I will walk into its follow up much more apprehensive.","displayName":"Matthew L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-23T13:28:20.000Z","updateDate":"2018-05-23T13:46:35.000Z","user":{"userId":"943606764","realm":"RT","displayName":"Matthew L","accountLink":"/user/id/943606764"},"score":2,"timeFromCreation":"May 23, 2018"},{"rating":"STAR_4","review":"Great movie, lots of fun.","displayName":"Anna%20 J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-23T12:36:54.000Z","updateDate":"2018-05-23T12:38:00.000Z","user":{"userId":"977284970","realm":"RT","displayName":"Anna%20 J","accountLink":"/user/id/977284970"},"score":4,"timeFromCreation":"May 23, 2018"},{"rating":"STAR_4","review":"Watching this a second time didn't alter my feelings about it.  I like it.  I don't think it's amazing, but it does what it should do.  What I think is interesting about it is that it highlights very clearly what the current Marvel films do well and why they tend to be divisive.  What Disney has done, partly through acquiring the license to so many characters, but also through a lot of diligence, is really capture on film a lot of what is enjoyable about comic books ... the large world full of interrelated characters who appear in each other stories and build up a shared lore over the years.  This is the kind of thing you expect TV to do well, but not movies given the expense and long time frames, so it's fascinating to see this form of serial storytelling really working.  This film in particular feels more like a big even series of comics than a film.  It tells a big story full of characters in a more episodic structure and just assumes you know who all the characters are and understand the backstory that has accumulated over the last few years.  I think this is fascinating and points towards the potential of telling different kinds of stories on film.  It's also a film that is bound to frustrate anyone expecting it to have a normal act structure and character development.","displayName":"Richard D","displayImageUrl":"https://graph.facebook.com/v3.3/1393965328/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-23T12:23:34.000Z","updateDate":"2018-10-04T12:00:59.000Z","user":{"userId":"849167683","realm":"RT","displayName":"Richard D","accountLink":"/user/id/849167683"},"score":4,"timeFromCreation":"May 23, 2018"},{"rating":"STAR_5","review":"Can’t wait for the sequel!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-23T12:11:11.205Z","updateDate":"2018-05-23T12:11:11.205Z","user":{"userId":"260004433","realm":"RT","displayName":null,"accountLink":"/user/id/260004433"},"score":5,"timeFromCreation":"May 23, 2018"},{"rating":"STAR_1","review":"least favorite marvel movie.  suspension of belief is a critical component of all science fiction/fantasy story or movie.  Even though a story may be a fantasy it still has to be believable.  For me the suspension of belief failed me in this movie.\nFor example the background of the infinity stones.  According to the latest estimate of scientists is that there are over three trillion galaxies in the universe.  The average galaxy has between 250 to 300 billion stars.  There were seven infinity stones created in the big bang.  Is spite of the vastness of the universe all seven stones appear to be in this galaxy and two of them are on earth??? That is a rather large stretch of the suspension of belief.  Like the raining asteroid in Armageddon .","displayName":"Steven A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-23T11:36:40.000Z","updateDate":"2018-05-29T22:47:10.000Z","user":{"userId":"977284861","realm":"RT","displayName":"Steven A","accountLink":"/user/id/977284861"},"score":1,"timeFromCreation":"May 23, 2018"},{"rating":"STAR_4_5","review":"Awesome! Loved the combining of the Marvels","displayName":"Debbie V","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-23T10:54:00.000Z","updateDate":"2018-05-23T10:54:41.000Z","user":{"userId":"948946921","realm":"RT","displayName":"Debbie V","accountLink":"/user/id/948946921"},"score":4.5,"timeFromCreation":"May 23, 2018"},{"rating":"STAR_3","review":"Epic in it's goal, and characters continue to be great- Thanks worked pretty well in the movie.  It just didn't seem to be building to anything- side stories just feel a bit like filler (Thor is getting a new hammer, etc.).  The battle scenes are alright, but the final battle just isn't satisfying- likely because it leaves us with more questions than answers.  Well worth watching, but not as slick as Ragnorok.","displayName":"Randy Y","displayImageUrl":"https://graph.facebook.com/v3.3/783795983/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-23T10:44:01.000Z","updateDate":"2018-05-23T18:10:58.000Z","user":{"userId":"797134134","realm":"RT","displayName":"Randy Y","accountLink":"/user/id/797134134"},"score":3,"timeFromCreation":"May 23, 2018"}]}