{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NjU1ODI5MjUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTUtMDUtMjBUMTc6NTE6MTNaIn0=","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NTY4MjMzNjQiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTYtMDQtMDNUMDI6Mzg6NDFaIn0="},"reviews":[{"rating":"STAR_5","review":"If you're a BIG FAN of Marvel. All I can say is WOW!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2016-04-03T02:38:41.000Z","updateDate":"2018-04-27T23:15:25.136Z","user":{"userId":"956823364","realm":"RT","displayName":null,"accountLink":"/user/id/956823364"},"score":5,"timeFromCreation":"Apr 03, 2016"},{"rating":"STAR_4","review":"This is what all of Marvel has led up to. Everybody (except Korg, Valkryie, Ant-Man & Hawkeye) is here! It was just, a little bit disappointing. I've been waiting over three years for this, but it just feels like any other Marvel Studios film. Some action, here and there, they throw some jokes into the mix, and they've got some surprises. What I enjoyed the most, is the very start, and the very end. Everything in the middle is just, the regular. But, it is still an enjoyable one.","displayName":"Logan B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2016-04-02T11:51:53.000Z","updateDate":"2018-08-13T10:32:36.000Z","user":{"userId":"955939903","realm":"RT","displayName":"Logan B","accountLink":"/user/id/955939903"},"score":4,"timeFromCreation":"Apr 02, 2016"},{"rating":"STAR_5","review":"My second favorite MCU movie in eterniry","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2016-03-26T01:58:48.000Z","updateDate":"2018-05-28T05:34:17.851Z","user":{"userId":"970286281","realm":"RT","displayName":null,"accountLink":"/user/id/970286281"},"score":5,"timeFromCreation":"Mar 26, 2016"},{"rating":"STAR_5","review":"I laughed and cried. Saw it on the 26th. Was amazing.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2015-12-29T01:25:03.000Z","updateDate":"2018-04-27T21:13:41.973Z","user":{"userId":"929300813","realm":"RT","displayName":null,"accountLink":"/user/id/929300813"},"score":5,"timeFromCreation":"Dec 29, 2015"},{"rating":"STAR_4_5","review":"SPOILER ALERT!!! I'm sure most people by now have already seen the movie, so I'll be going in depth with this review.\n\nThe third movie in the AVENGERS franchise and the nineteenth film in the Marvel Cinematic Universe, AVENGERS: INFINITY WAR features, well, pretty much everybody we knew from the previous movies (except for Ant-Man and Hawkeye) and all of them are trying to stop Thanos, the villain that's been built up since the first AVENGERS movie, from collecting all six infinity stones and ultimately kill half the population of the entire universe.\n\nThat's pretty much the entire plot of the movie. I'm surprised that such a big and epic like this can have such a simple plot that's really easy to follow, which was really refreshing to see with the plots of many of the other Marvel movies have to do with a lot of complicated political issues that aren't always that interesting and can be pretty hard to follow, especially for those who just want to see superheroes just punch each other; but they usually have a lot of good moments and development with the characters to still keep us entertained. In this movie, there's just one simple goal: stop the bad guy. Though that might sound boring, this movie is also highly focused on character development, particularly with Thanos, played marvelously by Josh Brolin. He is the highlight of the movie, which is also really refreshing to see, the villain taking center stage of a comic book movie. Many of the other Marvel villains were really throw away characters and are just there as a tool for the heroes to defeat, hardly any of them were given that much development. The few I can think of that were interesting were Loki, Vulture, Killmonger, and maybe Ego. Considering that Thanos has been built up for six years, I was already sure that they were going to make him a compelling villain, but they handled him in a way that I did not expect at all. He's written as if he's the main character of the movie. In each subplot of the movie, he's given a reason to be a part of it, and by the end of the movie, he actually wins. Every single scene we see him in, he has such presence and such intimidation but also has a very human element to his character. Despite the fact that he's trying to destroy half of all of humanity, he has very good reasons why and you can get behind his motivations, oddly enough. He's also carried the film's emotional weight. In order to obtain the infinity stones, there are some things that he's reluctant to do, adding the humanity to his character. For example, to obtain the Soul Stone he has to sacrifice someone he loves. This really emotional subplot involving him and his adoptive daughter Gamora was so well executed and so well written. The emotions felt earned because they took the time to develop the chemistry between them, and it makes that scene where Thanos sacrifices Gamora even more powerful, you feel for his anguish knowing he didn't want to do it but had no choice.\n\nBut because the emotional weight on Thanos's side of the story is so strong, it does sort of bring down the emotional weight on other characters' subplots. For example, there's supposed to be a really strong emotional bond between Vision and Scarlet Witch. Vision contains the Mind Stone and is supposed to be protected; or destroyed if he has to. Maybe it's just me, but that part of the story, while well done, doesn't nearly interest me as much as most of the other parts of the movie. I don't think it's because we aren't given time for us to feel the emotional connection between them, we already had a couple movies to help with that. I think it's because of the film's overabundance of characters. The movie knows that it has a huge cast of characters and that they are likely to come across a few problems to develop the story. Taking that into consideration, I thought they did a really good job of trying to give each character the right amount of screen time with some excellent pacing and very witty writing. But like I said, it's virtually impossible to make each and every subplot with all these different characters to be equally intriguing, some scenes are going to be a lot more interesting than others depending on the viewer.\n\nWith all this drama being presented, they also needed to balance it out with comedy, which I thought was well handled for the most part. The dialogue is so sharp and so witty, and the delivery from the actors was so well executed. It's the type of comedy you'd expect from a Marvel movie. Lately, the comedy in these movies has really been hammered in, almost as if every single scene there has to be a joke thrown in and it almost becomes overbearing. Here, they have brought it down a bit, which I'm really happy about for a movie like this. Although at times it feels unwarranted meaning we get a joke in a scene where it's meant to be serious. Example, when the Guardians of the Galaxy are about to go up against Thanos, Gamora tells Quill to kill her if he has to so that Thanos can't retrieve the Soul Stone. Immediately after that, they show Drax watching them talk standing still in the corner eating snacks pretending to be invisible. I'm not sure why that was needed. It's funny, but it feels so out of place.\n\nIt's obvious that this movie wants to stand on its own from the rest of the Marvel movies since it has such a huge cast they want it to be epic and huge, this is meant to be the beginning of the end. So they took the action to the next level. It felt huge, it looked amazing, there was so much weight, it was satisfying, and it was so much fun to watch. Seeing all of these different franchise characters battling in the climax of one movie, I had to fight the urge to not stand up from my seat and applaud, it was just epic!\n\nGoing into this movie, I expected they were going to kill off some characters, as a lot of people did. Though I didn't expect them to be killed off in the way they did it. Loki gets killed in the very first scene and it's actually pretty brutal. Just in that scene, you get the feeling that Thanos is already on top of everything and everybody is in danger, you don't know who might die next. And in the end, Thanos actually succeeds; he kills half of all life in the universe, and the movie just ends right there. Never did I think they would end a comic book movie like that, that's a really bold new direction that they took, ending a film where half the cast suddenly just disintegrate. I nearly teared up seeing how Spider-Man died in Tony Stark's arms, emoting so much sadness and fear, it felt so real. Tom Holland really shined in that moment. The only reason I didn't cry is because you just know that everyone who does disappear will come back in the next movie, you can't have characters this popular to be killed off like that.\n\nIf it isn't obvious enough, I really, really enjoyed this movie. It in no way disappointed me. The problems that I had with this movie were problems that I expected going in. There were a lot of genuine surprises not just with the direction they're going with, but also from how intriguing the villain was. The action as always is great to watch, the humor worked really well (for the most part), I loved the emotional weight, Alan Silvestri's score is fantastic, and the pacing was excellent. Seriously, this two-and-a-half hour movie felt more like an hour and 45 minutes, not once was I bored. It's an extremely entertaining movie even if you aren't a fan of comic book movies. I'd say go watch it, but seeing how this is a spoiler review, I'll say go watch it again; it's even better the second time.\n\nGrade: A-","displayName":"Matthew O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2015-11-14T16:23:38.000Z","updateDate":"2018-06-14T20:01:08.000Z","user":{"userId":"925079859","realm":"RT","displayName":"Matthew O","accountLink":"/user/id/925079859"},"score":4.5,"timeFromCreation":"Nov 14, 2015"},{"rating":"STAR_2_5","review":"Too Many Characters, Too many fights, TOO much CGI, Too long = TOO MUCH FILM !","displayName":"Kevin P","displayImageUrl":"https://graph.facebook.com/v3.3/506667069/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2015-08-21T18:00:00.000Z","updateDate":"2018-04-28T13:19:18.000Z","user":{"userId":"798352087","realm":"RT","displayName":"Kevin P","accountLink":"/user/id/798352087"},"score":2.5,"timeFromCreation":"Aug 21, 2015"},{"rating":"STAR_5","review":"This movie was made as perfect as it could have been. There were many scenes that made me truly laugh, there were scenes that left me speechless also. Thanos was the perfect villian that the MCU has sorely needed. In my opinion this movie lived up to the 10 years of hipe. Hats off to Marvel and the Russo brothers and all those who helped create this masterpiece. Can't wait to see what they have in store for us in the untitled avengers 4 movie.","displayName":"Caleb C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2015-08-06T22:15:11.000Z","updateDate":"2018-04-27T07:28:35.000Z","user":{"userId":"971149072","realm":"RT","displayName":"Caleb C","accountLink":"/user/id/971149072"},"score":5,"timeFromCreation":"Aug 06, 2015"},{"rating":"STAR_5","review":"An absolute epic rollercoaster ride from start to finish who’s looking forward to Captain Marvel and Avengers 4 the biggest cliffhanger I’ve ever seen in cinema bring on Avengers 4","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2015-08-02T18:48:57.000Z","updateDate":"2018-05-08T18:14:16.328Z","user":{"userId":"933137653","realm":"RT","displayName":null,"accountLink":"/user/id/933137653"},"score":5,"timeFromCreation":"Aug 02, 2015"},{"rating":"STAR_5","review":"Best MCU movie, different. Great villian and character relations.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2015-05-24T18:02:52.000Z","updateDate":"2018-04-28T20:56:21.719Z","user":{"userId":"932098864","realm":"RT","displayName":null,"accountLink":"/user/id/932098864"},"score":5,"timeFromCreation":"May 24, 2015"},{"rating":"STAR_0_5","review":"This movie.... well it was just sad. Sad that so much work came out for so little ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2015-05-20T17:51:13.000Z","updateDate":"2018-04-26T01:56:52.945Z","user":{"userId":"965582925","realm":"RT","displayName":null,"accountLink":"/user/id/965582925"},"score":0.5,"timeFromCreation":"May 20, 2015"}]}