{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAxMzM0NDAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMTdUMTY6NDY6MTUuMzgyWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzA3NzA3ODQiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMTdUMjE6NDU6MTIifQ=="},"reviews":[{"rating":"STAR_4_5","review":"Avengers: Infinity War has officially made me a Marvel fan. This film achieved everything it set out to accomplish and more. It was pleasantly surprising, even if hardcore Marvel fans could have predicted the outcome. Most importantly, IW left me excitedly anticipating what comes next.\nI've enjoyed many Marvel films but have hesitated to consider myself a dedicated Marvel fan until now. I was never deeply invested in the MCU or it's lore and I'm only cursorily familiar with the source material. That said, the MCU has managed to create some excellent onscreen characters and has presented mostly engaging stories that has consistently offered a value viewing experience. \nAvengers: Infinity War, more than any other Marvel film, has left me standing in respect of what has been accomplished with the franchise.\nIW had to address the convergence of so many elements and characters it's amazing that it managed to bring everything together into a two-and-a-half-hour film without it becoming a complete unmanageable mess. Not only did it succeed in coherently bringing various threads together, but it did so without ever feeling rushed or overly long. I was never bored but I also felt I had moments to breath as well. It didn't feel like a two-and-a-half-hour movie to me.\nA recurring issue I've had with Marvel films has been their lackluster and forgettable villains, with rare exceptions like Loki that have stood out. IW more than made up on this front, offering one of the most compelling depictions of a villain I've seen onscreen in years. This really felt like Thanos' story, and even if the audience can see how he's a deranged psychopath, we can at least relate to his motives and see how he perceives himself in the right. \nOne of my relatively few complaints with the film was that we never really got a sense that the heroes had the same level of conviction or justification for their position as Thanos. I'm hoping this is intentional and something that is expanded upon and explored in the future. That is, I would love to have the remaining protagonists have the introspection necessary to see that they didn't establish a clear and compelling counter argument to Thanos proposition other than the notion that he was wrong/bad and that they we're going to stop him.\nDespite the unprecedented number of characters that the film had to follow throughout the various arcs it never felt overly crowded onscreen and each thread was easily followed up until the culminating point where everything was brought together. The humor throughout the film also felt tonally appropriate and not overdone. IW offered impressive dynamic range in terms of tone, mood, and energy.\nAvengers: Infinity War isn't perfect, but damn near close for what it had to accomplish. There's so much that could have gone wrong with this film, yet it manages to pull off what is the culmination of ten years of investment in the MCU. Despite the downer ending, this film felt like a much awaited payoff and treated the characters and material with the respect that fans have come to expect from this franchise.\nI wouldn't suggest this film to anyone who isn't somewhat familiar with previous MCU films but for anyone who has followed the journey of these heroes over the past ten years it's a must see.","displayName":"Matt B","displayImageUrl":"https://graph.facebook.com/v3.3/100000243171129/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-17T21:45:12.000Z","updateDate":"2018-05-17T21:45:23.000Z","user":{"userId":"970770784","realm":"RT","displayName":"Matt B","accountLink":"/user/id/970770784"},"score":4.5,"timeFromCreation":"May 17, 2018"},{"rating":"STAR_4_5","review":"i loved it. left the movies hyped for avengers 4","displayName":"dominique p","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-17T21:23:39.000Z","updateDate":"2018-05-17T21:25:17.000Z","user":{"userId":"977273723","realm":"RT","displayName":"dominique p","accountLink":"/user/id/977273723"},"score":4.5,"timeFromCreation":"May 17, 2018"},{"rating":"STAR_2_5","review":"another Marvel filck. you should know by know what you're going to get. popcorn fun, and no need to think. although alot of the people praising this film should have done a little thinking. I mean Marvel themselves spoiled all the 'big emotional deaths' when they said Spider-Man 2 will be taking place after IW and deal with the aftermath of it. And Black Panther 2, Guardians 3, and Doctor Strange 2 will be happening after IW. So yeah, they're coming back. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-17T20:57:10.532Z","updateDate":"2018-05-17T20:59:02.877Z","user":{"userId":"874354391","realm":"RT","displayName":null,"accountLink":"/user/id/874354391"},"score":2.5,"timeFromCreation":"May 17, 2018"},{"rating":"STAR_5","review":"I did not see every Marvel movie to prep, and still loved this movie, can't wait to see the fall out in different character films and the storyline conclusion","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10209750740124740/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-17T20:39:15.000Z","updateDate":"2018-05-17T20:39:56.000Z","user":{"userId":"977273674","realm":"RT","displayName":null,"accountLink":"/user/id/977273674"},"score":5,"timeFromCreation":"May 17, 2018"},{"rating":"STAR_0_5","review":"Boooooooo movie it stinks so much","displayName":"Noah W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-17T20:16:53.000Z","updateDate":"2018-05-17T20:17:55.000Z","user":{"userId":"977273648","realm":"RT","displayName":"Noah W","accountLink":"/user/id/977273648"},"score":0.5,"timeFromCreation":"May 17, 2018"},{"rating":"STAR_4_5","review":"really good and up to par as usual. Thanos is quite a unique vilian and its hard at times not to cheer for him. \n\nDC MOVIES STEP YA GAME UP","displayName":"yusef v","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-17T19:11:07.000Z","updateDate":"2018-05-17T19:17:34.000Z","user":{"userId":"964133320","realm":"RT","displayName":"yusef v","accountLink":"/user/id/964133320"},"score":4.5,"timeFromCreation":"May 17, 2018"},{"rating":"STAR_5","review":"Really liked the action! Well done and very entertaining. Made up for the lackluster black panther. Onto ant man and captain marvel.","displayName":"Mike N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-17T18:53:04.000Z","updateDate":"2018-05-17T19:04:40.000Z","user":{"userId":"977266658","realm":"RT","displayName":"Mike N","accountLink":"/user/id/977266658"},"score":5,"timeFromCreation":"May 17, 2018"},{"rating":"STAR_4","review":"Great movie can't wait for part 2","displayName":"Gregory S","displayImageUrl":"https://graph.facebook.com/v3.3/10154438940006580/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-17T18:05:26.000Z","updateDate":"2018-05-17T18:06:12.000Z","user":{"userId":"974989169","realm":"RT","displayName":"Gregory S","accountLink":"/user/id/974989169"},"score":4,"timeFromCreation":"May 17, 2018"},{"rating":"STAR_4_5","review":"This is where the word \"Universe\" fits into the MCU. With all 60 characters in a single frame, the movie nevers seems to use filler too often and never leads into further character development except for Thanos. All 10 years of films since 2008 have been leading to this movie and it's a masterpiece. Never once was I bored or found myself checking the time on my phone. I felt emotionally and mentally gripped and was surprised at every turn. Without a doubt my favorite Marvel movie ever.","displayName":"Josh O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-17T17:36:54.000Z","updateDate":"2018-05-17T17:39:45.000Z","user":{"userId":"977105265","realm":"RT","displayName":"Josh O","accountLink":"/user/id/977105265"},"score":4.5,"timeFromCreation":"May 17, 2018"},{"rating":"STAR_3_5","review":"Very good. A little tedious and drawn out but good. Enjoyed the surprise ending which In typical Marvel fashion is a lead-in to the next installment. Absolutely FANTASTIC character design for Thanos and his minions. I don't think I'm alone in saying that I felt sympathy for Thanos. That's how good his character development is. Thanos steals the movie even though he is a quasi Hitler. There is a snide slam of Christianity in the film which was unnecessary and added nothing to the film. but this is after all, a Disney / Marvel movie, so that kind of demagoguery and manipulation is expected. But would see again. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-17T16:46:15.382Z","updateDate":"2018-05-21T00:04:15.803Z","user":{"userId":"260133440","realm":"RT","displayName":null,"accountLink":"/user/id/260133440"},"score":3.5,"timeFromCreation":"May 17, 2018"}]}