{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NDYyMjY1OTgiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMDM6MjA6NTQifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcwODQxMjAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMDM6MjU6MzgifQ=="},"reviews":[{"rating":"STAR_5","review":"Just fantastic. Saw it last night, seeing it again tonight in IMAX. So very worth it.","displayName":"R T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:25:38.000Z","updateDate":"2018-04-27T06:45:27.000Z","user":{"userId":"977084120","realm":"RT","displayName":"R T","accountLink":"/user/id/977084120"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"The story, a smash and grab heist film, is simple enough, but the sheer number of characters and settings so intricately woven together, the range of emotions, and the vast quantity of surprises make Infinity War one of the best super hero movies ever. The bar is set high from the opening scene and continues to build and rise until the end credits roll (and the post credit scene!) You’ll laugh, you’ll cry, you’ll be scared, and hopeful. It’s different in its approach. It is a serious film, with appropriately timed lighthearted moments, but the rigs of the heart make it a sublime experience.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:25:15.916Z","updateDate":"2018-04-27T03:25:15.916Z","user":{"userId":"260076963","realm":"RT","displayName":null,"accountLink":"/user/id/260076963"},"score":4.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"A very entertaining flick, I really enjoyed the whole movie and would recommend everyone who like this type of movie go see it, you will not be disappointed That said it is not perfect, there were 3 moments where I was just kind of like really... that's dumb, but they were short, spread apart and they did not distract long from my overall enjoyment.","displayName":"Kevin L","displayImageUrl":"https://graph.facebook.com/v3.3/12822000/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:24:30.000Z","updateDate":"2018-04-27T03:27:29.000Z","user":{"userId":"784657293","realm":"RT","displayName":"Kevin L","accountLink":"/user/id/784657293"},"score":4.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"i am thrilled and disrupted","displayName":"john c","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:24:23.000Z","updateDate":"2018-04-27T03:25:19.000Z","user":{"userId":"977188278","realm":"RT","displayName":"john c","accountLink":"/user/id/977188278"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Need more stars please. Excellent going to see it again next week. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:24:14.673Z","updateDate":"2018-04-27T03:25:05.345Z","user":{"userId":"906326635","realm":"RT","displayName":null,"accountLink":"/user/id/906326635"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"best ending ever in history of comic book film.","displayName":"ali R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:23:41.000Z","updateDate":"2018-04-27T03:24:14.000Z","user":{"userId":"977123198","realm":"RT","displayName":"ali R","accountLink":"/user/id/977123198"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4","review":"Avengers: Infinity War por fin está aquí y no decepcionará a ningún fan de Marvel. ¿Puede usted imaginar las enormes y, en muchos casos irreales, expectativas que enfrentaba el estreno de esta película? Pues bien, permítame asegurarle que estamos ante un filme largo, muy bien dirigido, con un excelente desarrollo de la mayoría de los personajes (que son muchos), con momentos de legítimo buen humor, escenas emotivas y batallas épicas. Los hermanos Russo nos entregan el primer filme con el que culmina el arco de historias del Universo Cinematográfico de Marvel asegurándose de darnos a un villano con motivaciones sumamente creíbles (al punto en el que el espectador llega a sentir cierta empatía hacía él en algunos momentos) pero con, asimismo, un carácter imponente y prácticas aterradoras. Además, esta película nos permite observar momentos saturados de emociones con varios de los héroes con los que nos hemos encariñado durante todos estos años, destacando, a mi parecer, Iron Man, Thor, Gamora, Spider-Man, Scarlet Witch y Doctor Strange. Las actuaciones son en su mayoría excelentes, el guion es balanceado y coherente, los efectos especiales de primer nivel y la banda sonora genérica pero suficiente. Esta es quizá la película de superhéroes más grande de la historia hasta este momento (aunque ciertamente se siente como el primer acto de una obra en dos partes), la cual logra satisfactoriamente cumplir con las expectativas generadas de una manera magistral. A mi parecer merece 4 sólidas estrellas de 5 y mi más alta recomendación (particularmente en formato IMAX, en el que la totalidad del filme fue filmado). Infinity War es, en una palabra, épica. La espera valió totalmente la pena.","displayName":"Rodolfo Q","displayImageUrl":"https://graph.facebook.com/v3.3/158111231216766/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:21:13.000Z","updateDate":"2018-04-27T03:22:32.000Z","user":{"userId":"972701556","realm":"RT","displayName":"Rodolfo Q","accountLink":"/user/id/972701556"},"score":4,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"The movie delivered on what i hope specially the final act although it may be a fulfilling movie as a comic fan and mcu fan it indeed had some phasing issue brought by this many characters and sometimes it feels rushed again due to the same problem but for the villain perspective this movie is beautiful and hits it out of the park for me.","displayName":"Johanne C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:21:03.000Z","updateDate":"2018-04-27T03:24:13.000Z","user":{"userId":"977241779","realm":"RT","displayName":"Johanne C","accountLink":"/user/id/977241779"},"score":4.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"I have never felt so empty after watching a movie. 10/10. I cannot wait to see what they do next. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:21:01.952Z","updateDate":"2018-04-27T03:21:01.952Z","user":{"userId":"973114674","realm":"RT","displayName":null,"accountLink":"/user/id/973114674"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Alright so I'm going to try my best to keep this as a NON-SPOILER REVIEW, as there are many shocking plot twists and surprises and I wouldn't want to ruin that experience for you. Wow! What a ride! This film was everything I wanted it to be! Exciting, thrilling, and beautifully crafted over the course of 10 years and 19 films. Yes, I have waited for this ever since the inception of the MCU back in 2008, but more importantly as someone who read Jim Starlin's Infinity Gauntlet series 17 years ago. It was breathtaking and jaw dropping to see something of this scope come to life on the big screen from the very same comics I read as a child. @therussobrothers did an amazing job balancing the tone of all the characters (comedic and serious tones) and giving every character their spotlight without making it feel too overcrowded or bloated. The action itself in some of the scenes were taken directly from the pages of Hickman's 'Infinity' run couple of years ago which made me really happy to see. Although there were a lot of surprises in the film, the one element that surprised me the most was the amount of emotional weight that the film carried, it really helped develop certain character arcs especially Thanos, and man oh man when Thanos comes on screen, he really steals it! Not only is he frightening and intimidating, but he has a very grounded and philosophical twist to his character that makes you sympathize for him and his surprisingly emotional motivations. Action was great and easy to follow with no shaky cams this time (yaaaaay!), but the overall story and execution was better than Civil War and Winter Soldier (which everyone knows I love to death). In the end this was everything I hoped and wanted to see in an Infinity War film and I really can't wait for Avengers 4 next year! Whatever you do, see this film before someone spoils it for you as there are many idiots going and spoiling it for others who haven't had the time to see it on opening day! Make sure you experience it in IMAX if you have one next to you, the screen is much bigger and visuals look more vibrant and sharp! Oh and there is one post credit scene so stick around after the credits for a treat!","displayName":"Raashed M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T03:20:54.000Z","updateDate":"2018-04-27T03:22:38.000Z","user":{"userId":"946226598","realm":"RT","displayName":"Raashed M","accountLink":"/user/id/946226598"},"score":5,"timeFromCreation":"Apr 27, 2018"}]}