{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcwMDcyNjUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDgtMTZUMDI6MDk6NTMifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY2NjY2NDAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDgtMTdUMTM6MzA6MTkifQ=="},"reviews":[{"rating":"STAR_3","review":"This is an 'Aw, Hell Ya!' movie.","displayName":"Araminta G","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-17T13:30:19.000Z","updateDate":"2018-08-17T13:30:48.000Z","user":{"userId":"976666640","realm":"RT","displayName":"Araminta G","accountLink":"/user/id/976666640"},"score":3,"timeFromCreation":"Aug 17, 2018"},{"rating":"STAR_2_5","review":"I am one of the people that, until last years tandem hype of Black Panther and Infinity War hype, consistently under-appreciated the cultural pull of the Marvel Cinematic Universe.  And that's because it's stupid.  It's stupid how much money goes into it, it's stupid how safe each film is, it's stupid how each film has the same, bland, stupid CGI action sequences, it's stupid that they made another Spider Man reboot in under 15 years, just so it fits in with the cannon, it's stupid how stupid they think audiences are and it's stupid how well they get away with it.\n\nThe achilles heel of the MCU is it's tonal inconsistency, and here it's on full display.  Films like Guardians and Thor Ragnorok openly acknowledge their own ridiculousness, and to me, that makes them the stronger entries in the series.  But how are you going to put that camp in the same room as the way-too-relevant Black Panther, and the moody redemption story of Iron Man, and all the while have goofy-looking purple wrinkle chin guy as your main villain, with an apocalyptic motivation that's stupid even for the MCU?  There's no sense of a grand vision, as hard as it tries to make you believe in one.  \n\nNone of this is too surprising.  Incessant reboots, ridiculous crossovers and poorly formulated operatic tropes are par for the course in the comic book world - why shouldn't we expect them in the films?  Which brings me to the film's most egregious sin.  Minor spoiler: this should rightly be called Avengers Infinity War Part 1, because, as shocking as the ending is at first glance, there's no way in Hades that they're going to let that kind of damage stand.  Not when there's money to part you from.  \n\nIn summary, I enjoyed Avengers Infinity War enough to justify the ticket price, which is good because it's going to be the last MCU movie I see (or at least pay for).  The cynicism is way too transparent at this point, and no amount of fun gags or tag team fights will redeem future entries.","displayName":"Corey B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-17T13:06:12.000Z","updateDate":"2018-08-17T13:35:12.000Z","user":{"userId":"916426220","realm":"RT","displayName":"Corey B","accountLink":"/user/id/916426220"},"score":2.5,"timeFromCreation":"Aug 17, 2018"},{"rating":"STAR_5","review":"I love the action of Avengers: Infinity War. It has a plot like never before and I love how they brought Thanos and all the marvel characters to life","displayName":"Jeremiah%20 B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-17T10:51:13.000Z","updateDate":"2018-08-17T10:54:46.000Z","user":{"userId":"977423931","realm":"RT","displayName":"Jeremiah%20 B","accountLink":"/user/id/977423931"},"score":5,"timeFromCreation":"Aug 17, 2018"},{"rating":"STAR_5","review":"The best movie I have ever seen in my life! I will always remember seeing this one in theaters as it is the most fun I have ever had in a movie theater!! Amazing action scenes and amazing character development of The God of Thunder aka Thor! ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-17T06:27:50.625Z","updateDate":"2018-08-17T06:27:50.625Z","user":{"userId":"260178016","realm":"RT","displayName":null,"accountLink":"/user/id/260178016"},"score":5,"timeFromCreation":"Aug 17, 2018"},{"rating":"STAR_2","review":"Very bad movie. Non-sense. Though good CGI and actors perform well. Still a whole mess.","displayName":"Yvaine B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-17T02:21:45.000Z","updateDate":"2018-08-17T02:24:27.000Z","user":{"userId":"977077127","realm":"RT","displayName":"Yvaine B","accountLink":"/user/id/977077127"},"score":2,"timeFromCreation":"Aug 17, 2018"},{"rating":"STAR_0_5","review":"Undoubtedly the worst of the series. The Hulk is a no show because well you know, the writers couldn't figure out a way. The Vision should have died, couldn't die, did die, but then didn't die then did. And of course at the fight-to-the-finish the bad guy decides not to kill anyone who might be needed for the end game. The only thing to wish for is another Guardians of the Galaxy movie some day. Oh, by the way, it's the first of a greedy number of Infiniry War movies because no surprise it doesn't end here. But, Isn't Infinity War Two an oxymoron?","displayName":"Ted S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-16T17:48:48.000Z","updateDate":"2018-08-16T17:59:54.000Z","user":{"userId":"945007771","realm":"RT","displayName":"Ted S","accountLink":"/user/id/945007771"},"score":0.5,"timeFromCreation":"Aug 16, 2018"},{"rating":"STAR_5","review":"Just a fantastic piece of work, the only thing I felt a bit off about, is that i feel it could have benefited from a longer runtime, flesh out thanos a bit more, but it does amazing with what its got!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/2250264948335321/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-16T15:24:44.000Z","updateDate":"2018-08-16T15:28:01.000Z","user":{"userId":"977422376","realm":"RT","displayName":null,"accountLink":"/user/id/977422376"},"score":5,"timeFromCreation":"Aug 16, 2018"},{"rating":"STAR_3_5","review":"Very good, action-pacted! Some elements could've been handled better, but that's alright given the fact that it was the Russo brothers directing :/","displayName":"Valery U","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-16T13:00:17.000Z","updateDate":"2018-08-16T13:01:18.000Z","user":{"userId":"977422165","realm":"RT","displayName":"Valery U","accountLink":"/user/id/977422165"},"score":3.5,"timeFromCreation":"Aug 16, 2018"},{"rating":"STAR_4_5","review":"Tras 10 años y 18 películas, finalmente llegó el estreno de la tan esperada Avangers: Infinity War, la película más grande y ambiciosa del universo cinematográfico de Marvel.\nFinalmente Thanos decide calzarse el guantelete del infinito y buscar por su cuenta las seis Gemas del Infinito para lograr su objetivo: acabar con la mitad de la vida en todo el universo y así llegar al perfecto equilibro del todo. Para impedir que Thanos se haga con las gemas, todos los héroes deberán unirse para acabar con la amenaza más grande a la que se han tenido que enfrentar.\nLa película no para un segundo. Hay mucha acción, hay mucho humor (del que ya nos acostumbró Marvel), hay muchas referencias, hay muchas revelaciones y sorpresas, y hasta hay emoción, algo no tan común en este tipo de películas. Las dos horas y media de duración pasan volando y dan ganas de que dure dos horas.\nLa conexión entre tantos personajes (muchos de los cuales jamás se habían encontrado antes) era de lo más esperado, pero también de lo más temido en cuanto a cómo iba a suceder, y sin duda se resolvió de la mejor manera. Todos tienen su momento para destacarse y más allá de que por momento la trama transcurre en 3 o hasta 4 locaciones bien diferentes, la narración logra que lo saltos especiales transcurran de una manera coral sin provocar grandes agujeros.\nMucho se puede hablar de Thanos desde su construcción psicológica y emocional, pero por el momento vamos a decir que es simplemente el mejor villano que hemos visto en pantalla. Siempre este fue un punto flojo en las películas de Marvel, pero con Thanos redimieron todo y crearon al villano perfecto con una verdadera motivación, y a quien incluso se puede considerar el verdadero protagonista de la película.\nInfinity War seguro pase a la historia como una de las mejores películas de superhéroes de la historia, y sin entrar en ningún tipo de spoiler, deja la puerta abierta para que Avengers 4 pueda ser aún más grande.\nEs una película hecha para fanáticos, y los fanáticos la van a amar.","displayName":"Brian B","displayImageUrl":"https://graph.facebook.com/v3.3/1104182806/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-16T10:22:14.000Z","updateDate":"2018-08-16T10:22:16.000Z","user":{"userId":"885093556","realm":"RT","displayName":"Brian B","accountLink":"/user/id/885093556"},"score":4.5,"timeFromCreation":"Aug 16, 2018"},{"rating":"STAR_3","review":"Visually well done, actors play their parts well, but the overall plot is very tired and obvious.  The way Thanos so easily gets some of the Infinity Stones makes little sense other than the fact that this a movie and he needs to get them quick.","displayName":"Lance N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-08-16T02:09:53.000Z","updateDate":"2018-08-16T02:31:38.000Z","user":{"userId":"977007265","realm":"RT","displayName":"Lance N","accountLink":"/user/id/977007265"},"score":3,"timeFromCreation":"Aug 16, 2018"}]}