{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NDExMjg0NjUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDEtMTBUMDI6MzQ6MjkifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MzEzMTYyNTciLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDEtMTZUMTc6NDI6MjcifQ=="},"reviews":[{"rating":"STAR_5","review":"Avengers: Infinity War - Review (2018)\n\nThe Good\nJosh Brolin as Thanos is Phenomenal and they instantly as this movie starts you see how fucking badass he is, this is his movie and his story and he's not just generic villain 10, you understand what he was doing and why he was doing it even though you definitely fucking hate this monster by the end of this movie and you definitely want him to die in Avengers 4, the Visual Effects on him alone is amazing \n\nThe Russo Brothers Flawless Direction and they pulled off the impossible like what Joss Whedon did with the first Avengers and you see other Studios try to copy and stupidly rush cough Sony with Venom, cough WB and Justice League, and cough Universal with The Mummy. The Russo's do some ballsy moves in making a amazing movie that's haunting, funny, emotional. \n\nChris Hemsworth as Thor is the Main Hero MVP with Rocket Raccoon and Groot (Sweet Rabbit is the Fucking Best line of the year) put Thor in Guardians of the Galaxy Vol. 3 \n\nRobert Downey Jr. Iron Man gets some really amazing scenes and he had a very good Character Arc along with Benedict Cumberbatch as Doctor Strange and Tom Holland as Spider-Man got a really nice balance of scenes which are amazing in his iconic Iron Spider Suit.\n\nElizabeth Olsen as Scarlet Witch and Paul Bettany as Vision definitely had some of the best emotional weight of the film.\n\nChris Pratt as Peter Quill as Star Lord had a lot of emotional depth too with Zoe Saldana as Gamora\n\nChris Evans as Steve Rogers is really great\n\nChadwick Boseman as T'Challa / Black Panther is still a badass\n\nMark Ruffalo as Bruce Banner / The Hulk has a lot of great moments\n\nSo many characters there were a lot they were all great\n\nThe Humor once again works and even though this is a darker film than most of the other Marvel films, you still need the humor to bring you up for most of the movie until certain points that are emotional.\n\nDifferent Characters interacting with each other like Iron Man, Doctor Strange and Spider-Man dynamic, Thor and Guardians (Thor and Rocket Raccoon are pure fucking gold Marvel you made a Billion Dollars if thats a movie), Iron Man and Star Lord, etc and etc \n\nThe Black Order are badass especially Proxima Midnight and Ebony Maw and Maw is fucking amazing. \n\nAlan Silvestri's flawless Score\n\nThe Fight Choreography is some of the best I have ever seen its nearly on the same level as Lord of the Rings and its very heart punching.\n\nIt still progresses the characters and one complaint people are having that needed to watch the other 18 films, like No Shit Sherlock every characters has progressed through each film, if you don't know any character or seen all 18 films before this movie then why are you watching this.\n\nThe 3rd act amazingly balances 3 Battle Sequences and is emotional and gut punching and leaves you not knowing where Marvel goes from here now and the credits is brillian and it will break you and if you possibly don't at least tear up, you a heartless monster.\n\nThe Visual Effects are phenomenal which I feel will win Best Visual Effects \n\nThere are amazing Surprises\n\nThe Post Credit Scene is great \n\nThe Bad\nSmall nit pick not a huge negative Dave Bautista as Drax is just there for comedy which is fine he's 100% funny, but he gets 1 moment of serious and they take it away.\n\nAnother nit pik there wasn't enough of a certain character won't spoul , but I can see in Avengers 4 he will have more time to see.\n\nOverall: Marvel once again wins and did the impossible once again you see Warner Brothers they didn't rush like Justice League. Its all thanks to Kevin Feige the man is a genius (where other company's with Universes fail) and without him we wouldn't be 19 Movies strong.\n\nOverall Grade: A+","displayName":"Jacob M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-01-16T17:42:27.000Z","updateDate":"2018-04-27T18:39:24.000Z","user":{"userId":"931316257","realm":"RT","displayName":"Jacob M","accountLink":"/user/id/931316257"},"score":5,"timeFromCreation":"Jan 16, 2018"},{"rating":"STAR_3_5","review":"I feel like this movie has to many characters that it does not seem fair that some characters  don't  get the same amount of screen time great ending though","displayName":"veronica h","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-01-15T11:27:07.000Z","updateDate":"2018-06-22T19:13:49.000Z","user":{"userId":"977055470","realm":"RT","displayName":"veronica h","accountLink":"/user/id/977055470"},"score":3.5,"timeFromCreation":"Jan 15, 2018"},{"rating":"STAR_4","review":"Cool villain and really interesting to see all the different characters and the different worlds and galaxies. Loved the weapons forge and the dwarf character played by Peter Dinklage. Nice extra spoiler scene at the very last minute at the end of all the credits. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-01-14T17:50:33.973Z","updateDate":"2018-08-19T16:49:39.889Z","user":{"userId":"787567681","realm":"RT","displayName":null,"accountLink":"/user/id/787567681"},"score":4,"timeFromCreation":"Jan 14, 2018"},{"rating":"STAR_3_5","review":"I mean, it's pretty good, but not what the hype makes it. There are some amazing moments, a few tearjerk moments too but when it's all said and done, you can predict the next movie and you'll feel slightly cheated. Plus, I couldn't give it more than 4 for the atrocious CGI with Hulk at that end of the movie, appalling. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-01-14T15:22:18.297Z","updateDate":"2019-02-19T01:13:40.654Z","user":{"userId":"909840246","realm":"RT","displayName":null,"accountLink":"/user/id/909840246"},"score":3.5,"timeFromCreation":"Jan 14, 2018"},{"rating":"STAR_5","review":"Excellent plot with superb special effects. I understand this is the first of two parts although it appears to stand on its own. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-01-13T01:14:18.747Z","updateDate":"2018-05-05T00:19:46.141Z","user":{"userId":"912534062","realm":"RT","displayName":null,"accountLink":"/user/id/912534062"},"score":5,"timeFromCreation":"Jan 13, 2018"},{"rating":"STAR_5","review":"amazing, edge of seat exciting, must see","displayName":"Oliver G","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-01-12T17:20:03.000Z","updateDate":"2018-06-30T07:36:16.000Z","user":{"userId":"976979342","realm":"RT","displayName":"Oliver G","accountLink":"/user/id/976979342"},"score":5,"timeFromCreation":"Jan 12, 2018"},{"rating":"STAR_5","review":"It really surprised me so much. The best marvel movie yet.","displayName":"Daniel D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-01-12T15:49:37.000Z","updateDate":"2018-12-11T12:18:18.000Z","user":{"userId":"976387492","realm":"RT","displayName":"Daniel D","accountLink":"/user/id/976387492"},"score":5,"timeFromCreation":"Jan 12, 2018"},{"rating":"STAR_5","review":"This was a very good movie except I did not like the black panther turning to dust or any of the good guys just means no more movies","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-01-11T19:36:57.882Z","updateDate":"2018-04-27T19:54:46.787Z","user":{"userId":"965586731","realm":"RT","displayName":null,"accountLink":"/user/id/965586731"},"score":5,"timeFromCreation":"Jan 11, 2018"},{"rating":"STAR_4","review":"So, this finally happened. \"Avengers: Infinity War\" is a cinematic milestone whatever the end result. The Russo brothers managed to successfully combine all our favorite superheroes in one movie. Does it always work? Not entirely, but it sure is a very good result. To be honest I had some problems with the first hour. Many characters interact for the first time, sure it was fun, but the movie is jumping from scene to scene making it difficult to get into it. But then the story keeps progressing and the rest of the movie not only pulls you in, but actually holds your heart and presses it till the end. There were some amazing action scenes, and that is an understatement. The battle sequences had such energy but also a sense of doom, anything could happen. It was an entirely new experience. You never really could guess how many chances the filmmakers took with this one, and by the end it feels like the story now can get anywhere. It's amazing how I can't see exactly what is going to happen next. Thanos is a very present villain, very well crafted. His actions are somewhat understandable. All this makes into a very gripping story. \"Infinity War\" was fun, exciting, emotional and no matter what, a great achievement. It was not mind-blowing, I wish it was, but for what it's worth, it was a good movie. I really want to watch the next installment now! It feels like they must be seen as one.","displayName":"Gregory M","displayImageUrl":"https://graph.facebook.com/v3.3/100000284876382/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-01-11T08:11:00.000Z","updateDate":"2018-05-09T12:24:12.000Z","user":{"userId":"906667808","realm":"RT","displayName":"Gregory M","accountLink":"/user/id/906667808"},"score":4,"timeFromCreation":"Jan 11, 2018"},{"rating":"STAR_5","review":"One of the best MCU films to date!!","displayName":"Simon H","displayImageUrl":"https://graph.facebook.com/v3.3/100003283750430/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-01-10T02:34:29.000Z","updateDate":"2018-04-26T14:47:57.000Z","user":{"userId":"941128465","realm":"RT","displayName":"Simon H","accountLink":"/user/id/941128465"},"score":5,"timeFromCreation":"Jan 10, 2018"}]}