{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF83OTA1MjI4NzUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDFUMDk6MTI6NTMifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY5NTQyMjAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDFUMDk6NTE6MDMifQ=="},"reviews":[{"rating":"STAR_4","review":"Entertaining flick bringing together the whole MCU. Some choices didn't wir though, since anyone with half a brain could have predicted at least some of the twists - sadly the avengers couldn't. But still, the movie was a lot of fun, the villain looks real even though he is entirely CGI (at least in IMAX). \nI expect part two will undo most of this movies shock value - at least if Dr. Stranges descision was correct ??","displayName":"Pascal B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T09:51:03.000Z","updateDate":"2018-05-01T09:55:01.000Z","user":{"userId":"976954220","realm":"RT","displayName":"Pascal B","accountLink":"/user/id/976954220"},"score":4,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"Hilarious!! I did fall asleep during one of the endless fight scenes though, and not sure I liked the ending. But loved they non-stop action and fun. Oh, and Chris Hemsworth and Chris Pratt on the same big screen - gold! ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T09:43:36.865Z","updateDate":"2018-05-01T09:43:36.865Z","user":{"userId":"795036002","realm":"RT","displayName":null,"accountLink":"/user/id/795036002"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"This is why we go to the movies to see movies. This film flat out delivers. A must see inside a theater. 5/5.","displayName":"W W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T09:43:15.000Z","updateDate":"2018-05-11T21:32:19.000Z","user":{"userId":"977227343","realm":"RT","displayName":"W W","accountLink":"/user/id/977227343"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_4_5","review":"Wow, this exceeded my expectations, what a ride! A worthy pay-off for 10 years of marvel movies...","displayName":"Jesse C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T09:37:17.000Z","updateDate":"2018-05-02T02:49:10.000Z","user":{"userId":"977252487","realm":"RT","displayName":"Jesse C","accountLink":"/user/id/977252487"},"score":4.5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_2","review":"This movie was all over the place with no clear theme or reasoning behind the story. We finally have a chance to see Thanos and yet we get barely any back story as to his motives as the villain. The only thing this movie seems to deliver on are funny quips and great fight scenes.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/628632377469138/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T09:28:12.000Z","updateDate":"2018-05-01T09:30:01.000Z","user":{"userId":"977252480","realm":"RT","displayName":null,"accountLink":"/user/id/977252480"},"score":2,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"a fitting end to a story 10 years in the making, the action was gripping and the huge moments felt real and the universe never felt more connected. watching the Mad Titan dominate the heroes that in the past has seemed indomitable was oddly glorifying. the ending leave everyone shaken. will be seeing a second time this upcoming weekend.","displayName":"Michael W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T09:27:35.000Z","updateDate":"2018-05-01T09:34:40.000Z","user":{"userId":"977225353","realm":"RT","displayName":"Michael W","accountLink":"/user/id/977225353"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_5","review":"(NO SPOILERS IN FIRST AND LAST PARAGRAPH)Avengers infinity war is up to the hype. Thanos is a villain with motives that at their core you can understand and relate to yet his methods are one that make him a true super villain. Infinity war has, as everyone is saying, ginormous ambitions and they are successfully and creatively realised through brilliant use of sub plots that are (unlike star wars 8) interesting and relevant to the main story line with groups characters that have never met before creating interesting and often comedic dynamics that pays off. The movie does not drift from its main story line of Thanos trying to obtain they infinity stones (this was told in the trailer) and keeps focused as it has to be while trying to juggle this many characters. Some of my cons that are spoiler free is Iron man's new suit which seems to have infinite abilities that removes itself from what made the iron man suit so iconic, loved and yet grounded is is just outright unbelievable. This may be personal preference but i'm sure others will agree. (POSSIBLE BUT NON INTENTIONAL SPOILERS IN THE NEXT PARAGRAPH ONLY, IF YOU READ ON AND HAVE NOT DONE SO THEN DO SO AT YOUR OWN RISK. IF YOU DON'T WANT IT SPOILED AT ALL THEN SKIP TO THE LAST PARAGRAPH).\n\nThe film even does a good job of bringing back some characters that nobody would've thought of from many marvel movies ago. It still leaves with some unanswered questions that I would've liked a little more information on such as why does the Hulk refuse to come back, although this also creatively makes the hulk almost a separate and unique character other than merely an angry alter ego of Bruce Banner. It also leaves the most important question of \"WHAT HAPPENS NEXT?\". What happens to the world? What happens to the rest of the universe? What happens to the avengers? All questions I look forward to being answered in the next film.\n\nOver all this is a very successful and focused film that I thoroughly enjoyed watching, it is a refreshing take on a generally overdone genre that people begin to get bored of, this film brings back life into it. The Russo Brothers have yet again proved themselves as very capable directors and have shown that they have the balls to do what is needed and totally unexpected. If you have not seen this film go see it before it's too late and it eventually gets spoiled online because you've waited too long. Before seeing this I recommend at a minimum watching or  rewatching Captain America Civil War, Thor Ragnarok and Black panther and if at all possible most of the other Marvel CU films. Congratulations Russo brothers on creating and marking a monumental milestone in cinematic history, I can't wait for what comes next.","displayName":"Cameron M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T09:23:18.000Z","updateDate":"2018-05-06T13:06:47.000Z","user":{"userId":"977252399","realm":"RT","displayName":"Cameron M","accountLink":"/user/id/977252399"},"score":5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_4_5","review":"I have a high expectation from the movie, from the trailer it looks very good. After watch it, I can say It is near perfect for me. I am satisfied with the length of the movie which makes each characters have a good proportions in this film. The soundtrack is lovely. It also hilarious in some scene but without losing the essence of sadness and seriousness from this movie. It is very hard for me to find a negative side, I just little bit disappoint that the minion of Thanos is easily defeated in the later of the movie (It could be more intense I think). My conclusion is everyone should watch this movie one of the best movie in 2018. It worth the money and your time. I give it a score 9.5 of 10.\nPs : Don't forget to see the post-credit scene, which will give you a clue about the next movie. Good job Marvel","displayName":"Made R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T09:21:01.000Z","updateDate":"2018-05-01T09:47:39.000Z","user":{"userId":"977100581","realm":"RT","displayName":"Made R","accountLink":"/user/id/977100581"},"score":4.5,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_2","review":"The ending made me so depressed","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T09:19:36.339Z","updateDate":"2018-05-01T09:19:36.339Z","user":{"userId":"976518025","realm":"RT","displayName":null,"accountLink":"/user/id/976518025"},"score":2,"timeFromCreation":"May 01, 2018"},{"rating":"STAR_4","review":"Hardcore, savage, what GoT lacks, this is compliments it.\n\nThe only disappointing thing in the movie is the poor motivation of Thanos to act.","displayName":"Esaú O","displayImageUrl":"https://graph.facebook.com/v3.3/537081894/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-01T09:12:53.000Z","updateDate":"2018-05-01T09:14:18.000Z","user":{"userId":"790522875","realm":"RT","displayName":"Esaú O","accountLink":"/user/id/790522875"},"score":4,"timeFromCreation":"May 01, 2018"}]}