{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF83OTU1NzQyMzkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDYtMTVUMDM6NDM6MTguMDE2WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAxNDg5MjUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDYtMTVUMTk6NTY6MDQuNjkyWiJ9"},"reviews":[{"rating":"STAR_5","review":"It was a really good movie... But it pissed me off when half the characters disappeared ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-15T19:56:04.692Z","updateDate":"2018-08-19T05:32:29.154Z","user":{"userId":"260148925","realm":"RT","displayName":null,"accountLink":"/user/id/260148925"},"score":5,"timeFromCreation":"Jun 15, 2018"},{"rating":"STAR_4_5","review":"\"And now the rains weep o'er our halls...\"  \n\nMy friend and colleague said very aptly that there is little else to say of Infinity War or the Marvel Cinematic Universe that hasn't been said before.  But that's the thing isn't it?  After all the memes of people fading away into odd triangles and \"I don't feel so good, Mr. Stark\" quotes out of context, we lose sight of just how damn good this movie is.  Which presents its own problem.  The MCU is taken so directly at face value and assumed to be of quality, that the cinematic merits of specific pictures mean less as time goes on.  We end up talking about what happened and not WHY it happened or WHAT it means.  Considering I am practically a few months late to this party, this is more a retrospective than a review, per se.  Which allows me a unique advantage - I can peer out at the impact and consequences of a film.  Looking at older movies, whether its two months old or two decades old, is like looking at an old car.  You pop open the hood and you can verify if it was merely a creation of the moment or something truly beastly - a powerhouse that had all the right ingredients to smoke the competition and leave an impression on your memory.\n\nIn case you are one of the five people in the developed world who has not seen this installment, Infinity War combines all the characters including the Avengers and the Guardians of the Galaxy and pits them against Thanos, the BIG BAD that the series has been setting up for the last seven years.  And GOOD GOD I didn't think a giant purple space monster could be as compelling or interesting as he is.  All the performances are great, as you would expect (in particular Robert Downey Jr.'s Tony Stark), but the real standout was Josh Brolin's Thanos.  An intimidating and powerful villain without measure, Thanos epitomizes Silver Age cosmic terror.  Comic book fans are quick to point out that his motivation is completely different here, which is true. Thanos is not competing for Death's affection with Deadpool and routinely embarrassing himself doing so.  No, he wishes to cull half the universes' population in order to \"save it,\" almost sounding more like The Reapers from Mass Effect, than the usual comic book antagonist.  He displays a cold, Utilitarian philosophy and never deviates from it.  And by God, at moments you almost root for him, with the film not going out of its way to condemn him.  Yes, he is one of those villains who ABSOLUTELY believes that he is correct and must take on the heavy task of doing lesser evil to achieve greater good, similar to Magneto, Killmonger, or Raz al Gul.  Some have posited that Thanos is the true protagonist of Infinity War and the traditional hero's arc is reserved for him.  Your mileage may vary on that claim, but he certainly drives the action.  And even though he has admiration and respect for a number of Earth's Mightiest Heroes, he will plow through them in order to achieve universal balance and stability.\n\nWhich brings me to my most salient point.  Avengers takes the formula of most of their franchise, with our heroes going through their own individual plot arcs and then coming together for an epic stand...only for them to get their asses HANDED to them every time.  Before, all came together nicely.  But not this time.  Sure, they can reduce damage and delay the inevitable, but that's all.  It's a subversion of the MCU formula and the way that these characters come to grips with that realization reveals who they really are.  Many critics and fans have labeled it THE EMPIRE STRIKES BACK OF MARVEL.  (Because everything needs to compared to goddamn Star Wars these days.)  No, I think it has similarities to...something else.  Some of you may have noticed that Game of Thrones quote at the beginning of this essay.  It's not by accident.  Infinity War is the Game of Thrones Season 3 of the MCU, complete with false hope, a Red Wedding, and hell...it even has a Robb Stark figure (Peter Quill/Starlord) for people to simultaneously feel sorry for and to blame for the depressing moments to follow.  \n\nMuch debate has occurred whether many character \"deaths\" are permanent and whether or not this brings down the overall impact if they are likely to be undone in the next installment.  I would say that the vast majority are impermanent, but this still should not reduce the sting or the impact of this bold movie.  How so many pieces come together is amazing and the Russo Brothers deserve more credit than they get for orchestrating it all together so beautifully.  I'd argue it's the most momentous picture of the MCU.  It may not be the best, but its certainly in the top five, and it will remain an infamous, but enjoyable moment in the collective consciousness of the moviegoing public for decades to come.","displayName":"Joshua S","displayImageUrl":"https://graph.facebook.com/v3.3/7817787/picture","isVerified":false,"isSuperReviewer":true,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-15T17:22:58.000Z","updateDate":"2018-06-15T17:23:53.000Z","user":{"userId":"783449112","realm":"RT","displayName":"Joshua S","accountLink":"/user/id/783449112"},"score":4.5,"timeFromCreation":"Jun 15, 2018"},{"rating":"STAR_3_5","review":"Well made movie, but glorifies evil","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-15T15:00:58.825Z","updateDate":"2018-06-15T15:00:58.825Z","user":{"userId":"969964919","realm":"RT","displayName":null,"accountLink":"/user/id/969964919"},"score":3.5,"timeFromCreation":"Jun 15, 2018"},{"rating":"STAR_5","review":"all of this universe builds up to this epic moment that pays off big time","displayName":"Mark S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-15T14:48:27.000Z","updateDate":"2018-06-15T14:49:22.000Z","user":{"userId":"977287049","realm":"RT","displayName":"Mark S","accountLink":"/user/id/977287049"},"score":5,"timeFromCreation":"Jun 15, 2018"},{"rating":"STAR_4_5","review":"This movie is one of the best movie of this year","displayName":"Jacob%20 S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-15T14:47:26.000Z","updateDate":"2018-06-15T14:48:26.000Z","user":{"userId":"977320712","realm":"RT","displayName":"Jacob%20 S","accountLink":"/user/id/977320712"},"score":4.5,"timeFromCreation":"Jun 15, 2018"},{"rating":"STAR_5","review":"Avengers: Infinity War is the culmination of everything before it. If you have been invested in these characters, get ready to be flipped on your head and expect the unexpected. Not only is this a very crowd pleasing experience, it's just a blast to watch.","displayName":"C.J. H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-15T12:44:37.000Z","updateDate":"2018-06-15T12:46:30.000Z","user":{"userId":"912083053","realm":"RT","displayName":"C.J. H","accountLink":"/user/id/912083053"},"score":5,"timeFromCreation":"Jun 15, 2018"},{"rating":"STAR_4","review":"without too many spoilers, but a  fantastic attempt to WEAVE several plots from multiple films together into ne convergence.\nIf the end f the film is permanent then its a bold move by disney.","displayName":"N C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-15T12:28:02.000Z","updateDate":"2018-06-15T12:30:03.000Z","user":{"userId":"977320553","realm":"RT","displayName":"N C","accountLink":"/user/id/977320553"},"score":4,"timeFromCreation":"Jun 15, 2018"},{"rating":"STAR_5","review":"Best movie ever no other movie like it","displayName":"Derrick J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-15T11:50:01.000Z","updateDate":"2018-06-15T11:50:29.000Z","user":{"userId":"977320530","realm":"RT","displayName":"Derrick J","accountLink":"/user/id/977320530"},"score":5,"timeFromCreation":"Jun 15, 2018"},{"rating":"STAR_4_5","review":"Simply incredible. The best of all marvel movies so far. Everything you could ever want.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-15T05:35:06.451Z","updateDate":"2019-02-13T19:57:33.757Z","user":{"userId":"917838498","realm":"RT","displayName":null,"accountLink":"/user/id/917838498"},"score":4.5,"timeFromCreation":"Jun 15, 2018"},{"rating":"STAR_5","review":"More fun each time I saw it.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-15T03:43:18.016Z","updateDate":"2018-06-15T03:43:18.016Z","user":{"userId":"795574239","realm":"RT","displayName":null,"accountLink":"/user/id/795574239"},"score":5,"timeFromCreation":"Jun 15, 2018"}]}