{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MjI5MDA4MDMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMTQ6MTM6MDkuMzY2WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwMDUzNzUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMTQ6MTY6NDkuNTU0WiJ9"},"reviews":[{"rating":"STAR_5","review":"At first I didn’t think they’d be able to have so many intersecting stories actually make sense. But, why would I even doubt marvel? They never mess up. They did it again! ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T14:16:49.554Z","updateDate":"2018-04-27T14:16:49.554Z","user":{"userId":"260005375","realm":"RT","displayName":null,"accountLink":"/user/id/260005375"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Everyone is a critic, but leave the criticism at home. If you enjoyed reading comics growing up you will LOVE this movie period. Character development is for drama this is pure excitement, adrenaline, action, & plain old good vs. evil. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T14:16:41.573Z","updateDate":"2018-04-27T14:16:41.573Z","user":{"userId":"922056900","realm":"RT","displayName":null,"accountLink":"/user/id/922056900"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4","review":"Brolin is getting the icing of the cake, but then he deserves it, with such an absorbing nuanced performance, he breathes meaning into these loud behemoth battles.\n\nAvengers: Infinity War\n\nRusso Brothers recites a profound poetry in this heist of gems. Infinity Stones they call it, we, antics to step upon, or more accurately to sacrifice upon. This game of chess is as fun as it would be to watch one. With sacrifices subsequently dashing across the herd of multiple plots, the textbook 1-0-1 tricks of chess, is their way in. A pawn for a pawn and a Queen for a pawn, taking heavy awe-gasping non-affordable losses, Earth's mightiest heroes, has that one emotional punch left in their bags, which works every time despite of your awareness of its manipulative nature.\n\nAfter going through a great deal of chapters, their magic trick wasn't the disappearance of your favourite face cards but the build up or the origin of their construction that led us here, THIS works because THAT did, Downey regretted his actions (Favreau's Iron Man) and made mistakes (Whedon's Age Of Ultron), that is why the birth of his gadgets and attitude towards this alienated phenomenon touched the ultimate membership of the rare 2 billion club. The writing is incredibly inspiring when it comes to blend in these many characters- which hasn't been done to this scale, although Soderberg's smoothness is yet impenetrable- but unfortunately it is also the one with the most mistakes, where you can clearly see that they sew in the missing links with poor cloth material later on in the production and called it \"improvisation\"- humor is not that necessary, especially the off putting references that disenchants the viewers from this mythology.\n\nTo be fair, even the structure of the film is above the safe formulaic method of MCU, with Josh Brolin at the centre of the narration, his invasion in each act of our heroes \"turns the leg to jelly\" and keeps the urgency alive and vulnerability, turned to 11, that you feel as he picks up each of our beloved caped saviour in the air, where the contrast of the power he oozes is impeccably nobel. But I think it is the confidence in his walk, his body language so stiff like it's views that you are molded and convinced in joining his family dinner party that will spiral out not some bickering but an Infinity War.","displayName":"Arth J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T14:15:39.000Z","updateDate":"2019-04-15T12:01:47.000Z","user":{"userId":"977050666","realm":"RT","displayName":"Arth J","accountLink":"/user/id/977050666"},"score":4,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"This movie is everything I wanted and more. My favorite Avengers movie.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T14:15:27.888Z","updateDate":"2018-04-27T14:15:27.888Z","user":{"userId":"260013359","realm":"RT","displayName":null,"accountLink":"/user/id/260013359"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"This is one of the best films. 10 years in THE making, and it pulls NO punches. For FAR too long we have movies and shows where THE good guys always win., there are no stakes and everyone must leave feeling happy.\n\nNot this movie.\n\nThanos is all that a bad guy should be. none of that cliche stupid villany. he is a person with goals and he feels that he is doing what must be done.\n\nall I can say is I am not shocked that critics once again do not ALIGN with viewer opinion. The only rating PEOPLE should consider is the audience score.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/384872425362874/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T14:15:24.000Z","updateDate":"2018-04-27T14:19:06.000Z","user":{"userId":"977243475","realm":"RT","displayName":null,"accountLink":"/user/id/977243475"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"A fantastic movie that showcases all that Marvel has learned to do when making these movies. Solid action, quick quipping, magnificent visuals, engaged performances from every actor, and a rocking soundtrack. Its ending had members of the audience weeping as they left and others ranting and raving. Thanos is not motivated the same way he is in the comics series (Mistress Death doesn't make an appearance as far I noticed), and can seem both likable and sympathetic at times, it makes him all the more a monster in my mind though. \n\nTop 3 easy. 4 1/2 stars out of 5.\n\nThe only extra scene is at the end of the credits. \n\nI can't wait to see how this impacts Agents of Shield.","displayName":"Chad M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T14:14:54.000Z","updateDate":"2018-04-27T14:27:42.000Z","user":{"userId":"909710419","realm":"RT","displayName":"Chad M","accountLink":"/user/id/909710419"},"score":4.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Excellent & top notch. Russo brothers have done a wonderful job & made a great film. Watched first day, first show and will be watching it again this coming week. Kudos to everyone involved with the film. Can't wait for the final part which is due next year.","displayName":"Moby M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T14:14:46.000Z","updateDate":"2018-04-27T14:17:05.000Z","user":{"userId":"977243472","realm":"RT","displayName":"Moby M","accountLink":"/user/id/977243472"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"I never cared about writing reviews for movie before. Not till now. I couldn't resist.\n\nHow to describe this movie...in a word: shocking.\nMy brothers and I were at the very edge of our seats till the very end of the post-credits scene.\nWhat a spectacle! Truly epic and emotional (albeit slightly predictable). My eyes were glued from beginning to end. There was no room for anything else! The story was immensely gripping right from the pilot second. Truly! The movie began in such a way that no Marvel film ever has: somberly and dark, as if we are caught in the midst of war right from the start. It masterfully set the pace for the rest of the duration; even the more upbeat and humorous moments were plagued by this wind of solemn urgency.\nThe crossovers were fun; the deaths were expected but tragic nonetheless; the ending was...\nThis movie is (nearly) every Marvel fanboy's dream.","displayName":"Alizarin C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T14:14:07.000Z","updateDate":"2018-04-27T14:39:16.000Z","user":{"userId":"977243471","realm":"RT","displayName":"Alizarin C","accountLink":"/user/id/977243471"},"score":4.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"This was an awesome movie!  Lots of action, fight scene's, and fun.  I see like one movie a year. Loved it","displayName":"Chris N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T14:13:40.000Z","updateDate":"2018-05-18T04:33:29.000Z","user":{"userId":"977243470","realm":"RT","displayName":"Chris N","accountLink":"/user/id/977243470"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"Marvel does it again. This movie has just the right amount of heart, humour, and tragedy. With an epic villain and a more than epic bunch of heroes all in one action packed film it's truly a recipe that makes for a great movie. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T14:13:09.366Z","updateDate":"2018-04-27T14:13:09.366Z","user":{"userId":"922900803","realm":"RT","displayName":null,"accountLink":"/user/id/922900803"},"score":4.5,"timeFromCreation":"Apr 27, 2018"}]}