{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzczMzc1NjAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDYtMjdUMjA6NDI6MjUifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzczMzgwMzEiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDYtMjhUMDg6MDQ6MjYifQ=="},"reviews":[{"rating":"STAR_5","review":"Best Tragic Hero Movie Ever! I have seen INFINITY WAR twice! Can't Wait for AVENGERS 4!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/2046585078926258/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-28T08:04:26.000Z","updateDate":"2018-06-28T08:09:57.000Z","user":{"userId":"977338031","realm":"RT","displayName":null,"accountLink":"/user/id/977338031"},"score":5,"timeFromCreation":"Jun 28, 2018"},{"rating":"STAR_5","review":"BEST MOVIE OF THE YEAR!!!!","displayName":"Dennis C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-28T07:52:42.000Z","updateDate":"2018-06-28T07:52:57.000Z","user":{"userId":"977337985","realm":"RT","displayName":"Dennis C","accountLink":"/user/id/977337985"},"score":5,"timeFromCreation":"Jun 28, 2018"},{"rating":"STAR_2","review":"Too much going on and not enough of it was very interesting.  Skip it.  CDW","displayName":"Craig Dylan W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-28T06:52:31.000Z","updateDate":"2018-06-28T06:53:07.000Z","user":{"userId":"905405838","realm":"RT","displayName":"Craig Dylan W","accountLink":"/user/id/905405838"},"score":2,"timeFromCreation":"Jun 28, 2018"},{"rating":"STAR_5","review":"After 10 years of build up Marvel deliver the 2018 'Empire Strikes back' Every set piece was spectacular, the score was done perfectly, even when there was none. And the script was also perfect and a villian that lives up to the hype.","displayName":"Cyber N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-28T03:53:22.000Z","updateDate":"2018-06-28T15:35:25.000Z","user":{"userId":"977337793","realm":"RT","displayName":"Cyber N","accountLink":"/user/id/977337793"},"score":5,"timeFromCreation":"Jun 28, 2018"},{"rating":"STAR_4","review":"Avengers Infinity War does it's best trying to juggle all the characters and plot lines, and creating one of the most impactful films in the MCU.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-28T03:14:29.056Z","updateDate":"2018-06-28T03:14:29.056Z","user":{"userId":"974948060","realm":"RT","displayName":null,"accountLink":"/user/id/974948060"},"score":4,"timeFromCreation":"Jun 28, 2018"},{"rating":"STAR_5","review":"It was a blast an amazing experience","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/807052726121896/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-28T00:53:45.000Z","updateDate":"2018-06-28T00:54:29.000Z","user":{"userId":"976626760","realm":"RT","displayName":null,"accountLink":"/user/id/976626760"},"score":5,"timeFromCreation":"Jun 28, 2018"},{"rating":"STAR_5","review":"Absolutely tearjerking to see 3/4 of the cast die only by a Mad Titan...","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/2081534798532177/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-27T23:15:00.000Z","updateDate":"2018-06-27T23:15:44.000Z","user":{"userId":"977337675","realm":"RT","displayName":null,"accountLink":"/user/id/977337675"},"score":5,"timeFromCreation":"Jun 27, 2018"},{"rating":"STAR_0_5","review":"nothing new , generic and very OVERRATED. F* MARVEL","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/563538500657878/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-27T22:27:23.000Z","updateDate":"2018-06-27T22:34:59.000Z","user":{"userId":"977116908","realm":"RT","displayName":null,"accountLink":"/user/id/977116908"},"score":0.5,"timeFromCreation":"Jun 27, 2018"},{"rating":"STAR_3_5","review":"It's a fun enjoyable movie yet it's not an insanely good movie. I see it more of a rollercoaster ride with twists and turns. It felt like a typical Marvel movie for a while until the climax which was my favorite part. I only wish it was more risky earlier in the film. It got better and better as it went on.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-27T21:40:32.556Z","updateDate":"2018-07-31T12:08:50.084Z","user":{"userId":"260156431","realm":"RT","displayName":null,"accountLink":"/user/id/260156431"},"score":3.5,"timeFromCreation":"Jun 27, 2018"},{"rating":"STAR_3_5","review":"Avengers: Infinity War is a pretty good film which packs many great surprises. There are many plot twists and wasted potential. For one, the acting is great. Even the character who only appears for about 1 minute is greatly done. The movie also has an all-star performance from the OG 3 Avengers. The actors are Robert Downey Junior (Iron Man/Tony Stark), Chris Hemsworth (Thor), and Chris Evans (Captain America/Steve Rogers/Nomad). They are still holding up great. The one person who could have done better is Elizabeth Olsen, who drops the Sokovian accent for Scarlet Witch/Wanda Maximoff. The Black Order actors and actresses do the best job, but Thanos is even better. Josh Brolin lets us even start to feel for the character, and he can even be seen as the good guy. The acting category gets a 11/15 points. \n\nThe story is meh. There are two scenarios where one has to give up the one of which they love, and they hesitate and of course, fail in trying to save half of the universe. There is a moment at the end where the Avengers and friends could have tried to stop Thanos from destroying 50% of the universe, but they sit there and watch Thor lecture Thanos about a quote we literally forgot from the beginning of the film. At least there is amazing writing on Josh Brolin's Thanos and building him. The deaths are incredibly stupid, as none of them will be dead forever, as Marvel said that there are sequels for them and there were some leaks which gave obvious spoilers. There are also many parts of the film where people should have gone for the head, but they don't. There are also many plot holes about the stupid plan that Thanos and the heroes had. Doctor Strange also uses the Time Stone to look into the future, which is a no no in time travel 101. The writing category gets 7/15 points. \n\nThe visual effects are pretty good. There are only a few scenes where the effects aren't good. There is one scene where Spider-Man is on the weapon of the big bulky Black Order member and it looks fake with the cartoon-like animation of Spider-Man on the really dark looking weapon. There is also a scene where Thanos has one of the Infinity Stones and he is in a body of water. The scene looks fake and stinks. The motion capture work on everyone is great. The Titan Battle has the best work, as everything is well shot and the visual effects really bring it to life. The visual effects get 7/10 points.\n\nMost of the characters in this film have great arcs and scenes. We get to see Thanos a lot and he has the most screen time and is awesome. The Avengers are same as usual. Spider-Man is the best character. He has new upgrades and scenes that are amazing. Most of the characters act super dumb throughout the film. Doctor Strange has many opportunities to save the universe by not going with dumb plans, but lets others do the choosing. The characters also do things that make them very hateable throughout the film. The characters category gets 7/10 points.\n\nThe film's world and character building are amazing. Titan is well built, and the characters are developed by the amazing world development. There is good development on Thanos and the strength of the Infinity Gauntlet and Thanos. There is still lack in character development throughout, as there are no scenes which aren't about Thanos or Infinity Stones. The Infinity Stones powers are also not well explained, even if we haven't seen them before. The development category gets 3/5 points.\n\nThe movie's score lacks a bit. The credits say that it only uses 2 songs, which are the Black Panther Theme Song and the Avengers Theme Song, but I believe there are some more. The score overall delivers in a sense. Most of the time it isn't that good, like the music will sometimes seem like it is trying to be a Star Wars Film, or something it's not. The original music score category gets 2 / 5 points.\n\nThe Russo Brothers directed the film amazingly, and they really outdid themselves. They've directed amazing action sequences, but the amazing action sequences in this film are amazing. They were smart, and really did the right things direction wise, like the Titan Battle, which is well choreographed and is amazing.  The direction category gets 10/10 points.\n\nThe video quality is hands down great. Beside the mentioned visual effects mistakes, the video quality is great on screen, and can be watched in IMAX, standard, or any other screen and be amazing it it is 2D. The 3D version of the film wasn't that good, according to sources of which will not be named. There are also shots where you can get dizzy during the hyped Wakandan Battle. The video quality category gets 3/5 points.\n\nThe audio and sound effects are good, but they stink sometimes. Like in some of the battles, you can hardly understand the characters and what they are actually saying. I feel like the sound effects are sometimes the same, and at points it feels like it is just noise and explosions. The audio category gets 3 / 5 points.\n\nOverall, Avengers: Infinity War is well directed, well acted, and pretty well done. I would have liked to see a whole and complete story, but this is okay. We here at FilmGrades can't wait to see the sequel. The overall consensus category is 13/20 points.\n\nI will just say that the film does use all of the characters super well for having like over 20 of them in just one movie, so I will give the movie an extra 5 points.\n\nScore: 71%\n\nGrade: C-","displayName":"FilmGrades G","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-27T20:42:25.000Z","updateDate":"2018-06-28T10:08:22.000Z","user":{"userId":"977337560","realm":"RT","displayName":"FilmGrades G","accountLink":"/user/id/977337560"},"score":3.5,"timeFromCreation":"Jun 27, 2018"}]}