{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NjcxNjk4NzYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDRUMTU6NDI6MjMifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF83OTM1NzU4OTgiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDRUMTY6MzI6NDIuNTc3WiJ9"},"reviews":[{"rating":"STAR_4_5","review":"Fantastic journey. They created a film with more than a few bakers dozens of characters and managed to give them each at least one scene of their own to shine. There are flaws in story, and oddly, some questionable effects, but the emotional brevity that they finally bring to their best villain yet is well worth the wait. The heaviness of the film is somewhat cheap in the sense that you know the finality of it all isn't sticking around for long, but it still manages to shock you with the grandness of the scale. The massive house cleaning and their choices were gut punching. The battle scene rivaled a few from Game of Thrones, the score was moderately better, and the scenery gorgeous! 19 movies in and Marvel still keeps us entertained, and somehow even manages to get a little more mature in their faults with each installment. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-04T16:32:42.577Z","updateDate":"2018-05-04T16:32:42.577Z","user":{"userId":"793575898","realm":"RT","displayName":null,"accountLink":"/user/id/793575898"},"score":4.5,"timeFromCreation":"May 04, 2018"},{"rating":"STAR_4_5","review":"Lived up to my expectations and more. 4,5/5.","displayName":"Daniel M","displayImageUrl":"https://graph.facebook.com/v3.3/100000537466424/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-04T16:31:38.000Z","updateDate":"2018-05-04T16:33:06.000Z","user":{"userId":"896467589","realm":"RT","displayName":"Daniel M","accountLink":"/user/id/896467589"},"score":4.5,"timeFromCreation":"May 04, 2018"},{"rating":"STAR_5","review":"Best worst movie...EVAH!!!!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10211747647026004/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-04T16:23:35.000Z","updateDate":"2018-05-04T16:24:34.000Z","user":{"userId":"977256817","realm":"RT","displayName":null,"accountLink":"/user/id/977256817"},"score":5,"timeFromCreation":"May 04, 2018"},{"rating":"STAR_5","review":"Infinity War should've been a mess considering all it needed to encompass. However, the Russo brothers, Marvel and Disney somehow pull off a monumental feat in delivering a stellar culmination of the universe they built. It's a movie that manages to be more than just the sum of its parts, and exceeded every expectation I had going into it. Is it perfect? No. But a 10/10 doesn't mean \"perfect,\" or that there are no issues. It simply means that the enjoyment it delivers is a close as one can reasonably hope for, and that the flaws aren't significant enough to detract from all the great aspects and fun it brings.\n\nThe movie never crumbles under its own weight, and it manages to never lose sight of what it wants to be. The genius behind it is the villain, Thanos, is the main character, and the Avengers (and all other MCU characters) are setup as obstacles he must overcome. This is HIS movie, make no mistake. And Brolin's acting and charisma shine through, despite the CGI nature of the character. Speaking of CGI, it's on another level of impressive, as Thanos not only looks real, but actually as if he's occupying the same space as his counterparts. There is actual weight to him, unlike many floaty, unnatural looking CGI characters in other films (like Black Panther). There's no disconnect from reality when Thanos is present, which if done improperly, could've ruined the movie.\n\nAnd despite some reviews whining about their favorite character not getting enough screen time, I found no issues in that area. The character development is based primarily around Thanos, and his character arc is the focus. There are 18 other MCU movies that focused on developing our protagonists, and Infinity War doesn't hold your hand with contrived, meaningless time-wastes, just there to introduce characters for the first time to those who may not have seen any of the prior films. The movie is already 2 hours & 40 minutes, why dumb down the product when the large majority are familiar enough with the characters to fully grasp what they're viewing? \n\nAll major players get their time to shine, as do many of the minor and less popular ones do. Anyone who feels there's too much going on, or that there's too much to follow clearly were focused on other things instead of watching the movie. The premise is simple - Thanos is traversing the universe gathering the infinity stones which will give him nearly unlimited power, and the Avengers want to stop him. That's it. Every scene in the movie is based around that premise. Whether we're in New York watching Doctor Strange & Iron Man take on one of his minions, off in space with Thor, Rocket & Groot trying to forge a new weapon to stop Thanos, or in Wakanda trying to make a stand against Thanos's army who are attempting to take the Mind Stone from Vision's forehead, it's all about the heroes planning, defending, and attempting to stop Thanos from achieving his goals.\n\nLastly, it'd be a disservice not to mention the emotions, interactions and gravity Infinity War successfully brings to the table. There are laugh out loud moments, thrilling moments, tense moments, sad moments, and moments where you're left in awe. Yes, there's humor (most of it in the first half of the film), but it's not even close to \"forced,\" as some MCU movies have been guilty of. It's fluid, organic and right in line with the characters delivering the laughs. Spider-Man, Drax, Star Lord, Iron-Man, Rocket...those characters SHOULD inject humor from time to time, as that is their nature in the comics. Gamora, Captain America, Doctor Strange, Black Panther, etc. are the more serious ones who anchor their counterparts to reality. It's as it should be, and it's why \"forced,\" is not an adjective that would apply to this film in any way.\n\nThe ending does end on a bit of a cliffhanger, but more so in the way that you are left wondering \"what comes next?\" and \"how will this affect our heroes going forward?\" Make no mistake, there are real consequences, and when Avengers 4 comes out next year, it will not simply do a 180 and go back to status quo (like many internet-experts believe). The only real question is how far will they go with the permanence? If you believe the Russo Brothers, quite further than people want to believe. \n\nTL;DR - Fantastic movie. The Star Wars saga of the new generation. Kids growing up in the era of the MCU will look back and remember Iron-Man, Thor, the Hulk, Guardians of the Galaxy, etc. like those from the 70's-90's grew up feeling about Luke, Han, Leia & Vader. It's a celebration of all that has come before it, and a success in what they set out to do 10 years ago. Sadly, we have to wait a year for it to reach its conclusion. 10/10","displayName":"Corey D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-04T16:18:17.000Z","updateDate":"2018-05-04T16:20:59.000Z","user":{"userId":"977256814","realm":"RT","displayName":"Corey D","accountLink":"/user/id/977256814"},"score":5,"timeFromCreation":"May 04, 2018"},{"rating":"STAR_4_5","review":"When we compare these movies to our expectations, we often raise the bar or lower the bar.  Coming in with an unbiased approach to the Marvel Franchise, I have to personally say that this movie could have been broken down into a trilogy.  We all sigh at lengthy processes, however this movie felt extremely rushed in regards to Thanos obtaining the infinity stones.  The Black Order was rushed and not explained at all, as well. \n\nIf we look at the imagery: This movie is GORGEOUS\nIf we look at the side stories within the movie: Iron man/Strange/Spiderman take over this movie.  Guardians of the Galaxy was well written also.  Scarlet Witch/Vision (Rushed, and downplayed).\n\nThis movie, in my opinion is the 2nd best Marvel movie.  Then again, that's my opinion and it differs from others.  It is a must see if you are fan, at all, of good movies, marvel movies, or potential legendary movies. \n\nGo watch!","displayName":"Michael C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-04T16:14:21.000Z","updateDate":"2018-05-04T16:19:09.000Z","user":{"userId":"977256810","realm":"RT","displayName":"Michael C","accountLink":"/user/id/977256810"},"score":4.5,"timeFromCreation":"May 04, 2018"},{"rating":"STAR_4_5","review":"Arguably the best Marvel movie of the whole bunch. In my opinion, only a select few Marvel films compete on entertainment, quality of the writing and depth of plot. Some of those being Guardians 1, The Avengers, and an Iron Man and Spiderman or two. Thanos is a legitimately strong villain. A cut above most other Marvel installments.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-04T16:14:08.020Z","updateDate":"2018-05-04T16:14:08.020Z","user":{"userId":"912430830","realm":"RT","displayName":null,"accountLink":"/user/id/912430830"},"score":4.5,"timeFromCreation":"May 04, 2018"},{"rating":"STAR_5","review":"It's awesome I mean for a movie chat I've been wating for 3 years it was cool and I liked it\nThe only sad part was that the Hulk only appeared in the begining but it was pretty damm cool.","displayName":"Jorge A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-04T16:02:23.000Z","updateDate":"2018-05-04T16:11:22.000Z","user":{"userId":"977255200","realm":"RT","displayName":"Jorge A","accountLink":"/user/id/977255200"},"score":5,"timeFromCreation":"May 04, 2018"},{"rating":"STAR_0_5","review":"Meh...... I would save your money and spend it on a black panther dvd","displayName":"John A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-04T15:58:31.000Z","updateDate":"2018-05-04T16:13:06.000Z","user":{"userId":"906926976","realm":"RT","displayName":"John A","accountLink":"/user/id/906926976"},"score":0.5,"timeFromCreation":"May 04, 2018"},{"rating":"STAR_5","review":"I think this is one of Marvel's best movies. It's exciting, funny, and tells a great story. Only complaints I have is that it's a bit long other then that, it's amazing","displayName":"Trenton%20 H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-04T15:58:01.000Z","updateDate":"2018-05-04T16:01:16.000Z","user":{"userId":"977256798","realm":"RT","displayName":"Trenton%20 H","accountLink":"/user/id/977256798"},"score":5,"timeFromCreation":"May 04, 2018"},{"rating":"STAR_5","review":"WOW.  First movie I ran back to watch twice EVER.  Just amazingly good.","displayName":"mike n","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-04T15:42:23.000Z","updateDate":"2018-05-04T15:42:54.000Z","user":{"userId":"967169876","realm":"RT","displayName":"mike n","accountLink":"/user/id/967169876"},"score":5,"timeFromCreation":"May 04, 2018"}]}