{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzgyNzEzNTYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMDktMThUMTc6MDY6MzMuNTI5WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzgyODAwMTAiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMDktMjJUMjA6MTQ6MzUuODUyWiJ9"},"reviews":[{"rating":"STAR_4","review":"It's good, and the CGI is impressive, but the emotional parts are a little too overdone and not real enough.","displayName":"Jackson T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-22T20:14:35.852Z","updateDate":"2019-09-22T20:14:35.852Z","user":{"userId":"978280010","realm":"RT","displayName":"Jackson T","accountLink":"/user/id/978280010"},"score":4,"timeFromCreation":"Sep 22, 2019"},{"rating":"STAR_4_5","review":"With suspense, an epic combination of characters, and a heart-pounding story with a fantastic villain, \"Avengers: Infinity War\" is a fantastically made film with all of the expectations you could possibly ask for.","displayName":"Mr. B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-22T17:35:58.953Z","updateDate":"2019-10-25T23:14:09.497Z","user":{"userId":"978149396","realm":"RT","displayName":"Mr. B","accountLink":"/user/id/978149396"},"score":4.5,"timeFromCreation":"Sep 22, 2019"},{"rating":"STAR_5","review":"Best MCU movie by far. Every moment in this movie is thrilling. And Thanos is best comic book adapted villain in any movie.","displayName":"Raghav S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-22T11:33:25.411Z","updateDate":"2019-09-22T11:33:25.411Z","user":{"userId":"978279181","realm":"RT","displayName":"Raghav S","accountLink":"/user/id/978279181"},"score":5,"timeFromCreation":"Sep 22, 2019"},{"rating":"STAR_4_5","review":"almost a mas6only too much gets away with unanswered quesyiobx' being impossible.,","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-22T10:53:39.683Z","updateDate":"2019-09-22T10:53:39.683Z","user":{"userId":"260322203","realm":"RT","displayName":null,"accountLink":"/user/id/260322203"},"score":4.5,"timeFromCreation":"Sep 22, 2019"},{"rating":"STAR_5","review":"This movie was freaking AWESOME!!!!! It might just be my favourite Marvel movie. It cuts out all the boring stuff I don't like from the other movies and only keeps in the stuff I like, which makes this the quintessential Marvel movie for me. However, I feel like this movie may have been a little too good. I like this one so much, that I honestly don't have much reason to go back to any of the other Marvel movies. Infinity War has all my favourite elements from all of them and none of my least favourite. Why sit through the others when I can just watch this and get my fix? Anyway, this movie was great and I can't wait for Avengers: Endgame!!","displayName":"Aidan Z","displayImageUrl":"https://graph.facebook.com/v3.3/937912853232351/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-22T06:05:05.103Z","updateDate":"2019-09-22T06:05:05.103Z","user":{"userId":"978267048","realm":"RT","displayName":"Aidan Z","accountLink":"/user/id/978267048"},"score":5,"timeFromCreation":"Sep 22, 2019"},{"rating":"STAR_5","review":"Clearly the best Avengers movie ever made. A villain with whom the audience can actually empathize is extremely rare.","displayName":"Inside S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-22T04:02:45.436Z","updateDate":"2019-09-22T04:02:45.436Z","user":{"userId":"969508920","realm":"RT","displayName":"Inside S","accountLink":"/user/id/969508920"},"score":5,"timeFromCreation":"Sep 22, 2019"},{"rating":"STAR_1","review":"No movie logic only imagine Indian critics bakwas review","displayName":"Vinya M","displayImageUrl":"https://graph.facebook.com/v3.3/559323231543314/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-20T17:56:54.204Z","updateDate":"2019-09-20T17:57:11.304Z","user":{"userId":"978226134","realm":"RT","displayName":"Vinya M","accountLink":"/user/id/978226134"},"score":1,"timeFromCreation":"Sep 20, 2019"},{"rating":"STAR_3_5","review":"Avengers Infinity war was the most watched movie in 2018, because let's be honest, everyone saw this movie, and apparently everyone liked me, personally, when I left the cinema I felt confused in the sense that I had to ask the question \"Did I like it?\" The truth to answer this question I had to see it again, maybe not at the cinema, but I did it at home, I analyzed it and came to the conclusion that if I liked it, but that does not mean that I loved it, I simply prefer movies as the first of \"Avengers\", \"Ironman\" or even \"The Winter Soldier\".\n\nWell, if you're a marvel fan, before you explode in anger, I want to remind you that I'm not saying that the movie is bad, I'm just saying it's not the best. Why? It's simple, the movie is very complicated, such as that they could beat Thanos very easily, like cutting off his arm with the portals of Dr. Strange, or that Dr. Strange does the infinite cycle as he did with Doormamu, well I think it is written like this, but that does not matter, the point is that if Doormamu a million-year-old celestial being got bored, Thanos by logic, simple would also get bored and agree to its terms, but the movie is not very complicated and they make complex plans so that in the end one of them spoils him (Star-lord), or that the film is complicated more also with that sub-plot of Thor in search of a magical dwarf to make his ax, and the problem is here, at Thor Ragnarok we were taught that Thor is not the god of hammers, but that this is the god of thunder, therefore he does not need a weapon to defeat his enemies, but here the film is overlooked, and contradicts herself by telling us that Thor alone It is going to be able to defeat Thanos with that Ax, which, as I said, contradicts what they told us in Ragnarok, or that of the end that everyone vanishes, I wonder \"Am I supposed to get sad for them? The answer is no, because it is more than predictable that they would return, seriously the people who cry with it, make me sad.\nNow I'm going to talk about how good this movie has and I want to start by saying that it's just great to see all the mcu superheroes together in a movie, which I have to recognize the writers and directors that for a movie with so many characters did not not bad, to tell the truth unlike other marvel movies, this one has a good villain, that would be Thanos, that has an interesting story, and a justifiable reason, that if you analyze it logically the true villains of the movie specifically the avengers , to avoid the salvation of the universe, to tell the truth the battles are good, the action is entertaining, and maybe previously I said yes, it is very predictable that the characters that disappeared will come back, but if there were some that did die of Truth like Loki and Vision, I hope they do well and leave them dead. I dare to say that the best of this movie is its ending with the winning villain, something we had never seen in a marvel movie. Personally I would have liked more is that this would have been the last film of the mcu, nothing like an unexpected ending with the villain won and with half of the population \"dead\", but I would only add something else at the end, to give an end to each character that survived, for example a scene that Tony Stark stays in the lost space forever, the heroes of the earth admitting that Thanos was right, or something like that I loved, because apart marvel was done doing the favor to close with a flourish, because the movies that have been released after this one are simply not good, \"Captain Marvel\" is the typical original movie, with an annoying protagonist and the movie ends up being boring, Ant-Man and the Wasp It is more of the same, with a villain with silly motives, many things that lack meaning, excess of humor, the movie is very bad, Avengers Endgame is not bad, but neither stands out in any way, the hour of time is boring rid to, and you already talk about this movie in a separate review, and we get to the last movie that Marvel has taken out that it would be Spider-Man Away from home and this movie is bad, the plot is more than predictable, the villain has again a silly and repetitive motive, excess of humor, love is silly and forced, Spider-Man is a fool in this movie, please enlighten me and please tell me what this movie is good about, because everyone I know love that movie.\nWell back to the topic Infinity War is one of the great events in the history of superhero movies and I am not sure if it is correct to say of cinema in general, with great battles, with one or another thing that does not make much sense, but a good Villain, this movie earns its 7/10.","displayName":"Diego P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-20T03:59:07.065Z","updateDate":"2019-09-20T03:59:07.065Z","user":{"userId":"978187911","realm":"RT","displayName":"Diego P","accountLink":"/user/id/978187911"},"score":3.5,"timeFromCreation":"Sep 20, 2019"},{"rating":"STAR_5","review":"One of marvels best.","displayName":"Matt L","displayImageUrl":"https://graph.facebook.com/v3.3/100006707890850/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-19T15:22:51.139Z","updateDate":"2019-09-19T15:22:51.860Z","user":{"userId":"960629896","realm":"RT","displayName":"Matt L","accountLink":"/user/id/960629896"},"score":5,"timeFromCreation":"Sep 19, 2019"},{"rating":"STAR_5","review":"This movie cannot get boring! What do you get when you bring together a group of heroes that have never met and put them against a villain with understandable motives? First class TV, that's what! This film is perfect for any fans of any type.","displayName":"Ben L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-09-18T17:06:33.529Z","updateDate":"2019-09-18T17:06:33.529Z","user":{"userId":"978271356","realm":"RT","displayName":"Ben L","accountLink":"/user/id/978271356"},"score":5,"timeFromCreation":"Sep 18, 2019"}]}