{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF83ODU5ODU5MjkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMTItMjJUMDQ6MTY6MzAuMjIyWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF83ODI1NDc0MTYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDEtMDFUMTg6NDI6MzIifQ=="},"reviews":[{"rating":"STAR_5","review":"A snappy good movie about the heroic Titan Thanos and his quest to balance the universe, while pursued and hindered by a plucky gang of misfits.","displayName":"Aaron G","displayImageUrl":"https://graph.facebook.com/v3.3/643430942/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-01-01T18:42:32.000Z","updateDate":"2018-07-21T02:46:58.000Z","user":{"userId":"782547416","realm":"RT","displayName":"Aaron G","accountLink":"/user/id/782547416"},"score":5,"timeFromCreation":"Jan 01, 2018"},{"rating":"STAR_4_5","review":"A lot of people complain about the other MCU movies being \"predictable\", I'm sure you won't see that word in a review for this movie. Infinity War goes in a direction that most superhero movies wouldn't and I personally respect the risk. It is an intense, emotional, funny, and action-packed thrill ride with Marvel's most menacing villain yet and I can't wait to see the next one.","displayName":"Cole W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-12-31T21:24:09.000Z","updateDate":"2018-06-18T17:47:38.000Z","user":{"userId":"920947522","realm":"RT","displayName":"Cole W","accountLink":"/user/id/920947522"},"score":4.5,"timeFromCreation":"Dec 31, 2017"},{"rating":"STAR_4_5","review":"Infinity War was just about as hyped as a movie can get.  It had the most viewed online trailer ever, was #3 all time in pre-sales, and was first teased back in 2012 with The Avengers, and most of the MCU movies since then have all been building up to this.  Ever since the Infinity Stones were first introduced in the first Thor movie, people have believed that we would see Thanos' quest to collect the all on the big screen.  Perhaps most impressive is that it had the biggest opening weekend ever, beating Star Wars: The Force Awakens in the U.S. with $257,000,000, and beating Fate of the Furious globally with $640,000,000.\n\nNow, it's impossible to talk about this movie without spoilers, so be warned.  \n\nGiven the sheer number of characters and plotlines in this movie, there's quite a bit to take in.  It alternates between sets of characters such as Team Cap+Vision, the Thor/Rocket/Groot combo, the Guardians/Iron Man/Strange/Spidey combo, and, of course, Thanos himself.  It's definitely true that there isn't enough screen time to go around, which for casual viewers, may be a problem.  However, for fans of the MCU, it's fine.  It doesn't introduce any new major heroes, so most of the character development already happened in the previous films in the franchise.  It also has some good humor and several memorable lines (Get lost, Squidward!)  There is some development to be had.  Thor does deal with Loki's death and the aftermath of Ragnarok.  There are new things happening with the Guardians. However, some characters, notably Captain America, Black Panther, and Bucky don't get enough screen time.\n\nIf there was one thing this movie absolutely needed to get right, it was that Thanos had to be a great villain.  And he was.  On the outside, he was everything he needed to be; threatening, serious, cruel, intimidating, and still really believes that what he does is right.  But yet on the inside, he does have some heart.  Right after he kills Gamora, it really does seem like he's really heartbroken by it.  Part of why the movie works is because Thanos is the central character.  He gets the most screen time.  It's called \"Avengers: Infinity War,\" but the Avengers aren't the central focus.  This is really Thanos' story.  The Black Order isn't really the best set of villains.  But they are side villains, so it's fine that they don't get as much screen time.  Ebony Maw was pretty cool.  Proxima Midnight and Corvus Glave felt like glorified minions.  Cull Obsidian was lame.\nAnother part of why this movie works is because the stakes feel real.  It subverts the tropes of heroes always winning, killing Loki and Heimdall in the first 10 minutes.  Not only are the stakes there, but the situations where characters have to kill each other to prevent Thanos from getting a stone have a great amount of tension to them.  (Star-Lord and Gamora, Doctor Strange and Iron Man, Vision and Scarlet Witch)  You know they're not afraid to kill off their heroes.  Whenever there's an action scene, there's the uncertainty angle.  You don't know who's going to die, and it could very well be anyone.  \n\nThe action scenes were absolutely spectacular.  There are several of them, and they last for quite a while.  The New York fight, which is Doctor Strange and Wong vs Ebony Maw and Iron Man and Spider-Man vs Cull Obsidian, was the first real fight, and a great, exciting action scene.  The Battle of Wakanda wasn't as cool as we hoped, given how much it showed up in the trailers.  Still, it was very fun to watch, very extensive, and has the same high stakes.  Heck, it even delivers somewhat of a sword fight, between Okoye, Black Widow, and Proxima Midnight.  Coming off Black Panther, though, it feels kind of rehashed, given that we saw this three months ago.  The battle on Titan was probably the best.  We saw a new Iron Man suit, new Doctor Strange powers, some Spider-Man one liners, and even Mantis gets in on the fun.  And, of course, there's the part where Iron Man gets impaled.  He lives, but it's shocking nonetheless.\n\nThen, of course, there's the elephant in the room - the ending.  Holy crap.  The shock factor was definitely there.  I knew going in that there was a shocking ending.  I thought it was either the Snap, or that Iron Man dies.  The snap was absolutely devastating, taking out by my count, 6 Avengers, 4 Guardians, and others like Nick Fury and Maria Hill.  I'd say the most shocking death was Black Panther.  I thought he was untouchable given the popularity.  But then again, by the time that came out, this movie was probably in post-production, so what can you do?  Spidey's was really painful to watch.  Doctor Strange hit hard personally.  But it just felt cheap.  Those of us who know the comics know that the snap got undone.  You know they're coming back.  There's no way in hell they'd kill off Spidey or Black Panther for real.  But there's no other way to end it.  Thanos was unbeatable with 5 stones, you can't have the whole movie be about #6.  Plus, everyone who doesn't know the comics (which is the vast majority of the MCU audience) didn't expect it.  The biggest spoiler they expected was that either Cap or Iron Man was going to die.  But with the resurrections, it feels like anyone who died could come back.  Except Heimdall.  He's dead.  Loki has \"died\" before.  Gamora is in the Soul Stone.  Vision could be rebuilt.  But how else could this end?  Like Doctor Strange said, this is the only way.\n\nInfinity War is quite the film.  It's a lot to take in, but it's a very exciting, well paced film that delivers on most of the hype it's been building up to.  Fans of the MCU will definitely enjoy it more than casual moviegoers, and some may find the ending leaves a bad taste.  However, it's clearly a Part 1, and it will be interesting to see how it unfolds in Part 2.","displayName":"Michael C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-12-30T15:36:19.000Z","updateDate":"2018-05-12T20:51:30.000Z","user":{"userId":"976938066","realm":"RT","displayName":"Michael C","accountLink":"/user/id/976938066"},"score":4.5,"timeFromCreation":"Dec 30, 2017"},{"rating":"STAR_4_5","review":"Just... Amazing. Everything about this movie is amazing. It's not a perfect movie though. I am a little disappointed with some of the small screen time of some of our earth's mightiest heroes. Besides that A LOT of action, fun comedy (that doesn't always land but not every joke does), INCREDIBLY emotional, and a sense of reality. This movie takes you many places and when I'm fully invested on the screen and not the world, you know you've made a great film.","displayName":"Nick S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-12-29T21:08:25.000Z","updateDate":"2018-04-27T08:19:23.000Z","user":{"userId":"977014213","realm":"RT","displayName":"Nick S","accountLink":"/user/id/977014213"},"score":4.5,"timeFromCreation":"Dec 29, 2017"},{"rating":"STAR_5","review":"Giving this movie the title of best action superhero movie sounds kinda cheesy but i cant find anything wrong with it. Heart stopping edge of the seat while the tears wait for their moment. Absolutely incredible","displayName":"Andre M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-12-27T15:36:34.000Z","updateDate":"2018-04-30T17:49:51.000Z","user":{"userId":"958636602","realm":"RT","displayName":"Andre M","accountLink":"/user/id/958636602"},"score":5,"timeFromCreation":"Dec 27, 2017"},{"rating":"STAR_5","review":"Awesome movie Josh Brolin performance as thanos is incredible and the battle in wakanda was epic.\nI am very hyped for Captain Marvel and Avengers 4","displayName":"Kabir S","displayImageUrl":"https://graph.facebook.com/v3.3/1586679444987064/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-12-27T11:58:01.000Z","updateDate":"2018-04-28T02:27:55.000Z","user":{"userId":"973817991","realm":"RT","displayName":"Kabir S","accountLink":"/user/id/973817991"},"score":5,"timeFromCreation":"Dec 27, 2017"},{"rating":"STAR_5","review":"10 years in the making. Wow, wow, wow, wow, wow. There's no stopping Marvel Studios and they're gonna keep going. I know, they're raking money but hey, I love Marvel and the movies they make are legendary. Who would've that that building up so much anticpation, that it'll all lead up to this? To the Mad Titan himself, Thanos.\n\nThe story picks up really well in the beginning. The build up is there and we get to see all our beloved characters on screen. Everyone has enough screen time and everyone has enough to even crack jokes at such a serious and opressive situations. Every interaction is emotionally overwhelming. We get to know quite a lot about Thanos. Russo brothers took the chance to show us how powerful this guy really is and he means business.\n\nEvery character you know since Iron Man 2008. The ones that have survived are all present. Of course the major ones are there too. It's great to see all these characters come together and interact. Let's just say not ALL of them come together but in groups. Hopefully we see a truly epic battle in Avengers 4 where we see ALL of them team up and fight against Thanos. For now, it's just the beginning and even the end.\n\nI enjoyed this movie a lot. Sure I was hyped so much but I keep my head straight and made sure that it was not like how I experienced with that other movie. I wanted to make sure that I am actually enjoying a movie that I have anticipated for a long time and that it is truly worthy of such build up since 2008. After I watched it, I know for sure that I have seen the best Marvel movie in the Marvel Cinematic Universe as of now. Avengers 4 is just around the corner, a long corner. But we'll have to savor the moments we've experienced in silence because I'm still shocked.","displayName":"Jin T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-12-26T23:07:21.000Z","updateDate":"2018-04-28T22:07:33.000Z","user":{"userId":"780955737","realm":"RT","displayName":"Jin T","accountLink":"/user/id/780955737"},"score":5,"timeFromCreation":"Dec 26, 2017"},{"rating":"STAR_4_5","review":"Avengers: Infinity War inevitably has some tonal and pacing inconsistencies, but its issues are quickly swept aside for charming character moments, incredible comic book action and a villain for the ages, making it the truly epic conclusion to the MCU's ten-year journey.","displayName":"Mark L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-12-26T10:39:37.000Z","updateDate":"2019-02-04T10:34:11.000Z","user":{"userId":"974789580","realm":"RT","displayName":"Mark L","accountLink":"/user/id/974789580"},"score":4.5,"timeFromCreation":"Dec 26, 2017"},{"rating":"STAR_3_5","review":"Not my favorite of the series. I guess that's because the style of the film is even more action, even less character development. Granted, there were many primary and secondary characters to involve. \n\nI confess that I'm a more than a little frustrated that it seems only white male superheroes have survived the first half of Infinity War. It will be interesting to see whether that pattern continues in the second half - or perhaps Captain Marvel, Gemora, O-koye, or someone else will emerge.","displayName":"Elyse W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-12-22T09:40:16.000Z","updateDate":"2018-05-12T20:41:46.000Z","user":{"userId":"976981379","realm":"RT","displayName":"Elyse W","accountLink":"/user/id/976981379"},"score":3.5,"timeFromCreation":"Dec 22, 2017"},{"rating":"STAR_4","review":"It suffers like all the Avengers movies where there's too many characters and too much fighting. The funny quips stop being funny about halfway through the movie. but it's still a really good Avengers movie and they made the story interesting. Thor steals every scene and makes me hopeful for a Thor 4. Thanos worked as a big baddie and was interesting. Dr Strange was a disappointment, Spidey was awesome.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-12-22T04:16:30.222Z","updateDate":"2018-04-29T13:42:05.634Z","user":{"userId":"785985929","realm":"RT","displayName":null,"accountLink":"/user/id/785985929"},"score":4,"timeFromCreation":"Dec 22, 2017"}]}