{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwMTUxMTIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMjM6Mjc6MjQuNzAzWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84MzE4NDY3MjQiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMjM6NTA6NTUifQ=="},"reviews":[{"rating":"STAR_4","review":"Finally, at long last, after all this build-up and effort, we've reached this moment. \"Avengers: Infinity War\" is here and it's... pretty darn good! Yes, admittedly this wasn't the end-all and be-all I was anticipating, and co-directors Joe and Anthony Russo have made far better, more sophisticated, and entertaining Marvel films than this. But, again, I greatly enjoyed this. The action is good fun, the effects are top notch, and Josh Brolin proves once again that he's an absolute master of his craft. But I also just couldn't help but feel as though this was a bit too obvious of an extended trailer for another movie to come, rather than its own contained story. There's so much telegraphed by this film's story that left me feeling cold, not necessarily because of the events that occur, but more so because of the idea that the powers-that-be actually felt that the audience would take what happens in this movie as gospel, when in reality it ends up feeling like a bit of a cinematic bluff. It feels a bit too much like the first half or two-thirds of a movie, rather than its own thing. And having a \"part one\" and \"part two\" film combo isn't necessarily unheard of, but why couldn't the alternative have happened? Why couldn't we get one complete, epic, three-and-a-half hour plus narrative in one cinematic sitting? You can't make the argument that no one would see it, due to the fact that we've had 10 years and 20 Marvel movies pointing to the contrary. People would've seen it, no matter what, so why not do it? Two movies would make more money? Probably, but I digress, I suppose. Again, I know it might sound as though I'm tearing the movie apart, but I did enjoy it quite a bit overall, despite the fact that it ended up feeling a little too much like -- an albeit much better version of -- a \"Harry Potter And The Deathly Hallows Part 1,\" or a \"The Hobbit: The Desolation Of Smaug,\" or a \"Hunger Games: Mockingjay Part 1.\"","displayName":"Robert R","displayImageUrl":"https://graph.facebook.com/v3.3/1183085978/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T23:50:55.000Z","updateDate":"2018-05-16T23:02:52.000Z","user":{"userId":"831846724","realm":"RT","displayName":"Robert R","accountLink":"/user/id/831846724"},"score":4,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"I cried in theaters, I can't stop thinking about it, I've been watching these movies forever. Watch it and then you will understand, I will never be the same again.","displayName":"Dylan H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T23:50:12.000Z","updateDate":"2018-04-28T23:51:24.000Z","user":{"userId":"977247596","realm":"RT","displayName":"Dylan H","accountLink":"/user/id/977247596"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_0_5","review":"It fricking sucked. What a terrible movie. Waste of money. Absolute money grab","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T23:50:10.292Z","updateDate":"2018-04-28T23:50:10.292Z","user":{"userId":"260123676","realm":"RT","displayName":null,"accountLink":"/user/id/260123676"},"score":0.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_0_5","review":"Spoilers ahead: ... ... ... ... ... ... I was loving until they started killing character after character and ended with this epic adventure being an abject failure. I don’t bring my kids to see superhero’s struggle only to fail and have half the universe die. My kids were really upset and felt cheated. My oldest said “it’s just a stupid money grab” so they can sell a part two. We waited so long for this movie and everything leading up to it - Marvel let us down big time. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T23:44:24.033Z","updateDate":"2018-04-28T23:44:24.033Z","user":{"userId":"818009394","realm":"RT","displayName":null,"accountLink":"/user/id/818009394"},"score":0.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Simply put, this is the greatest superhero film of all time. Previously shrouded in mystery, Thanos is afforded an thorough character examination not normally afforded to comic movie villains. Coupled with the spectacular display of heroes' abilities and smart dialogue throughout, Infinity War resides in a class above all other films in the genre.","displayName":"Andreas K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T23:42:39.000Z","updateDate":"2018-04-29T14:28:00.000Z","user":{"userId":"977163233","realm":"RT","displayName":"Andreas K","accountLink":"/user/id/977163233"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"I would say that I have been waiting for this movie since I was 11 and realized that Avengers: Infinity War would one day be a thing, but I have been waiting far longer.  I have wanted a movie that portrayed real life for the longest time, where everyone matters but that doesn't mean they can't die. Each death was a heart breaking moment as my heart has literally collapsed by now, but it became realistic. We always say that bad things happen, but not to me. That is not true. Anyone can die at any moment whether you are a random construction worker or the winter soldier. The movie destroyed me, but I almost want to thank them because I have never been so moved. The movie may be a superhero crossover, but it is so much more.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/577296042650671/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T23:39:20.000Z","updateDate":"2018-04-28T23:45:41.000Z","user":{"userId":"977247581","realm":"RT","displayName":null,"accountLink":"/user/id/977247581"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"This movie delivered!  Cant wait for the second part.","displayName":"Juan C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T23:35:31.000Z","updateDate":"2018-04-28T23:36:37.000Z","user":{"userId":"975662728","realm":"RT","displayName":"Juan C","accountLink":"/user/id/975662728"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_0_5","review":"I believe that this film was quite poorly directed and could have done so much more with the franchise. We all knew that there was going to be two parts to this one, but what on earth is there to make in Avengers 4. They rushed everything into one movie that they should have left for Avengers 4. Also, Thanos being overpowered took emotion and tension out of all key moments. We see Star-Lord finally bring himself to kill gamora, but the stupid inclusion of Thanos turning his gun to a bubble blaster takes all the emotion out of the scene with a cheesy ending. THe same with vision and wanda. Wanda spends the whole film trying to protect vision so she can hold on to him but finally comes to the emotional decision to destroy the stone. We feel the emotion for a split second when marvel ruins it by making thanos reverse time and ruin the moment, taking all the emotions out the scene as well. Thor spent half the movie getting an axe to kill Thanos that doesn't have the capability to kill Thanos. The father-son bonding between spiderman and iron man continued and was brilliant but was ruined when marvel killed him off. I will not have him being resurrected. I will not accept some reverse the time reverse the mistakes rubbish\" The one thing I agree with Thanos on was that he was right to mock Dr Strange that he never used his greatest weapon, the time stone. It was absolutely ridiculous. Marvel failed on this one","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1972864683043300/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T23:34:43.000Z","updateDate":"2018-04-28T23:48:10.000Z","user":{"userId":"977247575","realm":"RT","displayName":null,"accountLink":"/user/id/977247575"},"score":0.5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4","review":"I didn't look through 30+ pages of reviews but, (SPOILERALERT, I  THINK) didn't any one notice how Steve Rogers  (CAP for the cognoscenti)  held Thanos  and the Infinity Gauntlet?   Methinks there is a plot there.  Also this was a very good movie, I'm old and remember the REAL origin of Cap Iron Man and the others from the comics, ( I had them, wish still did.) and Thanos ranks up there with Darkseid as a cosmic villian.   Though they aren't as psychotic as Norman Osborn.","displayName":"James%20 S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T23:32:25.000Z","updateDate":"2018-04-28T23:40:12.000Z","user":{"userId":"977247562","realm":"RT","displayName":"James%20 S","accountLink":"/user/id/977247562"},"score":4,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4_5","review":"Lots of fun! Plenty to be excited about. Great dialogue and balance between many characters. The conclusion leaves a lot to be desired but more of a let down kind of way. Odd for a Marvel movie. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T23:27:24.703Z","updateDate":"2018-04-28T23:27:24.703Z","user":{"userId":"260015112","realm":"RT","displayName":null,"accountLink":"/user/id/260015112"},"score":4.5,"timeFromCreation":"Apr 28, 2018"}]}