{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNDM1NzciLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMTQ6NTg6MzkifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAxMjE5MDkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMTU6MDY6MTUuNDU5WiJ9"},"reviews":[{"rating":"STAR_5","review":"Finally something good .","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:06:15.459Z","updateDate":"2018-04-27T15:06:15.459Z","user":{"userId":"260121909","realm":"RT","displayName":null,"accountLink":"/user/id/260121909"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4","review":"4/5\n\nAvengers Infinity War is a strange movie to review, as it has many values attached to it that transcend any normal film release, even under the considerations present with every release within the Marvel cinematic universe. Under common film considerations, it is quite notable how the rhythm and tone are not at the top of their game, as it tries to balance many themes and tones that, while belonging to the same universe, are quite different between one another, something especially noticeable, for example, with the Guardians of the Galaxy campy and energetic brand of comedy. Not only that, but constructing the film around a war becomes problematic in the sense that plain action is quite logically the main focus, instead of the construction of a new narrative that can hold a candle to any of the individual stories told before. However, and especially considering the way it ends, I find it hard to deny the experience it provides, both in the sense that it is, after all, a product that has to be understood and enjoyed as the latest installment in a wonderfully balanced and immense cinematic narrative, but also in the sense that it acknowledges the terms of its existence in order to create an unexpectedly bold and dark film that plays on our desires for conclusiveness and our expectations for retribution.","displayName":"Pablo G","displayImageUrl":"https://graph.facebook.com/v3.3/637929509/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:04:17.000Z","updateDate":"2018-04-27T18:20:28.000Z","user":{"userId":"962828500","realm":"RT","displayName":"Pablo G","accountLink":"/user/id/962828500"},"score":4,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"The best movie ive seen in a looooong time","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:03:36.233Z","updateDate":"2018-04-27T15:03:36.233Z","user":{"userId":"969194510","realm":"RT","displayName":null,"accountLink":"/user/id/969194510"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"JUST BACK FROM MY SECOND VIEWING, HAVING HAD A FEW DAYS GAP IN BETWEEN.  nOT ONLY DOES IT BEAR A SECOND VIEWING, BUT IF ANYTHING i ENJOYED IT MORE THE SECOND TIME AROUND.  oF COURSE THERE WERE SOME MINOR NIGGLES HERE AND THERE, BUT ON THE WHOLE IT'S A FITTING FIRST CHAPTER IN THE FINALE THAT THE mcu HAS BEEN BUILDING TO SINCE IRON MAN AND THE INCREDIBLE HULK 10 YEARS AGO THIS SUMMER.  GIVEN THE SERIOUS MIS-STEPS AND STUMBLES WE'VE ALL SEEN MADE BY SONY, FOX AND WARNER/dC IN BRINGING THEIR HEROES TO THE BIG SCREEN, THAT MARVEL HAVE MANAGED TO BRING 19 OF THESE MOVIES TO LIFE, ONE AFTER ANOTHER WITH ALMOST MILITARY PRECISION, RESPECTING THE SOURCE MATERIAL WHILE CRAFTING A UNIVERSE ALL THEIR OWN THAT HAS BUILT TOWARDS THIS MOMENT IS AN ACHIEVEMENT UNPRECEDENTED IN MOVIE HISTORY.. \nAS ALWAYS, WHAT SETS THE mcu APART FROM SOME OF THE FAILED SUPERHERO MOVIES OF THE PAST IS THE FOCUS ON CHARACTERS AND STORIES RATHER THAN SIMPLY THE SPECTACLE OF SUPERHEROES GOING TOE-TO-TOE IN EVER MORE VISUALLY ASTOUNDING - YET EMOTIONALLY DIS-ENGAGING WAYS. \nTHANOS IS THE BIG BAD THAT HAS BEEN BREWING IN THE BACKGROUND FOR ALMOST A DECADE, AND DESPITE BEING AS MUCH A cgi CREATION AS jUSTICE lEAGUE'S AWFUL STEPPENWOLF, HERE IS A BAD GUY WITH A MISSION OF DESTRUCTION THAT MAKES IT'S OWN AWFUL, TERRIFYING SENSE.  \nTHE WORST THING ABOUT THIS MOVIE IS THE TERRIBLE KNOWLEDGE THAT THIS IS ONLY PART ONE OF TWO AND WE HAVE TO WAIT A FULL YEAR FOR THE CONCLUSION.","displayName":"Ken C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:03:22.000Z","updateDate":"2018-05-01T12:14:43.000Z","user":{"userId":"975571308","realm":"RT","displayName":"Ken C","accountLink":"/user/id/975571308"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Really liked it! They did really well with fitting so many characters into a one movie. The humor was great and they did kind of fill old plot holes. The pacing was good, not too fast nor too slow.","displayName":"Saara H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:02:06.000Z","updateDate":"2018-04-27T15:03:42.000Z","user":{"userId":"974993885","realm":"RT","displayName":"Saara H","accountLink":"/user/id/974993885"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"I'm a big fan, but I'm still impressed that they had so many characters in this and still kept a coherent story.  A few of them didn't get a lot to do, but that number is much smaller than I anticipated.\n\nI was also very pleased with the blending of the styles of each character.  The tone of each performance was very much in line with that of their stand alone movies, but somehow still meshed together.  \n\nIt's not the very best Marvel movie ever, but they pulled it off spectacularly.","displayName":"Eric G","displayImageUrl":"https://graph.facebook.com/v3.3/507966582/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:00:16.000Z","updateDate":"2018-04-27T15:06:20.000Z","user":{"userId":"782823584","realm":"RT","displayName":"Eric G","accountLink":"/user/id/782823584"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Best avengers ever! ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T14:59:47.940Z","updateDate":"2018-04-27T14:59:47.940Z","user":{"userId":"260095460","realm":"RT","displayName":null,"accountLink":"/user/id/260095460"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_1","review":"Avengers: Infinity War is the culmination of everything the MCU has shown us since the first Iron Man. And it's a massive disappointment. The movie boasts more characters in a single comic movie than ever before, and that's where one of the biggest problems comes in. There are too many characters and it causes pacing issues, where they ramp through exposition as fast as possible to move on. Some characters barely do anything and are just there because they are supposed to be.\n\nThanos is an okay villain. Not \"Vader X 10\" like they told us. But it's not hard to be a better villain than we've seen before when the MCU has had lame villains for 10 years.\n\nThere are multiple character deaths in the movies. But the \"Emotion\" and \"Drama\" of seeing them die is artificial, since you know they aren't leaving these characters dead and their deaths will be retconned in Part 4 next year. Some of the characters who \"Die\" have movies on the release slate for the next few years, so Feige and the Russo Bros. promising the deaths would be permanent is a lie since we know that\n\n*SPOILER ALERT*\n\nSpider-man, Black Panther, Gamora, Bucky, Groot, Mantis, Drax, Black Panther, War Machine, and Falcon aren't going to stay dead.\n\nThe jokes are cringey as usual and it causes an inconsistent tone. They don't know what they want the movie to be. A comedy? A serious movie?\n\nThere is so much action in this movie, and it exposes the hypocrisy of critics. After years of hearing them whine about too much action in some of the DC movies the final 45 minutes to an hour of Infinity War is pretty much all action, which the positive reviews show they suddenly have no issues with.\n\nThe movie was a disappointment. And people attack DC movies while giving movies like this a pass. It's stupid. Justice League was a mess but let's be honest with ourselves. WB let Joss Whedon butcher that movie because they wanted to pander to the critics who love brainless quipfests like what the MCU puts out on a regular basis. We never got to see the real version of Justice League. So my question is, why are DC movies fair game but we're supposed to just pretend garbage like Infinity War are masterpieces?\n\nThe MCU is exhausted. They are out of ideas so this movie became a cheap gimmick to try to prove that it's not just basic parodies and they are desperate to prove how \"deep\" they can be and how much \"risk\" they're willing to take. But how much risk is there in doing things that you know will be undone in the very next movie? It renders the entire movie pointless when you know that it's just a set-up for the finale instead of standing on it's own.\n\nThe CGI was pretty subpar in some scenes. Showing off mid-2000s level CGI in some areas, which is just sad in a movie released in 2018. Say what you will about the effects in Justice League, but that movie underwent unnecessary reshoots and that caused the effects to not be as polished in some scenes. So what is Marvel's excuse for this, especially as massive as the budget for this movie was?\n\nSome of the action was really good, but overall the movie was like when you go to a restaurant and you just happen to get the food that's dry and has been sitting out for a bit. It's okay but you walk out regretting spending the money on something that you know could have been more but the people who worked on it knew they didn't really have to try to still make money off you.","displayName":"Adam F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T14:59:30.000Z","updateDate":"2018-04-27T15:00:58.000Z","user":{"userId":"977243576","realm":"RT","displayName":"Adam F","accountLink":"/user/id/977243576"},"score":1,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"This is Marvel turned up to 11.","displayName":"Simon H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T14:58:40.000Z","updateDate":"2018-05-31T14:41:25.000Z","user":{"userId":"977009525","realm":"RT","displayName":"Simon H","accountLink":"/user/id/977009525"},"score":4.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Definitely the best marvel movie out there. It is thrilling, exciting, and emotional.","displayName":"Dawson W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T14:58:39.000Z","updateDate":"2018-04-27T14:59:21.000Z","user":{"userId":"977243577","realm":"RT","displayName":"Dawson W","accountLink":"/user/id/977243577"},"score":5,"timeFromCreation":"Apr 27, 2018"}]}