{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcxMTUyNDgiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMTItMjdUMTE6MTU6MzIifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNTIwNjUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMTItMjhUMTE6NDY6NTMifQ=="},"reviews":[{"rating":"STAR_5","review":"awesome - thank you!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/2088812897802778/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-28T11:46:53.000Z","updateDate":"2018-12-28T11:47:18.000Z","user":{"userId":"977252065","realm":"RT","displayName":null,"accountLink":"/user/id/977252065"},"score":5,"timeFromCreation":"Dec 28, 2018"},{"rating":"STAR_5","review":"My 2nd favourite movie of 2018, couldn't say enough great things about this movie!!!","displayName":"Elyse M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-28T10:24:35.000Z","updateDate":"2018-12-28T10:25:41.000Z","user":{"userId":"977691695","realm":"RT","displayName":"Elyse M","accountLink":"/user/id/977691695"},"score":5,"timeFromCreation":"Dec 28, 2018"},{"rating":"STAR_3","review":"The visuals are impressive and its neat to see so many of the characters coming together but it all feels a bit overdone. We are so many films deep in the series that if you have missed one film it feels like you are jumping into the middle of a movie. The story lines are all feeling a bit repetitive and it just feels like its time to take a break from the  MCU.","displayName":"Chris H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-28T07:39:15.000Z","updateDate":"2018-12-28T07:40:43.000Z","user":{"userId":"905454868","realm":"RT","displayName":"Chris H","accountLink":"/user/id/905454868"},"score":3,"timeFromCreation":"Dec 28, 2018"},{"rating":"STAR_5","review":"The culmination of a 10-year cinematic universe doesn't disappoint as it becomes the biggest box office event since the original Star Wars trilogy. The Russo Brothers once again handle an absurd number of heroes and masterfully find enough screentime for everyone for the movie to breath, but itÂ´s CGI-villain Thanos who steals the show with its ever-imposing presence.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1356064427849159/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-28T06:49:46.000Z","updateDate":"2018-12-28T06:50:21.000Z","user":{"userId":"976976886","realm":"RT","displayName":null,"accountLink":"/user/id/976976886"},"score":5,"timeFromCreation":"Dec 28, 2018"},{"rating":"STAR_5","review":"Russo’s can do no wrong. This movie doesn’t work so great as a stand alone film. But as the biggest event in cinema history it was everything I ever wanted. Russo’s can do no wrong ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-28T05:13:34.649Z","updateDate":"2018-12-28T05:13:34.649Z","user":{"userId":"908080417","realm":"RT","displayName":null,"accountLink":"/user/id/908080417"},"score":5,"timeFromCreation":"Dec 28, 2018"},{"rating":"STAR_5","review":"Not the best MCU movie but must be the most emotional ones... Can't wait for End Game on April next year.  I hope they do better for Iron Man CGI tho.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/2029631897127694/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-28T00:55:52.000Z","updateDate":"2018-12-28T00:59:05.000Z","user":{"userId":"977690785","realm":"RT","displayName":null,"accountLink":"/user/id/977690785"},"score":5,"timeFromCreation":"Dec 28, 2018"},{"rating":"STAR_5","review":"I am totally shook and mindblown.  I can't believe how good and bad this movie is all at the same time.  I can't believe they let the movie end the way it did but there has to be another in the works. Thanos is totally and completely pure EVIL just like the EVIL lying crooked corrupt chump trump and his family and administration. This movie will make you cheer the good guys and break your heart all at the same time.  There has got to be more in the works.","displayName":"FRANKIE L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-27T19:58:20.000Z","updateDate":"2018-12-27T19:58:28.000Z","user":{"userId":"977404140","realm":"RT","displayName":"FRANKIE L","accountLink":"/user/id/977404140"},"score":5,"timeFromCreation":"Dec 27, 2018"},{"rating":"STAR_4_5","review":"Avengers: Infinity War: 9 out of 10: Well after eighteenth or so movie you know the drill. Big Universe killing bad threatens puppies and kittens and our heroes put aside their differences to defeat the big bad and someone dies because the contract negotiations were at a standstill. Yup, I am sure that is what happens. Okay so the opening scene reminds me of Alien 3 but I am sure we are done with indiscriminate killing of beloved characters in brutal ways. (Two and a half hours later) Oh dear god... \n\nThe Good: This is a hero's journey. The fact that the hero in question is the big bad Thanos makes this a unique Marvel film. While having a big bad on a hero's journey is hardly unknown, it often isn't done this well (I am looking your way Star Wars Prequels). Thanos is a man with a plan. The Avengers are simply obstacles. And for the most part, they play the role of obstacles and setbacks on Thanos' journey. \n\nAlmost everyone comes to the party (sorry Hawkeye) and it is a blast. Thor meets the Guardians of the Galaxy was a particular treat. I liked the way they managed to reward viewership of the previous eighteen movies or so. Avenger's Infinity War is stuffed with Easter eggs and trivia. In fact, the movie really is amazingly stuffed over a very long runtime. Forget added filler, you actually get the sense they wanted to put in twice as much stuff as they did. \n\nThe Bad:  With truncated participation by the individual Avengers some of them tended to revert to their baseline trope even though they have had growth over the recent films. I liked Thor in this film but he seemed to be more a person who had had a psychotic break than an actual hero. (In fairness this is called out in the film by the rabbit... sorry raccoon.)\n\nStarlord as well seems to have lost two films worth of character development in many of his scenes. He also got chubby (also called out in the film by the rabbit). There is also some flotsam left over from the Civil War film that needed to handwaved better than it was. Overall though a great job bringing such a large cast together.\n\nIs it bad form to wish that the Silver Surfer was in this film. Don't get me wrong I am not a fan of the character per se. But if you have a Thanos film you need a Silver Surfer. \n\n\nThe Ugly: Bruce Banner in the Iron Man Hulkbuster armor just never looked right. He looks like a Goomba had escaped from the set of the old Super Mario Brothers movie. \n\n\nIn Conclusion: You know I got some flack from reviewing the original X-men movies when I pointed out that Magneto had a good point. I am not saying Thanos is right mind you but the movie does make a compelling case. If it was just humans I think I could get behind it but since it includes kittens I am morally opposed. A really good film from a series that has not lacked for great films.","displayName":"Julian K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-27T17:40:05.000Z","updateDate":"2018-12-27T17:47:38.000Z","user":{"userId":"976496739","realm":"RT","displayName":"Julian K","accountLink":"/user/id/976496739"},"score":4.5,"timeFromCreation":"Dec 27, 2018"},{"rating":"STAR_5","review":"Congratulations Marvel, you outdid yourselves again. This movie has taken the top spot as not only my favorite MCU movie, but my favorite comic book movie ever. This movie did the impossible and dethroned the Dark Knight as the champion in my eyes. The Russo Brothers handled this movie with care and passion. Every character has some time to shine and no one felt shoehorned in. But without a doubt, the obvious standout here is Josh Brolin as Thanos, who is now my favorite Marvel villain, and one of my favorite villains in film. Everything just worked in here. The action, music, special effects, characters, all catapulted this movie into the stratosphere of greatness. Can’t wait to see what Marvel has in store for us next. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-27T14:21:17.766Z","updateDate":"2018-12-27T14:21:17.766Z","user":{"userId":"260228546","realm":"RT","displayName":null,"accountLink":"/user/id/260228546"},"score":5,"timeFromCreation":"Dec 27, 2018"},{"rating":"STAR_4_5","review":"Very good movie. I had a blast and I can't wait for Endgame to see how it all resolves. Definitely will rewatch.","displayName":"Andrea A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-27T11:15:32.000Z","updateDate":"2018-12-27T11:16:16.000Z","user":{"userId":"977115248","realm":"RT","displayName":"Andrea A","accountLink":"/user/id/977115248"},"score":4.5,"timeFromCreation":"Dec 27, 2018"}]}