{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwOTczODkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDYtMDJUMTc6NDY6NTEuNTc2WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzIzNzA2NzEiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDYtMDJUMjE6Mzc6MjYifQ=="},"reviews":[{"rating":"STAR_5","review":"Perfect superhero movie","displayName":"Ganesh K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-02T21:37:26.000Z","updateDate":"2018-06-02T21:37:42.000Z","user":{"userId":"972370671","realm":"RT","displayName":"Ganesh K","accountLink":"/user/id/972370671"},"score":5,"timeFromCreation":"Jun 02, 2018"},{"rating":"STAR_4_5","review":"A literal dream come true. Even when watching it for the 3rd time in theaters.","displayName":"Dave S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-02T21:29:16.000Z","updateDate":"2018-06-24T10:23:16.000Z","user":{"userId":"901332675","realm":"RT","displayName":"Dave S","accountLink":"/user/id/901332675"},"score":4.5,"timeFromCreation":"Jun 02, 2018"},{"rating":"STAR_2_5","review":"I did not enjoy it, the story was lost the characters were all over the place and they seemed weak. Saw Solo the same night liked it better.","displayName":"Tammy D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-02T20:52:50.000Z","updateDate":"2018-06-02T20:55:36.000Z","user":{"userId":"976717090","realm":"RT","displayName":"Tammy D","accountLink":"/user/id/976717090"},"score":2.5,"timeFromCreation":"Jun 02, 2018"},{"rating":"STAR_5","review":"Perfect marvel movie. Perfect.","displayName":"Ed J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-02T20:32:53.000Z","updateDate":"2018-06-02T20:33:10.000Z","user":{"userId":"977226626","realm":"RT","displayName":"Ed J","accountLink":"/user/id/977226626"},"score":5,"timeFromCreation":"Jun 02, 2018"},{"rating":"STAR_2","review":"Honestly, I don't understand all the hype about this movie. The general premise is purple Shrek (Also known as Landos), wants to collect all sorcerer's stones so he can eat I think...? It was difficult to follow. I enjoyed the tension between Iron Pickaxe Man and Dr. Dolittle. I loved the scene where bubbles come out of Peter Parker (Starwars is his superhero name) gun. I also loved the way Iron Pickaxe man was like a father to Peter Quill (Antman is his superhero name), especially because of Peter's parents and his uncle Ben Kenobi both died, and Tony Smart (who is actually Iron Pickaxe Man but nobody knows that because it's his secret identity) and his wife Pepper Pot are having a baby soon. I didn't really like the Dark Panther character or the country of Rwanda.  The Galactic Guardians were cool. If you don't know, it's a team made up of Starwars, Gamora, Rocket Rabbit, Drax (who is Landos' son), Nebulon, Mantis, and I Am Groot, I thought it was really funny when they teamed up with the Greek god Thor. Some other great appearances were of Green Shrek, Captain USA, The Coldier Soldier, Scarlet Witchcraft, Warm Machine, Revision, Black Spider Girl, and Hawkeye. Overall, a solid, wonderful movie. I give it 5 stars. I'm still heartbroken after Lowkey's death.","displayName":"Nicholas R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-02T19:56:32.000Z","updateDate":"2018-06-02T20:12:45.000Z","user":{"userId":"976663875","realm":"RT","displayName":"Nicholas R","accountLink":"/user/id/976663875"},"score":2,"timeFromCreation":"Jun 02, 2018"},{"rating":"STAR_5","review":"I could probably talk about this movie for hours, but I'll try to keep this brief: Infinity War is everything I wanted it to be and some things I didn't know I wanted it to be.  It's a comic book movie that is both unashamed of its source material while simultaneously transcending them into something greater.  Right from the start, you see that this is going to be a darker story and the stakes have never been higher.  Really moreso than the other Avengers movies, this feels like a reason for all of them to team up.  The threat is massive, and it feels massive.  Thanos is a fantastic villain, and at the same time you still sort of understand where he's coming from.  For how much they've built this guy up, he really needed to be good, and they totally pulled it off.  There are some truly crushing moments in this movie, and they work because of how much time we've spent getting to know these characters.  And the characters are really what make this movie so good.  We already know who all these people are, so now this movie can just jump forward and play with them, and it's such a blast to watch.  The team-ups are amazing, and watching the different personalities play off each other is incredibly fun.  Not to mention for how dark the movie is it's also unbelievably funny.  I laughed more during this movie than I have during most straight comedies I've seen recently, and once again it's because of these characters and how they play off of each other.  My complaints are small, and barely ruin the experience.  I would have liked to see more characters (there's a few movie characters who sit this one out, but I also would have loved to see the TV and Netflix characters join in) but I understand they had to juggle a lot of stuff already and we do actually get the return of someone who I didn't know I wanted to see again.  Also, and 2  1/2 hours, I did start to fidget a little near the end, but having said that I was never bored and I loved every second of material I got.  If anything I'd want more.  Hell, make the thing 4 hours, throw in the Defenders and The Runaways, add an intermission to give your ass a break and I'd be ecstatic.  But for how much we did get, can I really even complain?  I was so happy during this movie, until it took my heart out and crushed it, but that just shows its range and also now we're starting to get into spoiler territory.  The point is, Infinity War was everything I wanted it to be and a few things I never would have thought to ask for.  I f***ing loved this movie.","displayName":"Michael M","displayImageUrl":"https://graph.facebook.com/v3.3/505929602/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-02T19:27:51.000Z","updateDate":"2018-06-02T19:27:57.000Z","user":{"userId":"795650964","realm":"RT","displayName":"Michael M","accountLink":"/user/id/795650964"},"score":5,"timeFromCreation":"Jun 02, 2018"},{"rating":"STAR_5","review":"Best marvel film by far and all the movies and byield up leading to this pays off. Unless marvel and super hero movies are not your thing there is no reason I believe you cannot love this film. Bring on part 2!","displayName":"Peter C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-02T18:52:50.000Z","updateDate":"2018-06-02T18:55:19.000Z","user":{"userId":"977303520","realm":"RT","displayName":"Peter C","accountLink":"/user/id/977303520"},"score":5,"timeFromCreation":"Jun 02, 2018"},{"rating":"STAR_5","review":"Great film, imperfect but a great new addition to the MCU.  I loved the darker rendition of the Avengers and I'm glad they finally started taking risks as opposed to sticking to the same movie formula.","displayName":"Raphael M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-02T18:38:53.000Z","updateDate":"2018-06-02T18:40:39.000Z","user":{"userId":"962489557","realm":"RT","displayName":"Raphael M","accountLink":"/user/id/962489557"},"score":5,"timeFromCreation":"Jun 02, 2018"},{"rating":"STAR_3","review":"The final fight seen could have been a lot better. The directors inability to capitalize on the success of the Black Panther movie really showed. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-02T18:28:53.252Z","updateDate":"2018-06-02T18:28:53.252Z","user":{"userId":"260056651","realm":"RT","displayName":null,"accountLink":"/user/id/260056651"},"score":3,"timeFromCreation":"Jun 02, 2018"},{"rating":"STAR_5","review":"Amazing film. Thrilling and emotional action that works well thanks to years of character development. Also has the coolest Thor moment of any Marvel movie!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-02T17:46:51.576Z","updateDate":"2018-06-02T17:46:51.576Z","user":{"userId":"260097389","realm":"RT","displayName":null,"accountLink":"/user/id/260097389"},"score":5,"timeFromCreation":"Jun 02, 2018"}]}