{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwNzc2MzIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDZUMTk6Mzk6NDcuNzAzWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF83OTY5ODAzNTMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDZUMjE6MDc6MDUifQ=="},"reviews":[{"rating":"STAR_3_5","review":"The MCU puts out another perfectly well made movie with great special effects and good acting. However, for the most part the stakes don't feel real, and the humor (while certainly funny) feels awkward against the drama and death. This whole movie feels like it could have been a 10 minute montage showing how Thanos got his hands on all 6 stones, tacked on to the beginning of Avengers 4; it has very little (if any) stand alone value. Without the 18 movies proceeding it to establish the characters, the lack of character development in this film would be a glaring flaw, and it's clear that the ending has no meaning other than to set up the events A4. The movie is fine, but not the culmination it was advertised as.","displayName":"Steven B","displayImageUrl":"https://graph.facebook.com/v3.3/530718392/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T21:07:05.000Z","updateDate":"2018-05-06T21:14:47.000Z","user":{"userId":"796980353","realm":"RT","displayName":"Steven B","accountLink":"/user/id/796980353"},"score":3.5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_4","review":"No hay duda que Infinity War es el evento cinematográfico del año, una labor simplemente titanica y casi imposible, pero de la que salen mayoritariamente muy bien librados tanto los hermanos Russo en la dirección como Christopher Markus y Stephen McFeely en su guión. Y es que unen bastante bien todas las historias (y estilos) que se han creado durante 10 años en el MCU para hacer el más grande crossover de la historia del cine. Infinity War es una montaña rusa llena de emociones que no te suelta desde su primer minuto , con un ritmo envidiable, no se sienten sus dos horas y media de duración, siempre están pasando cosas que te hacen estar al filo del asiento. La producción es de primer nivel, sus actores están maravillosos y la banda sonora de Alan Silvestri destaca.  Sin embargo, aunque realmente valoro todo el esfuerzo y creo que lo logran bastante bien, no es mi película favorita del MCU, pues creo que se queda un poquito abajo de otras películas del MCU que considero mejores dentro de este universo (como Guardianes de la Galaxia, The Winter Soldier e incluso la primera Avengers) y es que tengo un pequeño problema con algunas decisiones dentro de la historia que realmente me chocan un poco, como sacrificar la evolución y personalidad de algunos personajes que merecían algo mejor (como Rocket, Thor y sobre todo Star Lord) , además de algunas acciones que hacen ciertos personajes que son un poquito cuestionables y sospechosamente convenientes para la trama. Pese a que las dos peliculas pasadas de los hermanos Russo dentro del MCU las considero mejores, Infinity War es una gozadera enormemente divertida y un digno principio para el final de toda una era que ha marcado de gran manera la manera de hacer cine de entretenimiento. Además no hay duda que Infinity War nos deja esperando con ansias la próxima película y ver como terminara toda esta salvajada (Calificación: 4 Estrellas; 85 de 100)","displayName":"David Omar H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T21:05:31.000Z","updateDate":"2018-05-06T21:05:50.000Z","user":{"userId":"915309089","realm":"RT","displayName":"David Omar H","accountLink":"/user/id/915309089"},"score":4,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_4_5","review":"So many heroes, so little time.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T20:43:58.326Z","updateDate":"2018-05-06T20:43:58.326Z","user":{"userId":"849348379","realm":"RT","displayName":null,"accountLink":"/user/id/849348379"},"score":4.5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_1_5","review":"Didn't like this movie.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10209097128944314/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T20:21:47.000Z","updateDate":"2018-05-06T20:27:36.000Z","user":{"userId":"977259968","realm":"RT","displayName":null,"accountLink":"/user/id/977259968"},"score":1.5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_4_5","review":"WHY THANOS???? WHYYYY????? I hope whoever is left can get that damn glove off and use the time stone!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T20:20:01.806Z","updateDate":"2019-02-27T19:26:58.278Z","user":{"userId":"880659629","realm":"RT","displayName":null,"accountLink":"/user/id/880659629"},"score":4.5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_3","review":"Better than Age of Ultron. Too many of the jokes fell flat and too many characters. Good ending and a good villain for a change. Wont be a surprise that by the end of he next Avengers they are all alive. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T20:18:58.513Z","updateDate":"2018-05-18T13:54:35.603Z","user":{"userId":"962109032","realm":"RT","displayName":null,"accountLink":"/user/id/962109032"},"score":3,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_4_5","review":"Wow!... That pretty much sums it up. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T20:15:01.635Z","updateDate":"2018-05-06T21:44:52.361Z","user":{"userId":"895283391","realm":"RT","displayName":null,"accountLink":"/user/id/895283391"},"score":4.5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_4","review":"Despite a unwieldy, disjointed narrative that feels convoluted and jumps all over the place (both figuratively and literally), this first installment of the culmination of the Marvel Cinematic Universe (as we know it) is a triumph. While it may not reach their heights' in storytelling, \"Infinity War\" is comparable to \"Lord of the Rings\" or \"Empire Strikes Back\" in how they blew their on-screen worlds wide open. It is hard to discuss my issues with the clunkier aspects of the plot without spoiling anything; however, it is sufficient to say that at certain times it feels like some characters are stranded from the rest of the story, while the viewer is then taken away from other groups of characters (doing more interesting things) to watch over someone else involved with seemingly unrelated events [to the larger story at play]. Some of his motivations are muddled compared to his comics counerpart, but Josh Brolin owns it as Thanos, even when the script drops the ball for him. He is menacing, a little sympathetic, and wields horrific might as the most-fearsome foe the Avengers (and the Guardians of the Galaxy, of course) have ever faced. The visuals to create that individual were impressive, as well; though CGI has not reached the point of becoming indistinguishable from real things, I never once saw that character and consciously imagined it as \"Josh Brolin covered in visual effects\" and just took the character as presented. The only other time I have felt that invested in an artificially-generated character was with Andy Serkis' marvelous Caesar from the modern \"Planet of the Apes\" flicks. I was also pleasantly surprised by the best thematic side-plot Bruce Banner/the Hulk (Mark Ruffalo) has ever been given (FINALLY!); I received the psychological drama I always wanted from the silver screen version of the character, handled in a deft, adult way without being too heavy (not offered in 2008's \"Incredible Hulk,\" and even under-cooked a bit in Ang Lee's 2003 \"Hulk\" movie). Though it is played for laughs at times (usually as a sports movie cliche' or a sexual innuendo gag), it still works for me. Continuing my prior comparison, the intoxicating third-act assault plays out like LOTR's \"Battle for Helm's Deep\" on steroids, even if it is less varied than the latter skirmish (mostly a lot of dudes and chicks punching/stabbing/hitting aliens). Outside of my qualms with the screenplay and the film lacking some substance, the latest \"Avengers\" movie is a major crowd-pleaser, and is sure to thrill; in the rare case that a viewer may have missed it so far, I highly recommend checking it out (though moreso for the converted than those new to this collected universe of comics stories; you will only enjoy it as long as you are invested enough in the MCU to know the characters to understand what is going on).","displayName":"Joshua M","displayImageUrl":"https://graph.facebook.com/v3.3/1073213829/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T20:08:50.000Z","updateDate":"2018-05-06T20:11:22.000Z","user":{"userId":"815041059","realm":"RT","displayName":"Joshua M","accountLink":"/user/id/815041059"},"score":4,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_5","review":"I could probably talk about this movie for hours, but I'll try to keep this brief: Infinity War is everything I wanted it to be and some things I didn't know I wanted it to be.  It's a comic book movie that is both unashamed of it's source material while stimulaneously transcending them into something greater.  Right from the start, you see that this is going to be a darker story and the stakes have never been higher.  Really moreso than the other Avengers movies, this feels like a reason for all of them to team up.  The threat is massive, and it feels massive.  Thanos is a fantastic villain, and at the same time you still sort of understand where he's coming from.  For how much they've built this guy up, he really needed to be good, and they totally pulled it off.  There are some truly crushing moments in this movie, and they work because of how much time we've spent getting to know these characters.  And the characters are really what make this movie so good.  We already know who all these people are, so now this movie can just jump forward and play with them, and it's such a blast to watch.  The team-ups are amazing, and watching the different personalities play off each other is incredibly fun.  Not to mention for how dark the movie is it's also unbelievably funny.  I laughed more during this movie than I have during most straight comedies I've seen recently, and once again it's because of these characters and how they play off of each other.  My complaints are small, and barely ruin the experience.  I would have liked to see more characters (there's a few movie characters who sit this one out, but I also would have loved to see the TV and Netflix characters join in) but I understand they had to juggle a lot of stuff already and we do actually get the return of someone who I didn't know I wanted to see again.  Also, and 2  1/2 hours, I did start to fidget a little near the end, but having said that I was never bored and I loved every second of material I got.  If anything I'd want more.  Hell, make the thing 4 hours, throw in the Defenders and The Runaways, add an intermission to give your ass a break and I'd be ecstatic.  But for how much we did get, can I really even complain?  I was so happy during this movie, until it took my heart out and crushed it, but that just shows its range and also now we're starting to get into spoiler territory.  The point is, Infinity War was everything I wanted it to be and a few things I never would have thought to ask for .  I f***ing loved this movie.","displayName":"Michael M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T19:44:03.000Z","updateDate":"2018-05-06T19:44:10.000Z","user":{"userId":"977198522","realm":"RT","displayName":"Michael M","accountLink":"/user/id/977198522"},"score":5,"timeFromCreation":"May 06, 2018"},{"rating":"STAR_2_5","review":"Middle to the end was good. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-06T19:39:47.703Z","updateDate":"2018-05-06T19:39:57.692Z","user":{"userId":"260077632","realm":"RT","displayName":null,"accountLink":"/user/id/260077632"},"score":2.5,"timeFromCreation":"May 06, 2018"}]}