{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNzYxNTciLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMTlUMDY6MzE6MzkifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzA0MDYzMTMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMTlUMDk6MzI6MzkifQ=="},"reviews":[{"rating":"STAR_4","review":"Avengers forever!\n\nThere is plenty to celebrate. Today, releasing its nineteenth movie, the multibillion-dollar American film production company Marvel Studios not only celebrates a decade of glories since the unsuspected inauguration of cinematic universes with \"Iron Man\" by Jon Favreau, time in which, of course, it reaps trillions of dollars for The Walt Disney Company; but also celebrates that its heroes, idealizations of human beings, have become effigies for thousands of kids and grown-ups; celebrates film and comic with passion thanks to remarkable artists who have materialized fictions in the eyes of a humankind in the depths of despair; celebrates life through real feelings packed in gorgeous bags; celebrates it's got an imperishable place in the Popular Culture of the 21st century; celebrates emotional beauty and the complexity of emotions in a shattered viewer who watches; celebrates the endless praises and universal acclaim has obtained with each entry, with every mistake, with every success; celebrates the establishment of a brand that seemed dead in the history of modern cinema- yes, the post-credits scene; -celebrates, at the expense of its interconnected stories, another important establishment in mainstream movies: too many easter-eggs; celebrates the influence that its heroes have caused in the minds of many people; celebrates the start of a grand finale, one more phase, which actually means three phases of triumphs and falls; celebrates that they have built the unimaginable: reaping the fruits of an idea that at first all dismissed - especially production studios, - the fruits that, while represent in monetary gain, also represent a deep-rooted pride of reviving the golden age of comic-film adaptations, building multiverses with more pros than cons where fearless charisma, white humor, feelings, passion, PG-13 ratings and audiovisual high-quality were capital rules in the conception and subsequent production of live-action stories printed in paper; but above all, it celebrates something that is honestly unusual currently: to make cinema, good cinema, human, ambitious, inspiring, diverse cinema with disproportionate amounts as a budget, brilliant. Today, we must wear our most elegant clothes because a long way is coming to an end, a painful, exciting and hopeful end; it won't go away for keeps- never mind - but what we know as Marvel is fading away: marvelous talents, marvelous characters, marvelous messages, marvelous enlightened dreams, marvelous cinema.  \n\nThanos is here. And although it may sound a little glib and monotonously overused, he's come to destroy all the world, but he won't do it alone. To make his inhuman desire a reality, the grandiose Infinity Gauntlet, which aggrandizes his right hand, must be complemented by each one of the six Infinity Gems: time, space, mind, reality, soul and power; hidden across the length and breadth of the galaxy and the planet Earth, most of these magic stones have been obtained by different super-humans throughout the three phases of the MCU, called heroes. It's the greatest and deadliest threat they have been tackled, now these silver-tongued, sharp-tempered artificially-altered women and men will face an imminent cataclysm to humanity. Will the Guardians of the Galaxy, the Avengers and the newest incorporations inside Marvel's cinematic universe defeat Dione?  \n\n\nNo one can argue Marvel Studios is its heroic headliners, on this occasion, many flaunt their most peculiar and politically correct personalities. I'm not a fervent comic-factory fanboy, you must win that honor with great effort, I'm simply hypnotized by the magic of cinema, I have followed closely the house of ideas' adaptations for more than three years and, like the fans, I've fallen in love with all its adventures, from the serious-themed ones to the most eccentrically amusing, for that reason, I was afraid of what Christopher Markus and Stephen McFeely, creators of the script,  have conceived, holding in their hands so many options to choose from, hands down, these gentlemen have written a drop-dead gorgeous blockbuster. Always leaning heavily on the comics by Jack Kirby and Stan Lee, the most loyal screenwriters of the company get the most out of the mind-bending work weaved by dozens of creative minds over ten years in order to conjure up a praiseworthy ending, made up with the requirements demanded by the buffs but without neglecting the narrative needs of the story, setting up a next-to-last crowd-pleasing thrill-ride of a movie, that reminds a lot of a real Greek tragedy, a hard time. An unspeakable glee emerges when you watch your most loved characters popping up with each new scene, a feeling strengthened by seeing them relating each other, especially those dudes who didn't even know the existence their \"friends from work\" and those who share similar ways of being, where a funny leadership struggle comes up. It can be said that this titanic adventure is narrated by means of three channels, working simultaneously through three different acting ensembles, in order to synchronize the argumentative axis with the superheroe triplet in the end, each of them executing a very important role; it's unbelievable to break down every detail and realize that even the \"least important\" character gets his moment of glory -although, surely, certain men will lose a huge portion of his legion of followers with their actions. Obviously, it doesn't forget the characteristic comedy pack of the company, not always so positive, it breathes the well-known 'Marvel Formula', each hero bathes its own narrative purpose, particularly in the first two acts, with the typical quips, there are many push-lines as comical as dramatic, each one has the chance to shine on screen as they open the way to others, a material in which nothing, absolutely nothing is put at random. Amalgamating more than 70 now-famous familiar characters in a coherent, kinetic and empirical mold is already an arduous task, which is much harder if, like Star Wars' one-billion-dollar flicks, planets and dreamscapes, villains and additional ideas are integrated organized by the screenwriters. The film will mean a cumbersome adventure for casual, averse viewers who buy a movie ticket just for the immense, highly-anticipated hype, however, for the most assiduous or, at least, those in connection with to three of the fundamental works in the Avengers' timeline may scrape the sky, but also the hell. Although much of the show is run by comedy, there is a good deal of pure and heartbreaking drama in the footage, tending to tragedy in the last act, one act that will be fresh in your mind for years, thanks to the rapid pulse and an impassable consternation when the credits are rolling down. As they promised, death will visit the group of heroes more than we thought, from the beginning to the end, tears will run through the eyes of those dreamers. It's not a lie that several fans anticipated some moves that involve certain characters due to the announcing of their own movie sequels or standalone ideas but be careful, Marvel wants you to think that you get the upper hand just to revolve your predictions when you're about to win. The dramatic set-pieces are its A-game, just one second after a visual gag the character has the opportunity to sadden the spectators' hearts; The application of a dark, cruel and unusual tone as soon as the first plot twist comes to the surface is really, really unexpected,\n and although the Russo brothers and the screenwriters know how to relate and distribute them with caution throughout the film, they condense and complement themselves like a perfectly-shaped puzzle in the last twenty minutes in a colossal, universal, commercial film piece of art, that makes history. Avoiding a specific genre, the sibling filmmakers have taken inspiration on heist films such as \"Two Days in the Valley\" and \"Out of Sight\" to weave a highly entertaining story, with the present-day superhero film vices, but applying artistic and narrative decisions that lead us back in time, similar camera movements but with different appearances to the 90´s-set crime movies, a complete marvel. Every gigantic set-piece is inserted at the right time and place and works like a synchronized clock, however, there are flaws in the assembly of those moments, put the blame on the editing work or the script pages for the abrupt change between scene and scene, that is to say, thirty seconds after an extremely sentimental poignant moment a funny character pops up with a funny line\n, they're risks that may be taken to encompass so many things into a single film, but we have to be thankful, compared to all the nightmares that could have happened, Rocket's jokes after a farewell - \"no resurrections\" - of a certain individual must be tolerable. Many of the enigmas that the previous films raised and the questions and concerns provoked by the marketing material of this audiovisual production will fully pay off in this 2-hour-40-minute visceral voyage. In the same way, and according to the directors, those characters who had a larger participation in the first story will cede command to those who didn't gain much prominence, producing a good balance between the demands of the fanatics and the storytelling. Subtly, the script opened paths while closed some others, meaning, while it insinuates relentless goodbyes also proposes new complements for the cinematic universe revival after the closure of this titanic battle, making it quite clear via the one and only post-credits scene announcing something that many, many have proclaimed as Phase 4's new captain. Related to the above-mentioned suggestions, over the first half, a specific, short scene shows the capacity already demonstrated by the company's few heroines in a sneaky and very obvious way, with heavy punches and kicks, but with heart and motivation coming from these lately-recognized four ladies, they plead for a film of their own, and, hell yeah, it'd not be a bad idea taking the material they have offered us all this time as a reference point; they're physically reckless for just twenty seconds. And the bad guy really, really matters. That abhorrent label is gone now, describing the minimal impact that Marvel's weak villains, of course, with audacious but few exceptions as The Vulture from \"Spider-Man: Homecoming\", Loki from \"Thor\" and Erik Killmonger from \"Black Panther,\" on the way, no villain has managed to be really a villain, that stage's officially concluded. Despite it sounds tautologous, Thanos is the architect of all the MCU, therefore, screenwriters could not introduce him like most of the anterior baddies by means of sporadic scenes where he hollers and plans, threats against the world, not at all, here they do it the right way: endowing him with the same mighty features as Michael B. Jordan's in \"BP\", we understand what goes through his mind and heart of and, at times, we understand his actions, such features are a dramatic, human, powerful background that allows him to become an honest-to-God individual, he suffers too, even if he doesn't say it in words, there are sadness and insecurity inside him, Thanos is a titan, full of hatred, full of tragedies, an out-of-control beast. Passing over any political or philosophical text, the story moves quickly, but on its way, it slips up when trying to deceive the spectator with turns that one already predicted. They don't allude to the overlong and complicated coherence and cohesion of this story with others, quite the opposite, they refer to the approach and plot development of this film, which gives out so many twists that, indeed, don't end up being unexpected because the same viewer gives explanations and gets rightly in the place about what's going to happen, some others, generally related to massive-destruction and death, don't provide enough time to recover because the next one is around the corner, the audience is simply shocked when suddenly receiving the next blow, And so on until in the end, although each of the events affects, they lose the emotional shock, that with a more precise handling would have caused a greater impact; probably, it's a tactic to get rid of some characters, but if it continues, I don't even imagine how many tissues I have to need for 2019's grand finale. By the way, there are no happy endings, and for the first time in many years, the film ends in tragedy, zero laughter, is fertile in tears.  \n\n\nThe pictures take advantage of the photogenic faces and the nostalgia coming from each character to place them in the middle of dreamy landscapes which can be scenarios of massacres or simple backgrounds to development scenes. The colors are essential in the scenes, the three groups of superheroes are assigned a different tonality according to the timing handled by every hero; the visual settings expel quality setting spectacular artistic feats, either outside or inside the planet Earth. The set-pieces, that onerous, but risky action sequences are embellished to the max by the excellent, in capital letter, score of Alan Silvestri, with only two not-original songs made for the composer (a couple surprises of yesteryear and Wakanda). The emotional scope of the clamorous and poignant melodies composed by Silvestri is impressive, a potential Oscar 2019 contender for Marvel. If you close your eyes and play the work of the \"Forrest Gump\" composer would emerge the same sensations that if you were contemplating the beautiful pictures, but, what's really beautifully intoxicating is to couple sound and image, making us go through the best, but also through the worst. Trent Opalochy's cinematography and the effort of all creative departments - I'm stunned to see the number of people involved in the production - make it possible that, although the film doesn't become into an instant superhero classic, manages to leave on our minds a good amount of dramatic and action sequences that make history, cinema history, they make your heart beat to the rhythm of the emotion, they make you imagine that you're in the fight, they make you understand why film is life. There's grandiloquence every which way, but here it's not a mere and bombastic accessory, every sequence fits with the script to give verve and impact to every turn the story takes, exhibiting a box of useful angles and camera movements that move away from any superhero-genre cliché, they are exquisitely built thanks to the truly special high-octane special effects - overlooking every other slip-up.- Any perceptible visual flaw must be forgiven due to the complexity this film encloses; at least in the visual and, therefore, artistic field, it's in the top 3 of the best superhero films in film history, just one more record.\n\n\"Avengers: Infinity War\" by Anthony Russo and Joe Russo won't be an expressly idyllic experience for many viewers, what is more, it seems that the mega-event set up by the spoiled brothers of Marvel has switched the game and instead of filling it with nondescript pyrotechnics and visual gags, they morph the accustomed action superhero film into a drama of unthinkable reaches, standing out by the seriousness, coherence, and severity of a script that knows how to use their strengths through characters brimming with soul, personality, and powerful messages. The film veers when it pleases, and although doesn't do it precisely in the best way sometimes, it hits the spot in almost every aspect, causing a really disarming effect, when the credits rolling down, you're still in your seat, speechless, depressed, shocked; no doubt, no superhero film had achieved it to date. Disney's subsidiary company is not jealous of the dark and pessimistic tone of DC, as it has created its own tone with much more deadly consequences than the Warner Bros company's flicks. The first shared universe in cinema history has been manufactured by artists who after long working hours have relegated time with their families to bring happiness to others through adaptations which are etching in our memories. How many kids scamper with Captain America shields in their heads or Iron Man scarlet armors? Ten years of stories as proof of a work full of sacrifices, ups, and downs, But today, after such a long time, the time has come to say thank you, thank you for having transformed present-day cinema, for better or worse. Just like J.J. Abrams'  2015 space opera \"The Force Awakens,\" a new movie-event takes place this year, \"Infinity War,\" the first part of a grim farewell, shakes our senses, its heartbreaking movements deliver a matchless adventure and its strong impact will affect the spectators for much longer, a must-watch. Watching the final scenes is hard task because your eyes are full of tears, that's a faithful sign of what kind of film it is; A motion picture as entertaining as melancholic that shows Marvel's love for his creations and that serves as a very complex turning point leading up to what will mean the closure of a golden superhero century.","displayName":"Kevin F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-19T09:32:39.000Z","updateDate":"2018-05-22T17:59:55.000Z","user":{"userId":"970406313","realm":"RT","displayName":"Kevin F","accountLink":"/user/id/970406313"},"score":4,"timeFromCreation":"May 19, 2018"},{"rating":"STAR_2","review":"Pretty disappointing ending every one will come back somehow so what was the point of even leaving that type of ending.","displayName":"David Q","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-19T09:14:34.000Z","updateDate":"2018-05-19T09:16:21.000Z","user":{"userId":"906506858","realm":"RT","displayName":"David Q","accountLink":"/user/id/906506858"},"score":2,"timeFromCreation":"May 19, 2018"},{"rating":"STAR_5","review":"Amazing movie! Hugely ambitious but absolutely nails it!  See this movie now.","displayName":"Brett E","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-19T08:48:45.000Z","updateDate":"2018-05-19T08:49:50.000Z","user":{"userId":"977207825","realm":"RT","displayName":"Brett E","accountLink":"/user/id/977207825"},"score":5,"timeFromCreation":"May 19, 2018"},{"rating":"STAR_5","review":"Going into this movie, my expectations were through the roof. This movie not only met those expectations but exceeded them! This is now in my top three superhero movies EVER along with the Avengers and Guardians of the Galaxy. The action is amped up even more, and the characters are stronger than ever. How could you not be blown away at the fact that the Avengers and the Guardians of the Galaxy all fit together in one movie, without having the movie feeling too crowded?The standout heroes go to Iron Man and Thor, but let's be honest the biggest standout is Josh Brolin as Thanos who is now the best and most layered villain in the entire MCU. All in all, this was a fantastic movie and a wonderful addition to the MCU.","displayName":"Wyatt S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-19T08:22:01.000Z","updateDate":"2018-05-19T08:30:01.000Z","user":{"userId":"977276389","realm":"RT","displayName":"Wyatt S","accountLink":"/user/id/977276389"},"score":5,"timeFromCreation":"May 19, 2018"},{"rating":"STAR_5","review":"Loved the movie watched it 3 times in 3d.","displayName":"James L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-19T08:12:43.000Z","updateDate":"2018-05-19T08:14:48.000Z","user":{"userId":"977276362","realm":"RT","displayName":"James L","accountLink":"/user/id/977276362"},"score":5,"timeFromCreation":"May 19, 2018"},{"rating":"STAR_5","review":"This was one of the best fantasy hero movies I've seen.  Marvel did a great job of mixing all the story lines into a single movie.  As a fan and a movie goer, this movie delivered in nearly every way it could.  While there are scenes you can quibble with, but taken as a whole, this movie delivered great fun, great action mixed with enough gravitas and weight to both thrill and stun the audience.","displayName":"Sam S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-19T07:26:27.000Z","updateDate":"2018-05-19T09:25:26.000Z","user":{"userId":"977276243","realm":"RT","displayName":"Sam S","accountLink":"/user/id/977276243"},"score":5,"timeFromCreation":"May 19, 2018"},{"rating":"STAR_4","review":"Insane payoff for the people who have seen all other MCU movies and fun for general audiences. Marvel's best villain yet and will be remembered as one of the best of all time up there with Darth Vader and the Joker.","displayName":"Neil R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-19T07:22:11.000Z","updateDate":"2018-05-19T07:24:33.000Z","user":{"userId":"977276255","realm":"RT","displayName":"Neil R","accountLink":"/user/id/977276255"},"score":4,"timeFromCreation":"May 19, 2018"},{"rating":"STAR_5","review":"Such cool scenes. Thanos is the main character. To an extent you are rooting for him.","displayName":"Kawika A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-19T07:16:52.000Z","updateDate":"2018-05-19T07:17:41.000Z","user":{"userId":"977276248","realm":"RT","displayName":"Kawika A","accountLink":"/user/id/977276248"},"score":5,"timeFromCreation":"May 19, 2018"},{"rating":"STAR_5","review":"This was one of my fav movies.","displayName":"Jamie S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-19T06:53:56.000Z","updateDate":"2018-05-19T06:54:07.000Z","user":{"userId":"977276174","realm":"RT","displayName":"Jamie S","accountLink":"/user/id/977276174"},"score":5,"timeFromCreation":"May 19, 2018"},{"rating":"STAR_5","review":"this was honestly such an amazing film, i absolutely loved it apart from the brutal ending but i think we all know what's coming. the only thing i would be able to fault would be the speed in which Thanos found all the infinity stones, i thought he might have a bit more trouble but he is \"all powerful\" i guess.","displayName":"Grace B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-19T06:31:39.000Z","updateDate":"2018-05-19T06:34:29.000Z","user":{"userId":"977276157","realm":"RT","displayName":"Grace B","accountLink":"/user/id/977276157"},"score":5,"timeFromCreation":"May 19, 2018"}]}