{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNDM2MTkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMTU6MjE6MDUifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84ODE5NjAxMTYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjdUMTU6MzA6NTEifQ=="},"reviews":[{"rating":"STAR_5","review":"Loved the Infinity Gauntlet comics when I was a kid.  This adaptation is true to the feel and overall arc of the comics while having many different characters than the comics.  Grounded in the Marvel Cinematic Universe, I think having seen the earlier movies adds depth to Infinity War but it isn't necessary.  If you know who Captain America, IronMan, Spider-Man, the Hulk, Groot and Gamora are, you should be able to mostly follow along.\n\nI'm watching it for the second time today.","displayName":"Grady S","displayImageUrl":"https://graph.facebook.com/v3.3/1199172168/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:30:51.000Z","updateDate":"2018-04-27T15:37:38.000Z","user":{"userId":"881960116","realm":"RT","displayName":"Grady S","accountLink":"/user/id/881960116"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_0_5","review":"*Contents Spoilers* This is orderly base in the scenes. Firstly, Vision was attacked and he couldn't do anything bout it, seriously. The person that was able to will the hammer of Thor couldn't do anything at all in the entire movie. Secondly, Spidey and Iron was removing that Glove from Thanos while mantis is controlling his mind and Quill just had to be UNREALISTICALLY asking bout Gamora and then punching Thanos and Causing Mantis to loose focus. Good job Quill. Thirdly, If you know who Dr. Strange is, he is supposed to be the Guardian of Earth. Overseeing the past and the future. He is supposed to be providing solutions for the Avenger's. But apparently I have no clue. This movie is a Joke! Seriously. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:28:45.679Z","updateDate":"2018-04-27T15:28:45.679Z","user":{"userId":"260121873","realm":"RT","displayName":null,"accountLink":"/user/id/260121873"},"score":0.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"The Avengers and their allies must join together once again to defend the earth, only this time they may have to sacrifice more than they bargained for to defeat a seemingly unstoppable foe. \nAfter 10 years of Marvel films it all builds up to this ultimate collaboration of your favourite heroes from the MCU and boy does it pay off. As we already know all of these characters' back stories, relationships etc. we can launch straight into the film without too much exposition and enjoy spending time with our beloved heroes and enjoy characters from different films meeting each other for the first time. However this also means that any loss is that much greater as we have grown to love these characters and this is the first film in the MCU to truly feel perilous and have you fearing for their lives. \nThere are too many protagonists in this film to mention every principle actor but suffice to say everyone puts in a great performance across the board. The performances that stood out most to me were by Chris Hemsworth who gets to show more vulnerability and layers to Thor than usual, Tom Holland as Spiderman who continues to be one of the most charming and funny characters in the MCU and Robert Downey Jr who plays a rather weathered looking Iron Man. There is a new supporting character introduced, Eitri, played by Peter Dinklage however that is a little on the weak side and whose CGI enhancements and strange line delivery is a little awkward. In terms of the new villain though, Thanos does not disappoint. Unlike a lot of Marvel villains he has an interesting motivation and has a strong and intimidating presence on screen, in part due to his excellent voice acting by Josh Brolin and CGI with good facial animation. Some of the characters get more time in the lime light than others who end up as supporting or secondary characters but that's unavoidable with such a large cast and no one is completely forgotten.\nThis is also a very good looking film. The majority of the CGI is gorgeous and the locations and costumes are excellent. This mixes nicely with a fair amount of real stunt work and actors performing fight choreography so the fights still has a very solid feeling to them. \nEven though this is a two and a half hour film it certainly doesn't feel like it. The pace never drops and the film continues to drive forward with a good mixture of action, comedy and suspense as the villain continues to drive towards his goal and the stakes continue to be raised.  \nAs one of the many people who have been watching the MCU from the start this is a wonderful moment. Establishing this universe was by no means an easy task and this is its crowning glory. The Russo brothers have done us proud with this epic collaboration and I'm already eagerly awaiting it's conclusion next year.","displayName":"Patricia W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:28:03.000Z","updateDate":"2018-05-01T13:49:40.000Z","user":{"userId":"976642015","realm":"RT","displayName":"Patricia W","accountLink":"/user/id/976642015"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"Guerra Infinita é o filme bem diferente de seus filmes antecessores. Com um roteiro que soube focar em todos os seus personagens, cenas de ação incríveis, efeitos especiais maravilhosos de se ver, comédia e humor que funcionam muito bem, trilha sonora maravilhosa de se ouvir, e com uma cena final sem palavras! Vingadores: Guerra Infinita, é sim um dos melhores filmes de 2018!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/260714614420257/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:25:16.000Z","updateDate":"2018-04-27T15:42:52.000Z","user":{"userId":"977224530","realm":"RT","displayName":null,"accountLink":"/user/id/977224530"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"It had a lot of funny moments But all that is forgot with the ending. That’s why I didn’t give it a full 5 stars","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:24:27.976Z","updateDate":"2018-04-27T15:24:27.976Z","user":{"userId":"260121926","realm":"RT","displayName":null,"accountLink":"/user/id/260121926"},"score":4.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_5","review":"It was the most terrible movie I've ever seen, I cried for a solid 3 hours after, loved it 10/10","displayName":"Ellie W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:22:55.000Z","updateDate":"2018-04-27T15:23:44.000Z","user":{"userId":"977155719","realm":"RT","displayName":"Ellie W","accountLink":"/user/id/977155719"},"score":5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"Wow. Really lived up to expectations. Entertaining throughout with a surprising ending. Thanos showed why he's been setup as the ultimate villian for 6 years.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:21:39.654Z","updateDate":"2018-04-27T15:21:39.654Z","user":{"userId":"260010365","realm":"RT","displayName":null,"accountLink":"/user/id/260010365"},"score":4.5,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_3","review":"Countless battle scenes, sprawling storyline and super heroes abound. Film is a bit messy and unfocused, with (spoiler or no big surprise) an open ending.","displayName":"randal%20 t","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:21:27.000Z","updateDate":"2018-04-27T15:23:18.000Z","user":{"userId":"976374181","realm":"RT","displayName":"randal%20 t","accountLink":"/user/id/976374181"},"score":3,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_3","review":"amazing...Damn near flawless.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10156099020556000/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:21:19.000Z","updateDate":"2018-04-27T15:22:35.000Z","user":{"userId":"977243621","realm":"RT","displayName":null,"accountLink":"/user/id/977243621"},"score":3,"timeFromCreation":"Apr 27, 2018"},{"rating":"STAR_4_5","review":"It was an AMAZING novice I really enjoyed it and I'm not much of a fan for these movies but I personally really enjoyed it was funny and was a really cool movie.","displayName":"Annika P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-27T15:21:05.000Z","updateDate":"2018-04-27T15:22:28.000Z","user":{"userId":"977243619","realm":"RT","displayName":"Annika P","accountLink":"/user/id/977243619"},"score":4.5,"timeFromCreation":"Apr 27, 2018"}]}