{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNjczMzMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMTNUMTM6MTE6NDkifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzIwOTk1NjQiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMTNUMTQ6Mzg6MjguMzMwWiJ9"},"reviews":[{"rating":"STAR_4","review":"Quality action, but I selfishly didn’t love that the movie featured Guardians characters over others. Thor, Iron, Captain will always be my Avengers!!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T14:38:28.330Z","updateDate":"2018-05-13T14:38:28.330Z","user":{"userId":"972099564","realm":"RT","displayName":null,"accountLink":"/user/id/972099564"},"score":4,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_4_5","review":"Avengers:Infinity War achieves the impossible by uniting an entire universe. The film has probably the best mix of comedy and action keeping me invested in every character. Thanos is also the best Cillian Marvel has put out yet, coming off as the most menacing being in the galaxy. Overall, this is a must watch for fans and non-fans alike.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T14:29:31.594Z","updateDate":"2018-05-13T14:29:31.594Z","user":{"userId":"976943474","realm":"RT","displayName":null,"accountLink":"/user/id/976943474"},"score":4.5,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_2_5","review":"The  ending was truly disappointing and confusing. It was a let down, after Black Panther.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1956158238030639/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T14:26:07.000Z","updateDate":"2018-05-13T14:28:13.000Z","user":{"userId":"977267410","realm":"RT","displayName":null,"accountLink":"/user/id/977267410"},"score":2.5,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_5","review":"One of the best movies I've seen in a while. I'm happy with the end result, even though it was not what I'd thought it would be. Marvel Studios, the Russo Brothers, Kevin Feige, the writers, the actors and anyone involved in the making of this movie should be proud of what they have created. The score was beautiful and stood out when and where it need to, the acting was flawless and really delivered, the plot was interesting and never had a dull, boring moment where I felt tired or impatient, and the CGI and motion capture for most of the characters were on another level. It really showed how much time they spent on this movie. \n SPOLIERS SPOILERS SPOILERS SPOILERS SPOILERS SPOILERS SPOILERS\n\nMy only complaints are the villains, lack of character development and runtime. In the villain's cases, they all felt very weak. The Black Order were WWAAAYY weaker than they should have been. The way that they portrayed Proxima Midnight was flat out embarrassing. Black Widow and Okeye should not have been able to fight her, even if they were teaming up. And Ebony Maw was a intimidating and formidable foe, until they killed him off Aliens style. I was expecting him to come back and kick Spiderman's ass, or at least come back in the Wakanda battle, but he never came back. Corvus Glave and Cull Obsidian were major disappointments as well. I'm glad they did Thanos properly. \n\nThe movie also felt very short. I've been waiting ten years for this movie to come out. I would not mind sitting in the theater for 3 hours. When the credits rolled after their tear-yanker of a ending, it left everyone confused. A kid next to said \"Wait, THAT'S IT?!?! That felt like an hour!!\" I know that this is only part one of a two part saga, but the movie itself felt so unsatisfying. \n\nAnd lastly, the character development was very scarce. Only Tony, Thanos, Thor, Gamora, Vision, and Scarlet Witch had character development. AND HALF OF THEM DIED!!! Founding members such as Captain America, Black Widow and War Machine barely had any lines. And people like Falcon, Drax, and Rocket were very under utilized. I get that you have a lot of characters to write and incorporate into a movie and some had to get some scenes cut out (some more than others). But the easy fix for that is to make the movie longer. That way no one got left out. Hopefully, Avengers 4 fixes that. \n\nHowever, the best thing about the movie was the acting. Thanos really sold me as this complex and broken character, who isn't bad because he wants to be, he's bad because of the circumstances. He has to be the villain in order to save the universe. He has to kill his daughter in order to save half of humanity. He has to murder trillions of people because he can not just stand by and watch the same thing happen to another race.  And Josh Brolin really sold that idea to me. If he doesn't get an Oscar for his role as Thanos, then the Academy really are a bouquet of idiots.  Chris Hemsworth, Paul Bettany, Zoe Saldana, and Elizabeth Olsen really excel and grow as characters in this movie than any other MCU movie that they been in. \n\nOne of the best movies of 2018 yet and I can not wait to see what else is next for the future of the MCU. 10/5 stars. Marvel Studios really deserves this.","displayName":"Leo B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T14:13:41.000Z","updateDate":"2018-05-13T15:20:26.000Z","user":{"userId":"977267395","realm":"RT","displayName":"Leo B","accountLink":"/user/id/977267395"},"score":5,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_5","review":"I liked the movie a good one and that good special effects like thanos gathers the gems the appearance of the guardians of the galaxy and the return of the captain america and bucky I liked the final battle there is nothing wrong with the movie","displayName":"Marco Augusto O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T13:49:11.000Z","updateDate":"2018-12-10T17:43:31.000Z","user":{"userId":"977175399","realm":"RT","displayName":"Marco Augusto O","accountLink":"/user/id/977175399"},"score":5,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_2","review":"One of the worst movies I have seen in a long time.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1032584656893918/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T13:48:01.000Z","updateDate":"2018-05-13T13:48:39.000Z","user":{"userId":"977267361","realm":"RT","displayName":null,"accountLink":"/user/id/977267361"},"score":2,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_1","review":"Watch all of your favorite heroes be funnyy","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10156359240536488/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T13:42:50.000Z","updateDate":"2018-05-13T13:43:42.000Z","user":{"userId":"977267359","realm":"RT","displayName":null,"accountLink":"/user/id/977267359"},"score":1,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_5","review":"One of the Best movie I have seen in my life","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/2078425879082273/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T13:31:49.000Z","updateDate":"2018-05-13T13:32:28.000Z","user":{"userId":"977267351","realm":"RT","displayName":null,"accountLink":"/user/id/977267351"},"score":5,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_1","review":"Movie was a disappointing follow up to the thoughtfulness of the most recent MC movie, Black Panther as well as the other great MC movies (i.e., CA, Iron Man, Fantastic Four, for example). Comedic relief was a lackluster comparison to that of Iron Man. Action scenes and graphics were great as usual from Marvel, but the movie lacked a cohesivness and honestly, an entire story line that tied all the characters together. It lacked character development and killed off half the characters, starting even in the 1st 5 minutes. I'm an avid MC fan but this seemed as though MC threw scraps together and prayed it would work. And why is Tyrian from GOT in the movie??? To sum it up, I feel like I watched a 2.5 hour riot that cost me 30$. I'm upset. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T13:24:37.381Z","updateDate":"2018-05-13T13:49:33.702Z","user":{"userId":"260131562","realm":"RT","displayName":null,"accountLink":"/user/id/260131562"},"score":1,"timeFromCreation":"May 13, 2018"},{"rating":"STAR_2","review":"Thie first third is a funny romp through tons of marvel characters. It's pretty busy, but at least it's funny. The last third just feels like disorganized junk. Worse it takes itself way too seriously.\n\nAs always (except Spider Man Homecoming) the villain is lackluster. Unlike other Marvel villains the studio is in love with this one so he gets far too much screen time.","displayName":"Chuck M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-13T13:11:49.000Z","updateDate":"2018-05-13T13:15:40.000Z","user":{"userId":"977267333","realm":"RT","displayName":"Chuck M","accountLink":"/user/id/977267333"},"score":2,"timeFromCreation":"May 13, 2018"}]}