{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84ODAwMDI0NDYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMTM6MTU6NDIifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzQzOTc5NTkiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjhUMTM6MjY6MTgifQ=="},"reviews":[{"rating":"STAR_5","review":"Avengers: Infinity War-the Marvel super-creation carrying the gargantuan expectations of millions of die-hard fans and the buildup of 18 great films before it has finally been delivered to us and all I can say is that it is the best 10th anniversary gift, anyone could ever have wanted. An all-powerful villain, a lineup of all our favorite characters (barring two important ones) and the magic of Marvel make for an invigorating tale of classic good vs. evil where our heroes try to stop a galactic warlord on a murderous agenda to wipe out half the population of the universe by collecting all six infinity stones.\n\nThe opening is quite grim and the scenes, just from the first five minutes (which directly tie in with Thor:Ragnarok), establish exactly how intimidating, catastrophic and mighty our villain- Thanos is. This also pretty much prognosticates the tone of the rest of the film. Watching Infinity War is like cheering for your beloved team at a highly unpredictable and exciting game of theirs where one moment you're hooting away at the top of your lungs and in the other, you're seeing them going through a low. Yet through all the madness and chaos the film somehow finds stability. It is thrilling to witness the grand entries of the heroes you grew up with and them tossing the bad guys in the air but it is equally so, no matter how heartbreaking as well, to see them fight to the nail, stare hopelessness in the face and still put on a courageous smile and battle on and truly reach their breaking points, for that is what brings out the humanness of them all. Their inability to ignore the guidance of their moral compasses and turn stone-cold like Thanos is one of the big differences that stand out and while it may have seemingly made things tougher for them, is in my belief, that which will hand them victory too. \n\nFrom edge-of-the-seat anxiety-inducing to hilarious to devastating, this film will take you through a large part of the spectrum of human emotions and yet not once does it tip off balance. The humor is tastefully placed and while admittedly the impact of certain scenes could have been heightened, such small flaws can easily be forgiven just by looking at the artfulness by which the Russo brothers have been able to include so many different characters in such an eventful and complex plot without missing to hold the unwavering attention of the viewers and maintain their heart rates at a constant mark quite surely, slightly above the normal. Apart from this, the different parallel story arcs, too, run meaningfully side-by-side and converge in a finale of epic proportions although the ultimate one is only going to come a whole year later. \n\nThanos, is given an extra layer of character such that even a being like him, so cruel and madly obsessed with death is shown to have a part of him that knows what love is and that punishes his heart with regret which is something that just enrichens the quality of the slight amount of character development that this film had to do. Also, despite his clearly fearsome personality, the Avengers come infuriatingly close to defeating him at instances and this goes to show that there is still reason to keep hope alive as even Thanos is not invincible. The film's main intention, however, was to tease the overgrown ardor and sentiments attached to every single superhero that appeared and give it all an intensity like never before and it has most definitely done that.   \n\nThe execution of the action scenes with all their zest and visual flair will leave you awestruck for sure, although in a couple of them the CGI came out a bit tacky. I would recommend watching this movie within the first few days of its release when all the theatres are packed because the environment created by so many people who all love the same thing will take the movie-watching experience to a different state altogether.\n\nA glorious feat and achievement and yet another feather in the cap, Infinity war will make you laugh passionately and cry just as much and may even leave you disoriented due to its shocking and brave ending. Do stick around for the post-credits scene though as it sets up what's about to come and will leave you desperately hungry for more.","displayName":"Purbita D","displayImageUrl":"https://graph.facebook.com/v3.3/1127423567308929/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T13:26:18.000Z","updateDate":"2018-04-28T13:27:05.000Z","user":{"userId":"974397959","realm":"RT","displayName":"Purbita D","accountLink":"/user/id/974397959"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"an amazing movie. Already saw it twice.","displayName":"Kuba L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T13:26:16.000Z","updateDate":"2018-04-28T13:27:42.000Z","user":{"userId":"976713340","realm":"RT","displayName":"Kuba L","accountLink":"/user/id/976713340"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"I really want to post about this movie, but instead I am going to point out the fact that about half the critics given this movie a rotten tomatoe make statements that you could cut & paste to 98% of movies made. I truly believe they didn't bother seeing the film and took the day off. Their bosses should consider looking into that. Several I have noticed have done this on other films too, almost the same phrasing in the review.","displayName":"Clint R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T13:26:05.000Z","updateDate":"2018-04-28T13:28:35.000Z","user":{"userId":"918702614","realm":"RT","displayName":"Clint R","accountLink":"/user/id/918702614"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Fantastic to see the whole team.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1669328449847505/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T13:25:59.000Z","updateDate":"2018-04-28T13:29:00.000Z","user":{"userId":"977246404","realm":"RT","displayName":null,"accountLink":"/user/id/977246404"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Everything I was expecting and more!","displayName":"Kirk S","displayImageUrl":"https://graph.facebook.com/v3.3/1318511874/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T13:25:22.000Z","updateDate":"2018-04-28T13:26:19.000Z","user":{"userId":"866695202","realm":"RT","displayName":"Kirk S","accountLink":"/user/id/866695202"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4","review":"10 years I have waited for this movie and it did nNOT disappoint!  Fully developed story line, plot and characters make this a very fun movie to watch!","displayName":"Giovanni F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T13:22:39.000Z","updateDate":"2018-04-28T13:25:09.000Z","user":{"userId":"975732473","realm":"RT","displayName":"Giovanni F","accountLink":"/user/id/975732473"},"score":4,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4","review":"Very exciting with some great, powerfully emotional moments. Which are unfortunately undercut by the whole \"franchise\" of it all.","displayName":"Daniel D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T13:19:24.000Z","updateDate":"2018-06-28T23:30:04.000Z","user":{"userId":"910073095","realm":"RT","displayName":"Daniel D","accountLink":"/user/id/910073095"},"score":4,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Best Marvel movie! Action packed from beginning to end.  The story was greatly split from character to character.  Storytelling was awesome.","displayName":"Marvin C","displayImageUrl":"https://graph.facebook.com/v3.3/1832354765/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T13:18:54.000Z","updateDate":"2018-04-28T13:21:01.000Z","user":{"userId":"871392387","realm":"RT","displayName":"Marvin C","accountLink":"/user/id/871392387"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_5","review":"Absolutely phenomenal. Everything about this movie made it incredible. The ending is very bold and they made it work out perfectly. Anyone who didn’t like it either hasn’t read the comics or is watching this movie before all the other movies in the MCU. Of course if you don’t know a back story behind what’s going on it’s confusing. But since I’ve read the comics and seen all the movies in the MCU I thoroughly enjoyed it!!! Incredible and shocking ending!!! ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T13:18:11.962Z","updateDate":"2018-05-12T04:41:56.431Z","user":{"userId":"260005581","realm":"RT","displayName":null,"accountLink":"/user/id/260005581"},"score":5,"timeFromCreation":"Apr 28, 2018"},{"rating":"STAR_4_5","review":"Blasting, breath-taking and titanic, the first step in the culmination of the MCU's era delivers what a crossover of this magnitude should; fantastic and enjoyable chemistry between new and familiar faces, as well as stylish and exhilarating action and grandeur-yet-emotionally powerful moments, most of them succeeding thanks to Josh Brolin's intimidating and haunting presence, all in all compensating for an overly-exciting but exhaustive conclusion.","displayName":"Jose Miguel G","displayImageUrl":"https://graph.facebook.com/v3.3/741244269/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-28T13:15:42.000Z","updateDate":"2018-04-28T13:16:09.000Z","user":{"userId":"880002446","realm":"RT","displayName":"Jose Miguel G","accountLink":"/user/id/880002446"},"score":4.5,"timeFromCreation":"Apr 28, 2018"}]}