{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAxMTIxMTciLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDctMTZUMTI6MzU6MDcuMzc5WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzczNjM1MDEiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDctMThUMDE6MTc6MjAifQ=="},"reviews":[{"rating":"STAR_5","review":"This movie had to be 10 times as good as The Godfather to live up to th hype. But it shattered my expectations. That movie was awesome.","displayName":"Davit D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-18T01:17:20.000Z","updateDate":"2018-07-19T23:23:31.000Z","user":{"userId":"977363501","realm":"RT","displayName":"Davit D","accountLink":"/user/id/977363501"},"score":5,"timeFromCreation":"Jul 18, 2018"},{"rating":"STAR_3_5","review":"Leaves us wanting more which gives means it captures our attention and which also means we were invested however compared to other movies similar we seen better.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-17T16:44:53.659Z","updateDate":"2018-07-17T16:44:53.659Z","user":{"userId":"260165288","realm":"RT","displayName":null,"accountLink":"/user/id/260165288"},"score":3.5,"timeFromCreation":"Jul 17, 2018"},{"rating":"STAR_5","review":"I have no words for how good his movie is it’s a must see !!!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-17T14:26:05.061Z","updateDate":"2018-07-17T14:26:05.061Z","user":{"userId":"260165262","realm":"RT","displayName":null,"accountLink":"/user/id/260165262"},"score":5,"timeFromCreation":"Jul 17, 2018"},{"rating":"STAR_2","review":"Possibly the most hyped movie of the year, Avengers Infinity War, directed by the Russo brothers, falls significantly short of any preformed standards that I had. Based on many critic reviews and even remarks from close friends of mine, I went into the movie expecting a riveting and emotional experience, one which would make all of the \"Mr. Stark, I don't feel so good,\" memes make sense. However, the latest installment of the Avengers not only fails to keep me entertained, but also made me wonder what the annoying kid sitting two seats to the right was saying to his dad. In short, Avengers Infinity War is pure fan-fodder. It is a plot driven movie which has so many holes that it aggravated my trypophobia.\n\nThe greatest pitfall of this movie is it's scale. Think Lord of the Rings, but with many more characters and locations. It's so unfathomably large, that I found myself struggling to remember earlier parts of the movie. Without spoiling anything, there are basically four units in this movie. There's the Strange, Stark, and Parker alliance, the Cap, Bucky, Vision, that weird witch, Scarlett Johansson, Silver Iron Man, dude with wings, and all of Wakanda buffet, the Thor, Rocket, and Adolescent Groot team, and the fat Star Lord, Gamora, Drax, and Mantis sidekicks. Some of these teams meld together in the third act, but when all the characters are laid out like this, (and I'm sure I still missed some), it's easy to see how a movie can get lost in it's own size. \n\nGreat movies are character based. Yes, even superhero movies. Logan, Deadpool (I and II), and Iron Man are great examples of this. In all of those movies, and some other Marvel gems, the characters drive the plot. You become invested in a character and their beliefs, and are consequently torn when the character goes through hardship. Avengers Infinity War is a movie where the plot drives the characters. It seems that things are happening, and that our heroes are simply rushing from one point to another arbitrarily, with no motivation other than \"This is the next place we need to go\". Again, without spoiling anything, there are a lot of deaths at the end of this movie, but without the emotional undertones of a character based movie, none of these deaths had any lasting impact on me. Instead of being critical changes in the MCU that affected my life, they were simply... things that happened.\n\nAnother tragedy of this movie occurs in its fights. They lack intelligence, and while they are very good eye candy (I noted fewer cuts this time around), they all boil down to simple fisticuffs, which gets boring after the thousandth time. Not only that, but most of the fights use villians which are no more than MacGuffins, who I've never seen in any Marvel movie before (at least to my recollection), and whose powers are completely arbitrary. These \"Children of Thanos\" lack any development, and are thus nothing more than fist fodder for our heroes. And speaking of fist fodder, Avengers Infinity War falls into another great trap: CGI armies. Once again, for what seems like the millionth time, Avengers Infinity War treats us to a no stakes, high octane fight between our heroes and a mass of CGI... dogs? Weird creatures with big scary teeth that look all mean so that we... get scared of them, I guess. It's as bad as it sounds, and to make matters worse, this fight adds less than nothing to the story! It's just an addition designed to kill time until Thanos completes his section of the story.\n\nBut possibly the most confusing and head scratching part of this movie is almost constant. It's the motivation of the villian. This shouldn't be a spoiler to anyone who isn't a complete luddite, but Thanos' reason for ending half of all life is fairly straightforward. There are a finite number of resources for a rapidly accelerating population. Thus in order to keep resources plentiful, Thanos must wield the Infinity Stones in a sparkly glove to half all life. This falls apart on a moment's thought. If Thanos wants to half all life, and many resources are living, then what, exactly is he accomplishing? \n\nThink of it this way. Cows are a resource to humans, but they are also living. Do they get halved? And because we live in a complex ecosystem with a multileveled food chain, everything is a resource, or potential resource, to everything else. Assuming that all alien planets obey this simply evolutionary fact, all Thanos is doing by halving life is cutting everything in half. He's not solving the problem of overpopulation at all.\n\nThere are many other things wrong with Thanos, the least of which being his cartoonish rubbery body, but the greatest weakness of Thanos' character is his lack of structure. He is portrayed as a mastermind, the man behind the curtain, if you will. We are reminded in this movie that he was behind the central conflict in the Avengers. But that's the problem; we need to be reminded of that. The Avengers came out six years ago, and this movie makes you feel stupid for not remembering something only a fifteen year old Marvel uber-fan could remember.  Thanos feels very derivative in this movie, being evil just for evil's sake (I mean, why couldn't he just double resources?). He is shown to be somewhat remorseful, but much of the weight is taken off of those moments by his hulking appearance and silly putty look.\n\nBut all in all, this movie is still alright to this point. We have a villian trying to do a thing, and heroes trying to stop him. That's the foundations of a movie if I've ever seen some. But where this movie really derails is in the heroes powers. It seems like all of this movies problems could be solved by Dr. Strange, who could just banish Thanos to some other dimension, or stick him in an infinite time loop like he did with Dormammu. Instead, we're force-fed another hour of fisticuffs. The movie also makes it seem like Scarlett Johansson and Cap matter. One has the power of gymnastics and the other has been on steroids for the past hundred years. How are they in any way relevant, when that eastern european witch has literal magic? It's all very rushed, and the result is that the movie makes no sense.\n\nThere are so many things wrong with Avengers Infinity War that I simply don't have time for here. For example, Vision is boxed into an emotional corner and spends the entire movie getting his butt kicked, red witch never feels truly powerful, aliens all measuring time in the same increments, Groot being very unfunny, some characters dying instantly while others get a few lines, and the entire movie being so fast paced that it sacrifices any chance for an emotional moment. From a bad villain with confusing intentions to a supersized cast of heroes this movie misses nearly all the cylinders. The best thing that I can say about it is that it looks pretty good. But other than that, I was completely underwhelmed by this movie, to the point that I'm actually sad. Not because of any of the deaths, but because of the fact that I just spent three hours of my life watching uncoordinated colors fly across the screen.\n\nVerdict: Wait till it comes out on Netflix or Redbox if you're not an uber fan, and if you are an uber fan, then you already stopped reading after I said the movie was bad.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1049393235211046/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-17T11:36:46.000Z","updateDate":"2018-07-17T11:37:14.000Z","user":{"userId":"977365873","realm":"RT","displayName":null,"accountLink":"/user/id/977365873"},"score":2,"timeFromCreation":"Jul 17, 2018"},{"rating":"STAR_5","review":"This movie really surprised me. With how disappointed I've been with movies lately, I did not go in with high expectations. But infinity war blew me away. The actually storyline isn't the best, but it's got a great villain with interesting motivations. All the protagonists sharing the screen works so well! Every character is written with respect to their development and growth in the other films. This really is the culmination of all these marvel stories and it was amazing!","displayName":"Alexander M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-17T10:56:04.000Z","updateDate":"2018-07-17T11:01:07.000Z","user":{"userId":"977108876","realm":"RT","displayName":"Alexander M","accountLink":"/user/id/977108876"},"score":5,"timeFromCreation":"Jul 17, 2018"},{"rating":"STAR_5","review":"Great fun.\n\nHard to take so many character deaths seriously.   Too many to see that lasting.","displayName":"Chris T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-17T09:29:05.000Z","updateDate":"2018-07-17T09:29:39.000Z","user":{"userId":"977365704","realm":"RT","displayName":"Chris T","accountLink":"/user/id/977365704"},"score":5,"timeFromCreation":"Jul 17, 2018"},{"rating":"STAR_4","review":"can't wait on the next on...","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-16T19:59:05.495Z","updateDate":"2018-07-16T19:59:05.495Z","user":{"userId":"260080165","realm":"RT","displayName":null,"accountLink":"/user/id/260080165"},"score":4,"timeFromCreation":"Jul 16, 2018"},{"rating":"STAR_4_5","review":"I didn’t mind the lack of character focus in this one, as much hyped/commented. Enjoyed being warped through loads of story to a decent point where I really want to see A4/IW II.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-16T19:51:35.091Z","updateDate":"2018-07-16T19:51:35.091Z","user":{"userId":"924186409","realm":"RT","displayName":null,"accountLink":"/user/id/924186409"},"score":4.5,"timeFromCreation":"Jul 16, 2018"},{"rating":"STAR_5","review":"Pochoclera a morir, muy buena historia y ningún personaje tiene tiempo de mas o de menos en la pantalla, a pesar de la cantidad de heroes. Esperamos a Ant Man, el halcon y sobre todo, la capitana marvel, para hacer su aparicion.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10217036798450738/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-16T17:05:42.000Z","updateDate":"2018-07-16T17:07:28.000Z","user":{"userId":"977364708","realm":"RT","displayName":null,"accountLink":"/user/id/977364708"},"score":5,"timeFromCreation":"Jul 16, 2018"},{"rating":"STAR_3_5","review":"Spoilers :It is a good movie and the action scenes are good but there are way to many characters and I don’t understand why they let all the 50 year old or over actors live and all the young people die","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-07-16T12:35:07.379Z","updateDate":"2018-07-16T12:35:07.379Z","user":{"userId":"260112117","realm":"RT","displayName":null,"accountLink":"/user/id/260112117"},"score":3.5,"timeFromCreation":"Jul 16, 2018"}]}