{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzUyMDAwMzIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDhUMjI6NDE6NTEuMjE2WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAxMjk0NzgiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMDlUMDE6MTU6NTEuMDAyWiJ9"},"reviews":[{"rating":"STAR_0_5","review":"Honestly just another formulaic Marvel crap show! Honestly, DC has the guts to actually try something different! This movie has way to many characters and just tries to throw a ton of drama where there should not be any. Recommend that this movie should be tossed into the blender along with all the other Marvel crap shows!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-09T01:15:51.002Z","updateDate":"2018-05-09T22:08:20.243Z","user":{"userId":"260129478","realm":"RT","displayName":null,"accountLink":"/user/id/260129478"},"score":0.5,"timeFromCreation":"May 09, 2018"},{"rating":"STAR_5","review":"Best marvel movie they’ve made. Enjoyed every minute of it ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-09T00:36:50.360Z","updateDate":"2018-05-09T00:36:50.360Z","user":{"userId":"966555949","realm":"RT","displayName":null,"accountLink":"/user/id/966555949"},"score":5,"timeFromCreation":"May 09, 2018"},{"rating":"STAR_1_5","review":"It felt like I was watching justice league movie with more action and once again useless comedy you don't know reason thanos wants stones in justice league Stepenwolf you know reason he wants mother boxes movie is OVERHYPED just like black panther and Logan","displayName":"bat p","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-09T00:35:40.000Z","updateDate":"2018-05-09T00:37:10.000Z","user":{"userId":"843286300","realm":"RT","displayName":"bat p","accountLink":"/user/id/843286300"},"score":1.5,"timeFromCreation":"May 09, 2018"},{"rating":"STAR_4_5","review":"Bloody brilliant, devastating but brilliant.","displayName":"Michelle M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-09T00:25:05.000Z","updateDate":"2018-05-09T00:28:58.000Z","user":{"userId":"977262237","realm":"RT","displayName":"Michelle M","accountLink":"/user/id/977262237"},"score":4.5,"timeFromCreation":"May 09, 2018"},{"rating":"STAR_5","review":"Action packed, suspenseful and not like any other Superhero movie. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-08T23:57:19.583Z","updateDate":"2018-05-08T23:57:19.583Z","user":{"userId":"260105669","realm":"RT","displayName":null,"accountLink":"/user/id/260105669"},"score":5,"timeFromCreation":"May 08, 2018"},{"rating":"STAR_5","review":"this movie is dark and it owns thanos is here and he is coming for the stones and thereby the fate of half of the universe is on the hands of the avengers and i feels like it though this movie isnt perfect its damn near what i would call the perfect movie for me this is by far my favourite marvel movie and at the end i was shook the comedy was great fun for me only problem i had with it was it sometimes was too close to some of the more serious scenes which would ruin it a bit but in general it worked if you like marvel movies you absolutely have to see Infinity war.","displayName":"Marius L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-08T23:47:31.000Z","updateDate":"2018-05-08T23:49:44.000Z","user":{"userId":"977262216","realm":"RT","displayName":"Marius L","accountLink":"/user/id/977262216"},"score":5,"timeFromCreation":"May 08, 2018"},{"rating":"STAR_5","review":"Way better than Star Wars: The Last Jedi. Waaaaay better. Saw it 3 times already and plan to see it more. Disney please hire those who had any part in creating this movie to make your future Star Wars movies. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-08T23:27:52.075Z","updateDate":"2018-05-08T23:27:52.075Z","user":{"userId":"260028329","realm":"RT","displayName":null,"accountLink":"/user/id/260028329"},"score":5,"timeFromCreation":"May 08, 2018"},{"rating":"STAR_5","review":"In my opinion, it is the best of the mcu. It is able to take so many characters on so many different and exciting adventures. Thanos is also my favourite villain as he shows a human side towards the end.","displayName":"Jack R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-08T23:08:50.000Z","updateDate":"2018-05-08T23:11:22.000Z","user":{"userId":"976940020","realm":"RT","displayName":"Jack R","accountLink":"/user/id/976940020"},"score":5,"timeFromCreation":"May 08, 2018"},{"rating":"STAR_4","review":"?S P O I LE R S.\nseriously, don't read if you haven't watched Avengers: Infinity War\n\nstill here? okay. don't say i didn't warn you.\n\nThis was ... Confusing. At first I had no idea what to rate it, because it was enjoyable but mostly just fucking confusing, because what were the Russo brothers/Markus + McFeely trying to do? Having now considered the contrast between MCU! and Comic!Thanos, the long-awaited large-scale crossover and the inkling that this film could have been much more apropriately titled, I think I'm in a better place to evaluate the film.\n\nOverall, I liked it. But I feel less positively about it than I usually am about Marvel films, given that I'm basically a Marvel apologist. This is because the 'feel' of IW is distinct from OG Avengers, for reasons that are entirely justified. As such, while you might come out of the cinema feeling bemused (as I did), that might soon turn into a different kind of MCU appreciation. IW isn't the kind of movie I'd like to see come out of the MCU regularly, but it was a much-needed change after AoU and CW. It also has some of MCU's best storytelling, successfully(!) bringing together plot threads from the standalone series (2 of which I still haven't watched, whoops). That in itself is a FEAT that deserves applause.\n\nI STAN:\n- Wanda: She's my Google avatar and I have a comic book of her and Vision, so she is unsurprisingly my favourite. Their explicitly canon relationship and her feats (she's LITERALLY a reality-bending witch - alright, well, not so much in the MCU - aka she has powers akin to a fucking Infinity Stone) made me fangirl whenever she was on screen\n- Doctor Strange: Definitely because I'm partial to Benjamin Cumberbund, but also because he exudes such a snarky serenity. I also love his powers, particularly his precognition (that Contessa-esque victory path though!)\n- Shuri: Yes, yes, who doesn't stan Shuri? She gets so little time to shine here, but I'm praying she's got something for Vision...\n- Hawkeye: Where the fuck is my boi?\n\nTHEMES:\n- Faith: Most notably, Doctor Strange's faith in the odds of 1 in 14 million. That kind of blind faith (though is it really blind, if you can see the future?) really encapsulates the Avengers type of hope - the idea that against all odds, everything is going to work out because you cannot risk it not working out. It's born out of equal parts (or, shall I say, balance?) desparation and strength. I don't know, I've always liked the idea of faith but the superhero brand of faith is particulary ennobling.\n\nThere's also the faith the Avengers place in each other, and a reflection of the faith the world places in the Avengers, to beat the Big Bad. Then of course, there's the faith that the audience has in  Marvel Studios to not completely shatter us. Initially, it's in our faith that Marvel can write its way out of anything; that there's no way the heroes would suffer an actual defeat. But more on that later.\n\n- Sustainability: Let me get this out there first; Thanos is crazy. I am kind of scared people will listen to his argument and think, \"Hey, that actually makes sense!\" - because his Malthusian philosophy is outdated, unethical and quite frankly just wrong. Please don't go down that path, because that path has led to some horrific mass killings in the past.\n\nHowever, having a conversation about resource use, quality of life and overpopulation is definitely something I'd like to see, so kudos to Marvel for this narrative! It's also an extension of Black Panther's worldbuilding re: Wakanda's plentiful resources and high quality of (sheltered) life.\n\n- Sacrifice: Can we be utilitarian in our ethics? Should we be? On paper, it seems like a simple thing - one life for many. I would make that trade.\n\nOr would I? There's something appealing about the idealism of Cap's claim that \"we don't trade lives\". Because if we lean utilitarian, one has to ask - is the price worth it? Where do we draw the line? It's an age-old debate that I'm not sure will ever be resolved, but it's one I enjoy grappling with regardless. On one hand, Cap is right. Deontological morality demands that you don't treat someone as a means to an end - it's not right to kill someone, even if it's to save others. It just isn't.\n\nOn the other hand, \"don't let your morals get in the way of doing what's right\". Because, on balance, let's be real. One life for the rest of the world is a pretty damn good trade. If that were really the case (which it isn't ever, but theoretically speaking) then we would be remiss NOT to take it.\n\nThing is, this doesn't mesh with traditional morality. This is echoed in Black Widow's excellent, \"she's not alone\" - traditionally, the heroic high ground has stemmed from strong bonds forged through a common cause and lots of blood. In other words, friendship is magic/NAKAMA!\n\nIn a nice subversion of what tends to be the heroes' greatest strength - love (see: the contrast between the ending of GOTG and the ending of IW) - few of them are willing to make the utilitarian sacrifice. Tony wants to bench Peter and Doctor Strange. Cap doesn't want anyone to have to make the ultimate sacrifice. Doctor Strange saves Tony and Gamora saves Nebula - both at the expense of the universe. Quill barely goes through with it, but he fails. Wanda, being the absolute badass she is, manages to go through with it WHILE fending off Thanos. Of course, that's all for nothing because Thanos has the goddamn Time Stone and brutally re-kills Vision. That was definitely the most painful moment of the film for me; the crushing realisation that this death was the worst possible death for Vision and the shot of his body turning grey. Jesus.\n\nTo be fair, I think it's harsh and/or simplistic to say that the heroes were not willing to make the same sacrifices that Thanos was. Literally all of them were willing to lay down their lives (and half of them did!), 2 of them were willing to sacrifice their SOs, and Thanos only had to make that decision once - as opposed to the 2 times the heroes were willing to choose the same. There's also the implication that Doctor Strange was being purely rational in saving Tony, knowing that THIS is the best timeline (I definitely don't want to see the darkest timeline). In general, however, it's a refreshing twist to turn a strength of being good into a weakness.\n\nVILLAINS NEVER WIN:\nThe actors were on their A-game, but this movie felt waaaay too rushed (though I think a rewatch would have me feeling differently, knowing that it's Thanos's story). I know it's already a 2-parter but I wish it were a 3-parter, almost, because there could have been much more fleshing out! The location + time skips, while fun ways to bring in the new characters (seriously, hats off to Gunn for creating SUCH a distinct GOTG style - I had to smile when I heard The Rubberband Man song), get a bit much rather quickly.\n\nHowever, my gripes with pacing are mostly because we go from Thanos having 1/2 Infinity Stones in the beginning to literally extinguishing half of the universe at the end. This means that, if I view \"Avengers: Infinity War\" as \"Thanos: Infinity War\", it makes much more sense. In the comics, the story picks up when Thanos has the Stones and is beginning his bloodbath. This is the beginning that would make more sense to me (i.e., why didn't we just start with him having 4 stones?) if this were a real Avengers movie. That way, we wouldn't need to spend so much time on setting up that ultimately feels a bit wasted, because god, that ending! But, well, it's not.\n\nIt's a Thanos movie. Just like how it's not a war at all - it's a massacre. The heroes are so clearly outclassed, and the juggling of their disparate plotlines is not so solid - but then, this movie isn't about them. It's about showing off Thanos's growth in power and character. That's why Thanos is so goddamn scary, because with each failure and barely-won battle the stakes grow ever higher and the odds ever smaller. All that time, the audience is holding onto that tenuous faith that the Avengers will come back from this, somehow. This is what makes the progression of Thanos gaining each Stone work, in hindsight, because you need to see Thanos overcoming each obstacle to fathom the very real threat the universe faces.\n\nSpeaking of, I think Thanos is Not A Bad Villain at all. His reasoning is way better than his comic persona, and his childhood trauma combines with his measured reasoning to form a fascinating saviour complex. Of course, he's also insane, narrow-minded and egotistical, but then it's all the more impressive that he can remain a sympathetic character.\n\nAlso, the slow burn is 90% of why this movie is so hype, and the vague confusion I felt when he was first introduced is such a great contrast to the anger and pity I feel for him now.\n\nRegardless, I think this could have done with fewer action scenes and cuts. And fewer random cameos, honestly - give these people some more screen time! I wouldn't mind sitting in the cinema for an extra 20 minutes (though my bladder might).\n\nOKAY, BUT WHY, THO?\nDespite all the above, I still walked out of the cinema feeling slightly confused.\n\n- WHY go through 2 hours 40 minutes just to have the protagonists fail? --> Because it's a 2-parter, which I hadn't known then\n- WHY have such drastic consequences? --> Because the comics did ... ? This is the most confusing part to me; why go down this path when the MCU has never given us loss to this extent? I suppose, however, the magnitude matches the grandeur of this amazing crossover...\n- No, but really, WHY if there aren't real stakes? --> Marvel being Marvel, and especially MCU being MCU (because comicbooks tend to be incredible at retaining tension despite having far more retcon etc. tools at their disposable), the audience is safe in their wide-eyed faith that our heroes will be coming back in the next film.\n\nAfter all, the finale will be Avengers-centric rather than Thanos-centric. There's no way, given Doctor Strange's plotting and the power of the Time Stone, that we won't see a revival of some (if not all!) of our fallen heroes.\n\nSo what's the point? Momentary shock? Or is it just part and parcel of the story? I'm not sure what the Russo brothers are getting at, but I'm along for the ride because...\n\nEven if the crossover could've been executed better (please don't bench Antman and Hawkeye), I'm surprised at how well IW lived up to the hype. The character pairings make sense and have great chemistry (Thor, rabbit and tree!), and the blend of wit and solemnity is really on-point here. To be fair,  I'm way too in love with crossovers. They're the pinnacle of the epicness unique to comicverses, and I am always down to partake in Marvel's tried-and-tested formula of humour, sentiment and explosions.\n\nTL;DR - Go see it, even if you think you'll hate it. You deserve to be part of this conversation (and to witness some of the better MCU writing, honestly).\n\nAlso, what a time to be alive! This summer is going to be LIT, what with Deadpool 2 and The Incredibles (and I still need to watch The Quiet Place, ugh) - and, I hear, Antman 2 and a Black Widow film are on the horizon! It's a good time to be into mainstream geek culture right now.\n\nLET ME TAKE A MINUTE:\nI also think the medium of film in general is amazing. Like how both horror and superhero films are traditionally vehicles for messages about current affairs. They represent our anxieties, offering both escapism and inspiration.\n\nHonestly, if I ever think that being an artist (in the broad sense) is not valuable, I need to remind myself of the part popular media plays in shaping society. We write about superheroes because we want someone more powerful to look up to, to idolise, to model ourselves after. So that one day, we might be our own heroes.","displayName":"Miranda Z","displayImageUrl":"https://graph.facebook.com/v3.3/1616601259/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-08T23:05:45.000Z","updateDate":"2018-05-08T23:10:39.000Z","user":{"userId":"864390200","realm":"RT","displayName":"Miranda Z","accountLink":"/user/id/864390200"},"score":4,"timeFromCreation":"May 08, 2018"},{"rating":"STAR_4_5","review":"Loved the movie from start to ending, and be prepared for ending as it wasn’t what we expected. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-08T22:41:51.216Z","updateDate":"2018-05-08T22:41:51.216Z","user":{"userId":"975200032","realm":"RT","displayName":null,"accountLink":"/user/id/975200032"},"score":4.5,"timeFromCreation":"May 08, 2018"}]}