{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzc2Nzk2MDYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMTItMjNUMTc6NTk6MjkifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAyMjc0MjUiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMTItMjZUMDA6MjE6MjAuNTkyWiJ9"},"reviews":[{"rating":"STAR_0_5","review":"This was just 2 hrs of cgi filled with bad performances . What the heck ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-26T00:21:20.592Z","updateDate":"2018-12-26T00:21:28.009Z","user":{"userId":"260227425","realm":"RT","displayName":null,"accountLink":"/user/id/260227425"},"score":0.5,"timeFromCreation":"Dec 26, 2018"},{"rating":"STAR_0_5","review":"Absolutely boring and poorly structured with terrible performances ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-26T00:19:26.587Z","updateDate":"2018-12-26T00:19:26.587Z","user":{"userId":"260227449","realm":"RT","displayName":null,"accountLink":"/user/id/260227449"},"score":0.5,"timeFromCreation":"Dec 26, 2018"},{"rating":"STAR_2_5","review":"More from the makers of the Avengers. Is there any room for films with a good and solid narrative anymore is it all just FX and explosions. An OK watch. Now we have to wait for the next one to find out what happens. Let's have these types of films but not at the exclusion of other narratives. Give me Red Dog over this any day.","displayName":"T K  E","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-25T20:53:19.000Z","updateDate":"2018-12-25T20:55:27.000Z","user":{"userId":"974911045","realm":"RT","displayName":"T K  E","accountLink":"/user/id/974911045"},"score":2.5,"timeFromCreation":"Dec 25, 2018"},{"rating":"STAR_0_5","review":"Dumb movie.  It looks like they are running out of stories for these characters.  The best team-up movies are the X-Men.","displayName":"Hoby C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-25T08:56:54.000Z","updateDate":"2018-12-25T08:57:06.000Z","user":{"userId":"976861633","realm":"RT","displayName":"Hoby C","accountLink":"/user/id/976861633"},"score":0.5,"timeFromCreation":"Dec 25, 2018"},{"rating":"STAR_0_5","review":"Waste of my money.  What a crappy ending.","displayName":"Dylan C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-25T07:15:24.000Z","updateDate":"2018-12-25T07:15:48.000Z","user":{"userId":"977682746","realm":"RT","displayName":"Dylan C","accountLink":"/user/id/977682746"},"score":0.5,"timeFromCreation":"Dec 25, 2018"},{"rating":"STAR_5","review":"Great movie and action.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-24T17:43:41.945Z","updateDate":"2018-12-24T17:43:41.945Z","user":{"userId":"975027668","realm":"RT","displayName":null,"accountLink":"/user/id/975027668"},"score":5,"timeFromCreation":"Dec 24, 2018"},{"rating":"STAR_4","review":"The culmination of the world building of the events from previous films sets up this massive epic. A massive powerful villain forces a huge ensemble of superheroes to team up to fight this new threat. His power is immediately felt when we discover how he was able to so easily destroy half of a world and his justification is even more disturbing but grounded in reality. There is a very real concern Earth is overpopulated and the resources will not be enough to sustain the world's population. That is neither here or there as we have found creative solutions to expand the food supply.\n\nThanos envisions himself as the solution to those problems. His view is he can be a hero by destroying half of the population in a world and the survivors will be able to enjoy the resources because they will not be taxed beyond their limits. He sees the suffering the people mentioning starving children and disease as part of the effects of an overpopulated world. The problem is Thanos only sees the solution to this issue as destroying a population instead of examining a realm of possibilities.\n\nHowever, his thought process is one of the most interesting and compelling reasons for a villain to exist. Most times, their purpose is unclear and they are just kind of there especially in a Marvel movie. Typically, the villain is not up to task and presented as all powerful but not really believable in this manner. Thanos is given much more time to develop and we are all the better for it with the most compelling bad guy in this universe. Josh Brolin infuses the role with genuine pathos and you actually do care about this character.\n\nThere is a poetic beauty about the way he speaks and he is so philosophical where his crazy ideas almost sound reasonable. Of course, there is no reason for his destruction and he does not consider how the devastation affects a population. His character plays well as one you would expect a whole team of superheroes would struggle to take down. He has the perfect combination of smarts, strength, and knowledge combining to make him an unstoppable force. This is largely Thanos' journey to gain the Infinity stones so he can carry out his vision of a different world.\n\nWe experience heartbreak and a lot less joking around typical from this company. The refreshing part is the filmmakers give weight to this story and do not rely solely on humor dispensed a mile a minute. This is one of the more serious movies in the shared universe to date deciding to allow the audience to breathe in the full repercussions of Thanos' decisions. This will fully be explored in the next film. I am interested to see how they address Thanos.\n\nPacing is the only real problem where the movie takes a while to find its feet. The first hour is largely dedicated to showing each of the superheroes in their state of personal sacrifice embodying the hero qualities we all love. The fighting scenes they engage in are spectacular but the film gets bogged down early on reminding us the vastness of the Thanos threat. This early part of the movie could be pared down to streamline the narrative. The intelligence of the audience could be trusted a little more to see the very real threat coming to this world.\n\nOnce the film gets going, there is hardly a moment to catch your breath and you are waiting with anticipation to see what will unfold. There is a sense of finality with this film perhaps being one of the last films of this phase. There is a lack of joy in this picture but it allows this massive ensemble to stand out from the other cutesy films. A real villain with a complexity rarely explored makes me want to see more of Thanos. An emotional depth and appropriate screen time to each character combines to build a very satisfying picture. Emotional payoff is given in spades here and I am truly excited to see what is in store for the next film.","displayName":"John M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-24T17:18:37.000Z","updateDate":"2018-12-24T17:19:39.000Z","user":{"userId":"977099552","realm":"RT","displayName":"John M","accountLink":"/user/id/977099552"},"score":4,"timeFromCreation":"Dec 24, 2018"},{"rating":"STAR_0_5","review":"The worst marvel movie of all times, I had to make a rotten tomato account just to rate it and this is my first rating as you can see how disappointed I am. The movie has too many jokes and takes away the whole them but they did a great JOB ON THE VENOM ...","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/201374887480191/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-24T10:30:02.000Z","updateDate":"2018-12-24T10:34:15.000Z","user":{"userId":"977681158","realm":"RT","displayName":null,"accountLink":"/user/id/977681158"},"score":0.5,"timeFromCreation":"Dec 24, 2018"},{"rating":"STAR_4","review":"An amazing movie overall with some great shots and a lot of character development for characters like black panther and especially Thor. However some characters get lost in the shuffle like falcon and bucky, and that's my big issue with avengers, too many characters, and even though the russos try to balance scenes and give every actor equal screen time, the overall product feels quite disjointed and all over the place.","displayName":"Josh W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-24T07:49:48.000Z","updateDate":"2018-12-24T07:52:14.000Z","user":{"userId":"977679294","realm":"RT","displayName":"Josh W","accountLink":"/user/id/977679294"},"score":4,"timeFromCreation":"Dec 24, 2018"},{"rating":"STAR_5","review":"This movie is so incredible.Marvel did it again","displayName":"Valeria C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-23T17:59:29.000Z","updateDate":"2018-12-23T18:01:03.000Z","user":{"userId":"977679606","realm":"RT","displayName":"Valeria C","accountLink":"/user/id/977679606"},"score":5,"timeFromCreation":"Dec 23, 2018"}]}