{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NDQwOTkzNzciLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMTItMjZUMDg6MTQ6MTgifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzc2ODg0ODEiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMTItMjdUMDg6MDY6MDIifQ=="},"reviews":[{"rating":"STAR_5","review":"Most anticipated movie in years.  Live up to anticipation.","displayName":"Ken B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-27T08:06:02.000Z","updateDate":"2018-12-27T08:06:28.000Z","user":{"userId":"977688481","realm":"RT","displayName":"Ken B","accountLink":"/user/id/977688481"},"score":5,"timeFromCreation":"Dec 27, 2018"},{"rating":"STAR_4_5","review":"Infinity War has all the new characters without feeling over-bloated, a surprising change of stakes, and a villain for the movie history books","displayName":"Haven W","displayImageUrl":"https://graph.facebook.com/v3.3/886455590/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-27T07:42:47.000Z","updateDate":"2018-12-27T07:50:55.000Z","user":{"userId":"794718117","realm":"RT","displayName":"Haven W","accountLink":"/user/id/794718117"},"score":4.5,"timeFromCreation":"Dec 27, 2018"},{"rating":"STAR_4","review":"This latest instalment in the Avengers succeeds in bringing together a complex array of heroes to dazzle the audience with an emotional and abrupt finish.","displayName":"Michael C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-27T06:34:21.000Z","updateDate":"2018-12-27T06:34:28.000Z","user":{"userId":"970179561","realm":"RT","displayName":"Michael C","accountLink":"/user/id/970179561"},"score":4,"timeFromCreation":"Dec 27, 2018"},{"rating":"STAR_0_5","review":"There must be some serious numbers of comic book nerds voting this up highly.....because this film's plot is weak, the ending even weaker, and generally speaking most of the movie is a repeat of one marvel character saying hi to another. Total waste of a couple of hours and not even in a good way like a no-brainer action movie.","displayName":"John S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-27T04:17:54.000Z","updateDate":"2018-12-27T04:22:55.000Z","user":{"userId":"977599618","realm":"RT","displayName":"John S","accountLink":"/user/id/977599618"},"score":0.5,"timeFromCreation":"Dec 27, 2018"},{"rating":"STAR_3_5","review":"This is an action packed movie, but it lacks character developement. I feel the movie was just one big battle. I wanted to see more suspense. The opening seen was people fighting. It lasted thr whole movie. It did not live up to my expectations","displayName":"JD R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-26T17:23:36.000Z","updateDate":"2018-12-26T17:27:33.000Z","user":{"userId":"977681415","realm":"RT","displayName":"JD R","accountLink":"/user/id/977681415"},"score":3.5,"timeFromCreation":"Dec 26, 2018"},{"rating":"STAR_4","review":"\"Andy Dwyer vs Thanos. No Leslie Knope.\" 4/5","displayName":"Lucky L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-26T17:18:30.000Z","updateDate":"2018-12-26T17:18:34.000Z","user":{"userId":"977685991","realm":"RT","displayName":"Lucky L","accountLink":"/user/id/977685991"},"score":4,"timeFromCreation":"Dec 26, 2018"},{"rating":"STAR_4","review":"It's kind of difficult to begin a review of a movie of such gargantuan scope and ambition such as this one.  I think some movie nerds, even if they admit it openly or not, come to the assumption that films within the MCU, or the larger Avengers movies (which brings a lot of the characters in this universe together in one film), are easy to make.  I suppose they come to that assumption because the film is so obviously and openly meant for the broadest possible of audiences.  They want to make sure that everyone of every age, color, race and gender finds something they like in these movies.  And, to me, I find that it is the exact opposite, I think these are the most difficult films to make.  Not saying that other, smaller movies are \"easy\" to make, I just mean that films like the Avengers have to juggle so many balls in the air that, realistically speaking, it's gonna be incredibly difficult to do just for one director and writer.  You not only have to serve the major arc of Thanos, finally, arriving (after over half a decade of constant teasing in MCU films) and attempting to complete his mission of gathering the Infinity Stones in order to obliterate half of life on earth in order for it to be 'balanced'.  But, at the same time, you have to find a way for every major character in the MCU, at least the good guys, to have a role to play and for that role to make sense within the context of the story you are trying to tell.  When you compare this film to the first two Avengers films or even something like Civil War (which was the movie that Age of Ultron should have been), in terms of scope and ambition, this movie blows them out of the water, even if I felt that Civil War, as a whole, was the better movie, which I'll get into later.  To me, the problem with Age of Ultron, the second Avengers movie, was the fact that it was the very definition of a hot mess.  It was incredibly bloated and, to me, felt like a total repeat of the first Avengers except, instead of Loki being the main villain, it was Ultron.  There was nothing really all that fresh about it and it didn't blow my mind in the slightest.  I also felt that the movie introduced new characters for the sake of introducing them, not because it actually made sense within the context of the story.  None of the new additions really stood out in any significant way.  I feel that my initial worry for this movie, when I knew that this was Marvel's biggest film yet, encompassing, probably, more than twice the major characters as Age of Ultron, was the fact that I didn't think there was a way to shove so many characters in there without the film feeling overstuffed or there not being enough time to properly showcase all of its characters.  And you could make the argument that that was the case here, as I feel that Black Panther and Wakanda, while being the place for the final major showdown, were criminally underused after the success of Black Panther (which may be the best MCU film yet) as a whole.  Regardless, with that said, Anthony/Joe Russo (directors of this film) and Christopher Markus/Stephen McFeely (screenwriters) found a way to make this gargantuan undertaking work and works about as well as anyone could have possible hoped.  I think that the smartest thing that they did was split everyone up.  That was probably the problem with Age of Ultron, everyone was together at all times and they were all fighting the same enemy, following the narrative path, that it felt like too much at times and you didn't get enough time to breathe and/or relax.  This movie, smartly, splits up the cast and they each have their own stories to explore.  Yes, everything works towards taking the fight to Thanos and stopping him from accessing the final Infinity Stones he needs in order to obliterate planets with a snap of his fingers, but you explore Vision and Wanda's relationship, as an example, and this helps a lot, because Wanda and Vision were unessential characters in previous films.  Vision has one of the Stones implanted in his head, so Thanos needs him.  In fact, Vision's stone is the last one that Thanos collects.  So Thanos needs Vision alive, as the good guys attempt to find a way to destroy the Stone so Thanos can't access it.  Regardless, I did like Vision and Wanda more in this movie.  Thor is off on his own with Rocket Raccoo and Groot in order to forge this axe that will, hopefully, help them defeat Thanos.  Thor is also dealing with survivors' guilt as, of the Asgardians, he is the only one to have survived.  The Guardians of the Galaxy are on Gamora's trail after Thanos takes her in order to gather the Soul Stone, as she knows where it's located.  Iron Man, Dr. Strange and Spider-Man take the fight to Thanos' planet, Titan, where they hope to stop him there (Strange also possesses one of the Stones, the time stone which, of course, lets him control time).  Captain America, Black Widow, Falcon, Banner and Winter Soldier are off in their own.  They help plot the plan to remove the stone from Vision with the Wakandans' help.  I don't know if I missed anybody, but the point I'm trying to make is that all of the characters are spread out, so scenes have a lot more time to breathe.  You can jump from story to story without the movie feeling like it's becoming too much at one time.  With that said, however, the fact that this is Marvel's biggest undertaking yet, means that some major heroes are gonna die.  I think they made a really smart choice in ***MAJOR SPOILERS*** killing off Loki in less than 10 minutes.  That's how you know they're not fucking around.  That's been the problem, to me, in a lot of these MCU films, a lot of what happens feels inconsequential.  Not that they're bad movies or anything of the sort, it's just that, if anyone dies, it's a secondary character not essential to the plot or the villain him/herself.  So for this movie to not feel like another run-of-the-mill 'villain of the week' film like most MCU entries, they did have to kill off some really major character.  In fact I think that, by the end of the movie, if my math is correct, something like SEVENTEEN major characters died (and Vision actually dies twice, once by Wanda's hand, at Vision's behest, and the other by Thanos, after he rewinds time to remove Vision's Stone).  I believe three others died in the second Ant-Man movie, so that's 20 major characters killed off by Thanos.  Thanos, almost by default really, is the best villain the MCU, bar none.  And I don't mean that because he's actually the first villain to ever, you know, actually win instead of the good guys, but I do think that he is an incredible presence, wonderfully performed by Josh Brolin.  What I like about Thanos is that, in his own mind, he feels like he's doing the right thing.  He's bringing order to the universe by wiping out half of all life on every planet he visits.  Overpopulation has lead to hunger and, in his own way, he does this so the planet itself can prosper and not slowly drag itself into extinction.  I suppose you could make the case that every villain in the MCU feels like what they're doing is the right thing, but I don't think they've ever done it as skillfully as they have with Thanos.  You don't agree with Thanos, of course, but he rationalizes his reasoning better than most villains would.  And, like I said, he's got an intimidating presence, the CG work for Thanos is tremendous (through the use of motion capture).  I love Brolin in this movie because there's something that he adjusts about his voice that gives Thanos a lot of strength and power.  He's not a character that needs to yell to get his point across or to be threatening.  He's got a very subdued manner of speaking and, I don't know, but I thought that Thanos, in my opinion, lived up to the hype as a villain.  But, of course, this being a Marvel movie, it isn't all doom and gloom.  I mean, yes, billions of people on earth are at risk of being killed by Thanos, but I think Marvel understands that you also need to have some comedy to liven things up.  I don't think this is as funny as a film like, say, Deadpool (1 and 2), but it's a very entertaining movie.  Drax, who has probably grown to be my favorite character in this entire universe, has THE best line in this movie and, quite possibly, the entire MCU.  Dave Bautista has, honestly, been a really fucking pleasant surprise to watch as Drax.  His comedic timing and delivery is impeccable.  I wish I could go over everyone in this movie, but there's way too many people to go over.  Just know that, as always, since a lot of these people have been playing these characters for more than six years, everyone is great here with no real discernible weak links, to me at least.  In short, the movie is just an absolute fucking blast to watch.  It manages to fulfill every expectation I could have expected.  Having said that, and this is referring to a point I made earlier when I said that I said Civil War was still better than this.  The reason I mention that is because this really feels like they went the route of  Harry Potter and the Deathly Hallows, they divided it up into two parts, because there was too much story to tell.  And I don't blame them for that, why get just one multi-billion dollar movie out of it when you can get two.  With that said, however, this still feels very much like an incomplete movie.  The next movie Endgame, which comes out in less than four months, is gonna complete this story.  That doesn't mean that this doesn't stand on its own merits and the bad guy finally wins, for once, and that's a big thing for this universe.  It still feels very much like half of a movie that it is.  It gets you pumped and excited for Endgame, for sure, but it's still an incomplete experience.  That's why I don't feel comfortable giving this a higher rating than four stars (which is still fucking great, mind you).  Civil War felt like it was a complete story, a story that had repercussions that were felt in THIS movie.  I don't know if, by the end of Endgame, the repercussions of Thanos' actions will be felt, given the fact that the time stone can, basically, prevent this from ever happening.  Don't get me wrong, it's still a pretty damn fucking great movie, it's just not an amazing one.  I really don't know what else to say about this, just that the impossible was done and they managed to make a movie that correctly used every major character in the MCU without feeling like it's shoving 10 hours of content into 150 minute time-frame.  You know how difficult that actually is to pull off?  The movie is thrilling, the action is top-notch (the climactic battle in Wakanda is fantastic) and the scripting is great  That's it's half of one five-hour movie aside, I had a fucking blast watching this and if you've been keeping up with this universe, you'd be doing yourself a disservice to not watch this.  Would easily recommended.","displayName":"Jesse O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":true,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-26T15:45:09.000Z","updateDate":"2018-12-26T15:47:55.000Z","user":{"userId":"1202249","realm":"RT","displayName":"Jesse O","accountLink":"/user/id/1202249"},"score":4,"timeFromCreation":"Dec 26, 2018"},{"rating":"STAR_5","review":"Rating: 96. The biggest blockbuster I have ever seen in my life. I loved it, from the laughter and happiness, too the drama and loss just make me prefer it even more than Black Panther. Avengers 3 also has one of the biggest cliffhangers since the Empire Strikes Back.","displayName":"Miller R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-26T15:37:50.000Z","updateDate":"2018-12-31T19:18:58.000Z","user":{"userId":"977686553","realm":"RT","displayName":"Miller R","accountLink":"/user/id/977686553"},"score":5,"timeFromCreation":"Dec 26, 2018"},{"rating":"STAR_4_5","review":"93\nNeatly balancing strong characters with an empathetic villain at the center, Avengers: Infinity War marks another thrilling and visually delightful achievement for Marvel Studios, and for the comic book film genre.","displayName":"Emod L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-26T09:49:12.000Z","updateDate":"2018-12-26T09:53:08.000Z","user":{"userId":"966559778","realm":"RT","displayName":"Emod L","accountLink":"/user/id/966559778"},"score":4.5,"timeFromCreation":"Dec 26, 2018"},{"rating":"STAR_1","review":"so it's just everyone against all the enemies with no real problems, and no real solution.  Half way through this movie I had the distinct thought that \"This is the last superhero movie you will ever see.\"  And a year later it's still true.  Seeing this film was like the ruining effect we all suffered the first time we bought a large-capacity ipod.  We were drowning in music, and couldn't listen to anything.  We're drowning in these silly superheroes, and these silly superhero mashups, and can't watch anything.","displayName":"Matt G","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-26T08:14:18.000Z","updateDate":"2018-12-26T08:17:05.000Z","user":{"userId":"944099377","realm":"RT","displayName":"Matt G","accountLink":"/user/id/944099377"},"score":1,"timeFromCreation":"Dec 26, 2018"}]}