{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MTQ1MjQxODIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjVUMDA6Mjk6MzEifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwMDIxNTIiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjVUMDE6MDM6MDcuMjE1WiJ9"},"reviews":[{"rating":"STAR_5","review":"Best marvel movie period ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T01:03:07.215Z","updateDate":"2018-05-20T10:22:43.516Z","user":{"userId":"260002152","realm":"RT","displayName":null,"accountLink":"/user/id/260002152"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_4_5","review":"Its a lot of fun sprawling lots of planets and landscapes. My young son cheered when Captain America first appeared and got in the action. This is not a movie that is to be taken to seriously, just enjoy the action and humor. it is a worthy way to spend an afternoon or evening.","displayName":"Parrhesia P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T01:02:30.000Z","updateDate":"2018-04-25T02:19:00.000Z","user":{"userId":"977236945","realm":"RT","displayName":"Parrhesia P","accountLink":"/user/id/977236945"},"score":4.5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"Amazing. So enjoyable, bucks trends of many Marvel movies. Interesting consequences for actions. Many characters get screen time effectively. Song of the fight scenes are long but the movie is still satisfying. Musical score is on point.","displayName":"Lachlan L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T00:51:40.000Z","updateDate":"2018-04-25T00:54:07.000Z","user":{"userId":"976197817","realm":"RT","displayName":"Lachlan L","accountLink":"/user/id/976197817"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"A behemoth of a film, a colossal 10 year in the making achievement, filled to the brim with humor, action, and first the first time in the whole series, real stakes and pathos. This movie will shatter your expectations, if you think you are ready, you are not. WOW, and after SO much thought about this movie last night, I’ve concluded it is the perfect comic book movie.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T00:50:37.706Z","updateDate":"2018-08-04T03:03:04.212Z","user":{"userId":"260013369","realm":"RT","displayName":null,"accountLink":"/user/id/260013369"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"It must have nearly impossible to pull off packing this much into a movie while doing it well and keeping a narrative thread. But they certainly succeed. Great work all around.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T00:48:42.005Z","updateDate":"2018-04-29T03:52:06.499Z","user":{"userId":"954265008","realm":"RT","displayName":null,"accountLink":"/user/id/954265008"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"Loved every part of it. Nonstop action from beginning to end!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T00:47:27.089Z","updateDate":"2018-06-24T13:05:15.528Z","user":{"userId":"260074091","realm":"RT","displayName":null,"accountLink":"/user/id/260074091"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_3_5","review":"Destiny has arrived and Avengers: Infinity War has finally crash landed in theaters this weekend. The first challenger for Star Wars: The Force Awakens’ record of 247 million dollars opening weekend in the domestic market. It’s already the biggest film of the year and we probably won’t see an event film this big until just over a year from now when Avengers 4 makes its way into theaters. Until then, we’ll be gifted a smaller scale Ant Man and the Wasp motion picture in July, and a travel back in time to the 1990s with March 2019’s Captain Marvel. Before I get too far ahead of myself, how IS Avengers: Infinity War? The first thing to take note of, is that Avengers: Infinity War boasts the largest cast of characters in a comic-book movie ever. It’s 10 years and 18 films worth of culmination bottled up into one larger than life motion picture. It’s the biggest event film of this era not named Star Wars, and it gets the job done admirably. Marvel golden boys Joe and Anthony Russo, the minds (some would consider masterminds) behind Captain America: The Winter Soldier and Captain America: Civil War return to direct their first full Avengers film. Taking over what was Joss Whedon’s role before what was likely a fall out after the messy Avengers: Age of Ultron. This project and six years of hype (because Thanos wasn’t teased until 2012) behind it put the Russos in a do or die situation. While the film genuinely has some of the greatest MCU moments ever, there’s a lot left to be desired in a very packed movie. Starting with the greatest aspects of Infinity War, we see the MCU’s finest cinematography yet. Even if the blocking and framing could use some touch ups, there is an astonishing amount of frames that stun audience members. There is a constant feeling of being dwarfed by images that exceed any expectations we had of cinematic scale. Outside of the scale, there is a powerful emotion and sense of terror that is evoked whenever the Titan Thanos is on screen. More on that later. With Civil War being one of the least inspired MCU films from a cinematography standpoint, it was a welcomed surprise to see the Russos have a knack for some truly stunning images. On a technical level this is the film’s greatest aspect alongside some riveting, if not inconsistent, visual effects. Any effect in regards to Thanos is so good it almost appears as prosthetics rather than digital motion capture. Many sequences involve high end visual effects and more often times than not, it absolutely delivers in unimaginable ways. One of the most hotly anticipated aspects of the film is the action sequences that were promised in it’s promotional material leading up to the film. For the most part, Infinity War excels here. There’s a large scale meetup in Wakanda that could have used a more focused sense of composition to its close quarters combat, but many wide shots capture action in exhilarating ways. All of the action is improved upon here in the (mostly) underwhelming action that took place in the Russos’ Civil War. There are a surprising amount of encounters between heroes and villains, and any scene including Thanos dials up the intensity to 11. Josh Brolin’s turn as Thanos is the greatest gift the MCU has ever given audience members. A truly terrifying, well crafted, three dimensional beast that is essentially, the film’s main character. From the opening scene to the closing, Thanos is a force to be reckoned with and Brolin really gets into the role. There was a shocking amount of nuance and depth to Thanos that truly showcases just how terrible the MCU’s catalogue of villains are. There is a sense of power, fear and respect that is captured with the camera and each set of dialogue cues for Thanos feels like listening to a painting. Each scene including Thanos is the film’s best work and a true testament to how the Russos and returning writers Christopher Markus and Stephen McFeely got truly invested into Thanos as a character. If Thanos failed, the movie failed, and despite Brolin’s excellent turn as the Mad Titan, Avengers: Infinity War has a slew of obstacles that couldn’t be overcome. Avengers: Infinity War is HUGE. Not only in scale but in terms of content and information overload. There’s a lot happening within Thanos’ quest to acquire all six infinity stones to balance out the universe, and it makes for a less than stellar outing from the writing, directing, and editing departments. Infinity War is a warranted two and a half hour long film that somehow manages to lose it’s focus a mere 25 minutes in. Audience members are constantly tossed around the galaxy from one group of heroes to the next and it prevents the film from latching onto any pace or narrative motion. This is a bold choice and a decision that should work, but before any scenes get a chance to settle we’re presented with more title cards that work as a reminder as to where we are in the story. Believe it or not, this may constitute as a minor spoiler, but characters, stories, and subplots disappear for roughly 40 minutes at a time. Thus leaving us in a constant state of disarray at who is currently playing what role in the narrative. There is so much content and new information to digest during these times and it’s a frustrating head scratcher that will make you wonder why previous MCU entries never touched on these things in their stories. When they actually had time to sit down, exposit a bunch of worthwhile and lengthy information, to set up this monumental event. We learn more about the inner workings of Vision, Thor’s realm, and Gamora’s past in this film than we ever do in previous entries and it weakens any sort of kinetic motion the film may have had going for it. Thanos rakes in most of the screen time, and rightfully so, but now the rest of the film is left vulnerable for previous entries not sprinkling in information to assist in building this larger picture. For example; Thanos’ Black Order (a group of henchmen that seek to assist Thanos in his quest) makes their first appearance in this film and is our introduction to them. All four members have a wide variety of different abilities and skill sets yet they end up being a total waste of screentime. There is nothing to be learned from their existence and yes, it would have added more excess, but it would never feel like excess had they been mentioned before, revealed before, or had other parts of the film also been treated similarly. I truly believe that the Black Order is important in wanting to explore and deepen the Marvel mythology, but they get treated like mindless cannon fodder. It also doesn’t help that they are some of the worst visual effects in the film and it makes Playstation’s “God of War” look more cinematic. As for the film’s editing it lacks in providing any sort of consistency to the story. Before scenes or moments settle we’re thrust into another scenario that also does the same thing. With consistently dense, yet beautiful imagery our bearings are constantly needing to be gathered as we move from one setting to the next. There are many reveals, revelations, and universe changing moments that feel glossed over or hamfisted because there is not enough “movie” for the amount of information. This primarily has to do with the Russos’ constant inability to prioritize what matters and what doesn’t in a story. There is no reason to contend that the film “needed time to breathe” when the Avengers were constantly on their heels, but the film simply needed a more confined and focused checklist of what it wanted to accomplish and how it wanted to do it. The point of focus is Thanos, but that’s only one half of a story considering the Avengers are in this film as well. Everything regarding and involving the Avengers is so much excess that it showcases the best and worst parts of films on this level. Is it cool, monumental, and once in a lifetime? Of course, but there is such little investment to be had in anything that the characters are doing because this event is only one half of a two part story. It’s primarily exposition (which already gets enough of a bad rap), contains rising action, and the climax of this story is the final minutes of the film. Thus wondering if this half of the film is worth it until we see the true finale in 2019. This is why Avengers: Infinity War is such a difficult film to review as a critical analyzer. In many ways, Infinity War delivered one of the greatest theater going experiences of all-time, it also delivers on some of its promises, but there is constant issues within the film that turn this spectacle into a film that could have benefitted from more focus on it’s story. The story meanders in many different directions, and although it stays true in being connected to the primary plot, there is virtually zero structure or parameters that the film wants to work within. It’s a ginormous piece of “movie” and at its expense it half-bakes character interactions, dynamics, and subplots that should have been a primary driving force for the film’s secondary story that we’re supposed to be focusing on while Thanos roars across the galaxy. Avengers: Infinity War basically represents every good and bad thing about cinematic universes and the MCU specifically. There’s a lot to come away with on a positive note if you’ve invested so many hours in this franchise, but for a movie infinitely loaded with concepts, ideas, information, and plot it manages to come away as a less than fulfilling experience. It satisfies a sweet tooth and begs you to buckle up, but in the end you’re only at the halfway mark and it makes you wonder if this trip was even worth it. A lot of the story here deems previous entries, twists, or arcs inconsequential when looked at with a larger lens. There’s a true sense of awe and wonder behind a culmination event that somehow got made in many frames, sequences, and truly hilarious character banter in a film that miraculously balances hilarious humor and meaningful drama. It’s a two and a half hour epic that is the film-making equivalent to knowing where everything is in a messy room. It may take a while to uncover or remind yourself where you put that useful piece of information, but when you get it at least you feel some form of satisfaction. Avengers: Infinity War is a superfluous superhero romp that will leave you wholly satisfied in some areas, but when the dust settles you’ll be snapping your fingers saying, “Ahh, maybe next time.” Avengers: Infinity War gets a 72/100 ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T00:47:07.913Z","updateDate":"2018-04-28T17:23:33.139Z","user":{"userId":"931454041","realm":"RT","displayName":null,"accountLink":"/user/id/931454041"},"score":3.5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"Outstanding , Marvel best so far. Great story and emotional ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T00:45:56.050Z","updateDate":"2018-04-27T23:21:54.490Z","user":{"userId":"915838757","realm":"RT","displayName":null,"accountLink":"/user/id/915838757"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"I simply can’t not give it 5 stars ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T00:40:29.654Z","updateDate":"2018-04-27T17:23:36.947Z","user":{"userId":"971494701","realm":"RT","displayName":null,"accountLink":"/user/id/971494701"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_0_5","review":"************************Spoilers Ahead************************\n\nAh, Infinity War. The most anticipated movie of all time and as of writing this review is the fastest movie to reach a billion dollars. But is it any good? Short answer, no.\nInfinity War is not a movie at all and it never even tries to be one. Infinity War is a joy ride, a roller coaster, fun at first but derails and kills everyone in the end.\nThe characters are the worst. No one except IronMan, Doctor Strange, Gamora and Thor try to do anything. Spider-Man is badly done in the movie, only memorable Spider-Maan scenes are a joke from the trailer and the death scene which is now a meme.\nThor goes on a pointless sidequest to forge a new weapon when just in the last film he learnt that the power was always inside him. Gamora wants to stop Thanos from getting the soul stone, so she just goes right to him. Bravo Gamora. Doctor Strange and Ironman do try something but still end up going right into Thanos' hand. Also, I do not buy the one in 14 million chance of them winning.  Show us, don't tell us. Those are ridiculous odds considering they almost won twice.\nThe Earth team with Cap, Black Cat, Sucky, Pigeon, War Machine, Blonde Widow do nothing and are utterly useless. Similarly weak and pathetic was Thanos' Black Order. Ebony was cool but died quickly and Proxima looked cool but died horribly. Hulk was by far the biggest travesty. Worst acting ever by Mark Ruffalo. Vision who has a freaking infinity stone in his forehead does nothing, Elizabeth Olsen did good as Wanda, but not enough.\nBig bad Thanos is introduced as a powerful being but later is nerfed to take a beating from IronMan, Doctor Strange and Spider-man and is useless without his glove and shiny stones. His plan to wipe out half the life in the universe would make sense if a certain Deathly character was present, but he just wants to stop overpopulation. That is a stupid motivation to kill half the life in the universe and totally unpractical. But most of the CGI on Thanos was good, except the lip movement in wide shots and Brolin gave a good performance. His overall design could have been much better though.\nJokes are BAD, very BAD.\nOverall not worth seeing once.","displayName":"Shubham K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T00:29:31.000Z","updateDate":"2018-05-06T23:28:20.000Z","user":{"userId":"914524182","realm":"RT","displayName":"Shubham K","accountLink":"/user/id/914524182"},"score":0.5,"timeFromCreation":"Apr 25, 2018"}]}