{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAwMDg1NDEiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjVUMDQ6MzE6MzUuOTcwWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Mjc3MDk5NjMiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjVUMDU6MjI6NTMifQ=="},"reviews":[{"rating":"STAR_2","review":"A bucket load of action but no story its like a super hero souffle nice bit ultimately empty air","displayName":"Anthony S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T05:22:53.000Z","updateDate":"2018-04-25T05:25:12.000Z","user":{"userId":"927709963","realm":"RT","displayName":"Anthony S","accountLink":"/user/id/927709963"},"score":2,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_4_5","review":"So my review on Avengers: Infinity Wars... Once again, it is extremely difficult to talk about this movie without revealing spoilers. As a matter of fact, I would say this is by far the hardest. But I will say this. This movie is pretty amazing. I warn you though. If you are not a Marvel fan and have not seen the other movies, you will be very confused. This movie does not waste time backtracking. It progresses, and it progresses QUICKLY. So all you Black Panther bandwagon jumpers may be confused and overwhelmed. 😂 It combines the stories of like, 12 characters into one film, but it does it in a way that I felt was exceptional for the difficult task that they had to do in bringing them together. All the characters remained true to themselves despite so much going on in one film, and the movie was HILARIOUS! While Marvel is known for its comic genius, don’t sleep on the shock factors and seriousness within the film. You will have quite a few OMG moments, and maybe even a few tears. I plan to see it again and I highly recommend it for all the true Marvel fans. You are in for a wild ride! #AWESOME#MARVEL4LIFE#DCWHO","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T05:08:06.139Z","updateDate":"2018-04-28T06:54:20.129Z","user":{"userId":"970372961","realm":"RT","displayName":null,"accountLink":"/user/id/970372961"},"score":4.5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"the best movie of MCU","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/907307009425758/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T05:04:33.000Z","updateDate":"2018-04-27T11:09:07.000Z","user":{"userId":"976882368","realm":"RT","displayName":null,"accountLink":"/user/id/976882368"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"Exhilarating, funny, and sad all at the same time, very good movie. Does a great job of balancing all the characters! Just be prepared for a tough ending. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T05:02:55.301Z","updateDate":"2018-05-05T22:46:39.212Z","user":{"userId":"918419131","realm":"RT","displayName":null,"accountLink":"/user/id/918419131"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_0_5","review":"Boringest crap ive ever seen. Its been 8 years tooo much of marvel movie. So over it.","displayName":"steven k","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T04:54:05.000Z","updateDate":"2018-04-25T04:55:08.000Z","user":{"userId":"975098273","realm":"RT","displayName":"steven k","accountLink":"/user/id/975098273"},"score":0.5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"For years and years of waiting. It's worth the wait! It's not just a movie, but an epic spectacle! Everybody in theaters are so anxious! We cheered, we're worried, we laugh and we cheered all throughout! The first Avengers does have characters with well balanced screen time. Same w. this movie as well! But what's more impressive was it includes 3 phases of Marvel films that includes Guardians of the Galaxy! Kudos to the Russo brothers! And speaking of villain, Thanos which was portrayed by Josh Brolin, is just pretty impressive! He's menacing as ever! Every thing he does holds everyone's breath. I just can't wait on the next as everyone's very anxious about it! A perfect 5 maybe the best MCU film of all!","displayName":"John Eric D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T04:52:52.000Z","updateDate":"2018-05-20T05:58:01.000Z","user":{"userId":"966892496","realm":"RT","displayName":"John Eric D","accountLink":"/user/id/966892496"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"The whole movie was faultless. The actors where the best they have been yet, the script was well thought through and kept the audience engaged the entire time.","displayName":"Miah L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T04:46:43.000Z","updateDate":"2018-04-25T04:48:39.000Z","user":{"userId":"977237313","realm":"RT","displayName":"Miah L","accountLink":"/user/id/977237313"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"I couldn't be more shocked by a movie. My heart was beating so fast from minute one until the last minute.  My legs were shaking after leaving the theater.\nIt is a thrilling ride with ups and downs (mostly downs). Many people say that it is exhausting because there are too many characters and too many things going on, but you cannot criticize this movie from this factor only. This is the movies nature. It was meant to be like that, to exhaust you until the last minute. On the other hand, there were too many characters but each and every one of them is shown equally with an enormous dynamic for all of them. Also, the scenes that were running simultaneously were masterfully crafted to fit in the story so that everything can end up the way it ended. \nYes, there were many deaths and many of those deaths made us cry and made us emotionally unstable. But this is the movie, a movie about the possible end of the world. \nThanos is the best villain that Marvel ever created. He threw Killmonger out of the window. We've seen an extraordinary part of his character. He is not the bad villain that everyone was waiting for. We've seen his good side in many perspectives, his only love. But we've seen what he is capable to do to accomplish his mission.\nAt last what Avengers: Infinity War has that no other superhero movies has is that ending. Those 10 last minutes that will haunt you forever and you will never forget them. Things take an unexpected turn at those 10 last minutes that you are not only left speechless but you leave the theater with your mouth fully open from surprise and your legs shaking from disbelief. \nIt's of course the first part of a two part movie because it leaves you with an enormous cliffhanger but let's not forget May 2019 is not too far away from now.\nThus, this movie is a must see for all the marvel moviegoers and fans but also for people that have some knowledge on the movies background story. The cast and crew of this movie deserve a big applause and an enormous bravo from the entire world. I cannot believe that I've lived to see this movie.  I quote what common sense media said \"This is the most intense, complex, and stirring Marvel Cinematic Universe film yet\"","displayName":"Chris M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T04:41:58.000Z","updateDate":"2018-04-28T02:47:31.000Z","user":{"userId":"977237306","realm":"RT","displayName":"Chris M","accountLink":"/user/id/977237306"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"Best Marvel Studios Movie I’ve ever seen! But I was sad at the end! ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T04:32:17.841Z","updateDate":"2018-05-14T00:36:47.394Z","user":{"userId":"971219933","realm":"RT","displayName":null,"accountLink":"/user/id/971219933"},"score":5,"timeFromCreation":"Apr 25, 2018"},{"rating":"STAR_5","review":"The Russo brothers have truly made a comic book movie masterpiece with this film. 10 yers build up with plot lines woven through over 20 films and not one second disappoints. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-25T04:31:35.970Z","updateDate":"2018-04-26T19:33:37.271Z","user":{"userId":"260008541","realm":"RT","displayName":null,"accountLink":"/user/id/260008541"},"score":5,"timeFromCreation":"Apr 25, 2018"}]}