{"pageInfo":{"hasNextPage":false,"hasPreviousPage":true,"endCursor":null,"startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NjYwMDQ4OTEiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTQtMTItMDFUMDQ6MTk6MTlaIn0="},"reviews":[{"rating":"STAR_5","review":"the movie thats ten years in the making... was totally worth it","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2014-12-01T04:19:19.000Z","updateDate":"2018-05-04T05:07:33.961Z","user":{"userId":"966004891","realm":"RT","displayName":null,"accountLink":"/user/id/966004891"},"score":5,"timeFromCreation":"Dec 01, 2014"},{"rating":"STAR_5","review":"Infinity war is worth the 10 years of wait and has epic grandiose action throughout the film on the largest scale with heavy stakes. The most emotional Marvel movie yet, every character shines and Thanos is the best MCU villain! Marvel's best movie overall. 10/10","displayName":"Josnick K","displayImageUrl":"https://graph.facebook.com/v3.3/881195444/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2014-11-20T21:28:55.000Z","updateDate":"2018-05-02T15:00:11.000Z","user":{"userId":"892752858","realm":"RT","displayName":"Josnick K","accountLink":"/user/id/892752858"},"score":5,"timeFromCreation":"Nov 20, 2014"},{"rating":"STAR_5","review":"Seen all the MCU films? Check. If not, then that's mostly fine - probably.\n Read the main comic storyline? Preferable while optional.\n Are you prepared? Either way, you would need personal mental reinforcement.\n\n The potential impact of one film is well known enough to turn the excitement of anticipation into nervousness because of the dire consequences that could happen when the impact occurs right in front of us. This case can only be felt if the attachments towards the characters through knowledge and experience has grown like a bond between film and mind, prepared by little to be emotionally shocked after connecting through multiple films. Now for those who aren't very familiar, or haven't grasp, with the interconnected narrative mythology, it's a ride with heavy stakes and emotional strength to make sure the biggest threat doesn't reach the goal. The mutual one-word description from both sides would agree that it's altogether powerful - but various tastes would go random.\n\n Ladies and gentlemen, this is \"Infinity War\".\n\nThe Marvel Universe continuously faced multiple threats from the grounded Earth to the infinite side of the cosmos, and they all been thwarted by heroes and occasional team-ups. But everything they went through, the fights and challenging obstacles, led them to face Thanos, a new danger with a lingering presence makes himself known in his quest to collect all six Infinity Stones, each containing unimaginable power that are aspects of the universe's creation. With the fate of Earth and all that exists threatened by how Thanos see fit, most of the Marvel heroes must prevent him from reaching his goal or it's all over.\n\n Expectations have been typically met, usually exceeded in a familiar fashion, but one aspect met short. As tradition, an Avengers film is a culmination of what occurred since the previous team-up. But this time, directors Anthony and Joe Russo presented what's literally a culmination of all the films that were building up to this one in all angles: referring back to the past events; consisting at least one character from one character's solo outing; and combined entertainment values blended altogether into one. It's powerful to the epic scale of the action and characterization, particularly the emotional weight and heavy circumstances to bring out their strongest strength, especially when the spectacle has spontaneously grown.\n\n While \"The Winter Soldier\" is merely a political thriller with more grounded realism and 'Civil War\" is a step-up as an emotional game changer to Midgard, the Russo Brothers did it again with an increased scale but handled it all just fine with supportive help and guidance into the characterization. Cinematic creativities varies by director's taste and vision that mostly excels, and the Russo Brothers continue their masterful direction to prove themselves worthy of the broken Mjolnir for doing justice on expressing the scale of the story and the characters, with some artistic filmmaking to boot with the visual help of their frequent collaborator cinematographer Trent Opaloch.\n\n The credit should also go to screenwriters Christopher Markus and Stephen McFeely for finding such grasp to handle with a solid script and the layout of the emotionally epic scale as well balancing plot points as the film narrows down to three plots once the characters are grouped to diegetic strangers before down to two in the climax. Not only did they do the characters right but how they had written in connective references to all 18 films before this one can be seen as a beneficial access for those who have seem most likely little to none of the cinematic universe, which is almost like how seriality is done on televised dramas but straight to the main plot and being patient to be caught up. With that being said, this is more for those who have experienced all the films - and television series to lesser extent - and would understand more behind the spoken words that described the past plot elements and impacts briefly. But the converts fills the experience to the maximum while the non-converts, who don't follow the films pretty much or not at all would minimally experience while still feel the power.\n\n Composer Alan Silvestri presents another component next to the Direction Stone and Written Stone with the Music Stone that nondiegetically expresses the overall soul. He scored the first \"Avengers\" that really, more clearly, kicked the main narrative arc off that started forming this film, and it's a pleasant return when further emphasizing the weight and amped-up the excitement while also expressing both the general scale and emotions. The power is felt through the music, and Silvestri did it masterly when treating the story being some sort of an opera, which is pretty much is considering the epic scale and impact in thorough senses of different levels from emotional attachment to shocking impact to the heavy-paced action.\n\n Now for the Human Soul goes to the gathered-up cast, mostly reassembled and some assembled together for the first time. The dynamic of the latter assembly is what made \"The Avengers\" exciting when crossing over characters from different films, and the major third team-up returned that feeling to see different worlds colliding at entertaining, occasionally amusing results. Although, the main downside of this whole film is that there wasn't much interactions as hoped, as well some characters were underused with shorter spotlights and few were omitted; but understandable since this is only Part 1. But the one character that went through all the plot branches and interacted with the heroes is the most compelling: Thanos, greatly portrayed and composed by Josh Brolin. As it was pointed out, \"Infinity War\" is genuinely Thanos' film, and Brolin justified that already by his performance being the standout of the huge cast. Taking second place behind Brolin is Chris Hemsworth doing the same in a more personal level for his character to really rise to the mighty title; followed by Benedict Cumberbatch, Robert Downey Jr., Zoe Saldana and Chris Pratt. The rest performed at their usual level with more required strength.\n\n\"Infinity War\" is best to be seen as a theatrical viewing in order to truly feel the power level before it hits the shrunken effect, even though it'll still be entertaining no matter the screen size. As an ensemble crossover, it ties to \"The Avengers\" over \"Civil War\", while standing between the former predecessor and \"Black Panther\" as MCU's tops, peaking at how powerfully emotional it is through the expressive spectacles and performances towards the heavy weight with combined previous elements. But based on the lasting impression the film left off after the first viewing, it's so far the heaviest film there is as far as I know and what I have yet to see as of now. (A+)","displayName":"Kyle M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2014-11-20T11:00:35.000Z","updateDate":"2018-07-01T11:50:28.000Z","user":{"userId":"907803058","realm":"RT","displayName":"Kyle M","accountLink":"/user/id/907803058"},"score":5,"timeFromCreation":"Nov 20, 2014"},{"rating":"STAR_4_5","review":"Ten years. Eighteen movies. Billions of dollars. Dozens of characters. Six Infinity Stones. It has all come to this, the biggest crossover event in movie history. Oh, you thought Alien vs. Predator was big? That's so cute.\n\nThe scope of this movie is monumental. All of the heroes we have seen over the past ten years need to team up to stop Thanos from acquiring all six Infinity Stones. Iron Man will meet Doctor Strange. Rocket and Groot will meet Thor. Captain America will meet Vision (wait, they might already know each other.) When a threat of this magnitude enters the playing field, the feuds of  Civil War must be put aside in order to save the universe.\n\nThere are a lot of plot points in this movie, and I am not going to talk about any of them. Honestly, there is no need. The film does such a good job of reminding you why you like all these characters all by itself. The big news in this movie is Thanos; he has been on the sidelines for too long, and he finally gets the chance to be in the spotlight. And it's a really good spotlight. Thanos does not quip, joke, or barely even smile. Josh Brolin plays him so menacing, he is a credible threat to the Avengers. This is a villain worthy of this much set-up.\n\nThanos' minions also get their day. Ebony Maw, Cull Obsidian, Corvus Glaive, and Proxima Midnight get a surprising amount of screen time, considering you probably don't know who the heck these people are (no judgement, neither did I until I started researching them before the movie came out.) Every single characters gets something awesome during the movie, and by the end of it, you have been gut-punched so many times, it feels like an emotional marathon.\n\nWhile I do not wish to spoil the movie, I will warn that it does end on a cliffhanger. Be prepared for a big ending, but one that may feel somewhat....","displayName":"James S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2014-11-16T14:58:29.000Z","updateDate":"2018-05-21T05:42:47.000Z","user":{"userId":"903748135","realm":"RT","displayName":"James S","accountLink":"/user/id/903748135"},"score":4.5,"timeFromCreation":"Nov 16, 2014"},{"rating":"STAR_3_5","review":"Avengers: Infinity War celebrates Marvel Studios' 10 years and continues its ambition with a consistently thrilling and surprisingly emotional installment of the long-running MCU that makes up for its bloated runtime with excitement, strong character development, and drama, it doesn't drag nor does it overstuff, and by the end it will leave you breathless!","displayName":"Nico B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2014-11-02T13:52:05.000Z","updateDate":"2018-04-27T14:57:15.000Z","user":{"userId":"905445336","realm":"RT","displayName":"Nico B","accountLink":"/user/id/905445336"},"score":3.5,"timeFromCreation":"Nov 02, 2014"},{"rating":"STAR_4","review":"What an emotional roller coaster this movie was! Unpredictable moments is all I have to say ??","displayName":"Jason T","displayImageUrl":"https://graph.facebook.com/v3.3/100001473926559/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2014-11-02T07:23:43.000Z","updateDate":"2018-04-26T19:53:24.000Z","user":{"userId":"928999020","realm":"RT","displayName":"Jason T","accountLink":"/user/id/928999020"},"score":4,"timeFromCreation":"Nov 02, 2014"},{"rating":"STAR_4_5","review":"Probably the greatest comic book film yet made, Infinity War takes full advantage of its medium, presenting one visually spectacular set piece after another, with perfect balance of all its characters, and full of the wit, pathos and, humanity that we've come to expect, without worrying about some of the plot details.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2014-11-01T08:07:59.000Z","updateDate":"2018-11-11T01:45:24.961Z","user":{"userId":"871216371","realm":"RT","displayName":null,"accountLink":"/user/id/871216371"},"score":4.5,"timeFromCreation":"Nov 01, 2014"}]}