{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyNDgxODYiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjlUMDc6MTg6MzIifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzQ2MzE4ODgiLCJlbXNJZCI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhlZjAyMmVmLWY4OGEtMzNjOC04ZjZlLWFiODdmNTAzOWVlYV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMjlUMDc6MzQ6MDgifQ=="},"reviews":[{"rating":"STAR_4_5","review":"Very long movie, but I believe they did as good of a job as they could have with the sheer amount of characters and plot lines going on in it.  Thanos is done great and really feels like the right kind of villain. I think the whole fight scene in Wakanda is kind of boring and pointless, but other than that I enjoyed the rest.","displayName":"Kyle M","displayImageUrl":"https://graph.facebook.com/v3.3/10206319525335616/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T07:34:08.000Z","updateDate":"2018-04-29T07:37:24.000Z","user":{"userId":"974631888","realm":"RT","displayName":"Kyle M","accountLink":"/user/id/974631888"},"score":4.5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"This movie is a conclusion of all marvel cinematic universes movie in the past 10 years and its put it all together very well, but not very neat. It put the heroes on various moment that we can't correlate with. As we know, the main villain, Thanos is a fanatic on his own belief and He tried to make a religion out of this, put his ambition all over the universe whom he believes is the best choice that universe would ever have. But I fail to connect to what Thanos belief, as a good villain must convince what he's doing is probably the best choice for the audience. In the past movie, we don't know Thanos true intention to collect all the rocks for but we know that he is very powerful and his reason must be as powerful as he is, turns out its just incomprehensible obsession over balance.\nOne thing that felt weird is when Rocket and Groot easily join Thor on his quest considering Rocket's skeptical view on people. It's also strange when the rest GotG flew to Knowhere and trying to stop Thanos while Thor, Rocket, and Groot go on their side quest to create a mighty weapon to destroy Thanos, It's like the Quill's team would face a predestined lost. But to everyone who said that Thor's hammer is freakin' cool, I must agree.\nOn the other side of the fight, Doctor Strange, Iron Man, and Spider-Man is a great collaboration of fun and glorious fight. The way Doctor Strange fought with his magic is pretty cool and it's like he always has some trick to confuse Thanos while an iron man and spiderman showed their father to son debate which makes a bit of fun on the pretentious moment. \nThe fight in Wakanda took a lot of heroes but very little exposure of all of them. It's like when all the triumph moment come it always gone quickly, moving to another main character's scene, I don't feel the fight was set on the Wakanda, it's like the director just changes the scene madly to show the heroes. The plot doesn't make any straight line conclusion, Thanos seems like a confused guy trying to get all his toys, and why the hell Thor just farming on Thanos's crazy monsters not just directly confront him as he always wanted to do in the first place and the main reason he crafted his new weapon.\nThe biggest wasted potential on this movie is Hulk. Before I see this movie, I think the only guy that would be able to defeat Thanos is the Hulk. But when he's beaten on the Asgardian's ship, I hope that he will get angrier and make an epic comeback on Thanos, even if he's not gonna defeat him, I expect that there is an epic moment of Hulk beating Thanos.\nOn the end of the movie, the conclusion is not what I expected, but the result is. The story left me nothing to expect on the next movies, so when the movie ended I felt no insurmountable urge to watch the next, it's because the ending of the movie is just like the ending of the Avengers movie.There's no one taken any hostages, no one alive to fight for, and the villain is retired on his tropical hut. The possibility of the next movie all about is as the title of the movie, to avenge, and this time for the dead one.\nOne thing I felt missing in this movie, the triumph song, it's like the immigrant song on thor Ragnarok and African black panther's theme song. There are a lot of cool moments and if it guided with a compatible back sound, It will bring more ardor to the scene, but instead, it's only a flat monotonous back sound that I may say is the secondary storyteller, besides the scene.\nI must appreciate how Russo brothers put the details very neatly despite a great deal of character and story to take care of. And respect given from me to the director when they could still maintain all the characters sways and jokes and made me feel a little bit nostalgic feeling of the past movies and a brief moment of clarity of how big this movie is.\nSome people may expect more from this movie, but I can't see another way to feel enjoy the character in any other way. This movie brings the characters personally as it brings all the character as a team. They put the movie on tight chess game with some sacrifice and some winning, making an unexpected move while making sure the ending is inevitable. And I believe for the next movie, the remainings character won't go easy on Thanos. The Avengers will avenge. That's what they do best.","displayName":"Aris T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T07:33:38.000Z","updateDate":"2018-04-29T07:39:29.000Z","user":{"userId":"977248213","realm":"RT","displayName":"Aris T","accountLink":"/user/id/977248213"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_3","review":"Keep using the same clichés like time traveling and alternate realities.  Donald Trump will love this movie.","displayName":"Jose M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T07:33:28.000Z","updateDate":"2018-04-29T07:36:39.000Z","user":{"userId":"935587740","realm":"RT","displayName":"Jose M","accountLink":"/user/id/935587740"},"score":3,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_1","review":"Too many super heroes competing for screen time - and the movie has lots of screen time almost three hours of it - and I hated the ending. The ending was unexpected but that does not make it good","displayName":"Cindy M","displayImageUrl":"https://graph.facebook.com/v3.3/10201245572057216/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T07:28:23.000Z","updateDate":"2018-04-29T07:29:47.000Z","user":{"userId":"973572902","realm":"RT","displayName":"Cindy M","accountLink":"/user/id/973572902"},"score":1,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Beat my expectations.  I went into rather cynically, but left surprisingly and thoroughly entertained.  It was a well crafted and well told story.  Some characters should have had more screen time.  There were scenes in the trailer that weren't in the final edit of the film, but perhaps we will see some of those in the finale.  All in all though, it was a solid offering from the Russo brothers and a film I will undoubtedly be seeing again.","displayName":"Tom W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T07:25:52.000Z","updateDate":"2018-04-29T07:31:06.000Z","user":{"userId":"977248199","realm":"RT","displayName":"Tom W","accountLink":"/user/id/977248199"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"A great to culminate this first 10 years of Avengers. And an incredible set up for what's to come. This is everything JL isn't.","displayName":"Roberto S","displayImageUrl":"https://graph.facebook.com/v3.3/10208152544517528/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T07:23:52.000Z","updateDate":"2018-04-29T07:25:22.000Z","user":{"userId":"973253330","realm":"RT","displayName":"Roberto S","accountLink":"/user/id/973253330"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"An emotional, action packed fantastic film with great comedy too, another great addition to the MCU that sets up the events for Endgame perfectly","displayName":"Dylan B","displayImageUrl":"https://graph.facebook.com/v3.3/337307970036289/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T07:23:05.000Z","updateDate":"2019-04-25T03:27:17.000Z","user":{"userId":"976530982","realm":"RT","displayName":"Dylan B","accountLink":"/user/id/976530982"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_2","review":"MEDIOCRE. Esparaba mucho mas. \nNO, Los tres que fuimos a verla salimos con la sensación de que le falto algo a la pelicula, una trama apocalíptica en la tierra mas masiva, la guerra en wakanda fue buena por muy apurada, todo paso muy rapido, metido a las apuradas y de golpe te encontras con una toma corta de personas desapareciendo al lado de nick fury, nunca en la pelicula hay tomas de escenas amplias, si desaparece la mitad del universo, deberia plasmarse en escenas como todos los planetas quedan vacios, si vas a comparar con star wars por lo menos, conta que en star wars 7 cuando la star killer base lanza el rayo destructor de planetas, se ve la toma de los varios planetas que explotan, hasta ven venir el rayo. A marvel no le hubiera costado nada incluir una escena de varios planetas en caos desapareciendo, eso le daria mas grandeza y la ubicarIa en el nivel que realmente deberia tener, LA BATALLA POR EL DESTINO DEL UNIVERSO. Tu comparacion es un insulto al imperio contraataca. Hasta algunas partes me parecieron la verdad de relleno, como que encuentren a red skull con la gema del alma y el sacrificio de gamora, nose que mate a su hija fue sentimental pero me parecio bastante de relleno en la pelicula. Las partes de vision me parecieron, la verdad, a quien le importa VISION? ni una pelicula tiene y le regalaron muchos minutos a esa trama, nadie se identifico con vision, otra ves, si es sentimental esa historia de amor, pero sin sentido en el historial de las historias de la FASE DE MARVEL, las historias son de IRON MAN, THOR, CAPITAN AMERICA, HULK, los principales, y le dieron muchos minutos a vision, la verdad, ese espacio deberia haber sido para el capitan america, mmmmmmmm hay muchos puntos flojos para ser la perla brillante de los AVENGERS.","displayName":"cristian r","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T07:21:03.000Z","updateDate":"2018-04-29T07:23:08.000Z","user":{"userId":"977248192","realm":"RT","displayName":"cristian r","accountLink":"/user/id/977248192"},"score":2,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"Critics on the fence about this one yet the Dark Knight Rises was praised???!!! ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T07:19:57.842Z","updateDate":"2018-04-29T07:19:57.842Z","user":{"userId":"966367166","realm":"RT","displayName":null,"accountLink":"/user/id/966367166"},"score":5,"timeFromCreation":"Apr 29, 2018"},{"rating":"STAR_5","review":"I saw this movie just before three hrs. It was a quiet good movie which gives more importance to the villain.","displayName":"Sunil P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-29T07:18:32.000Z","updateDate":"2018-04-29T07:20:35.000Z","user":{"userId":"977248186","realm":"RT","displayName":"Sunil P","accountLink":"/user/id/977248186"},"score":5,"timeFromCreation":"Apr 29, 2018"}]}