{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb19DMkU2MjdDOC01NDhBLTQ2MDgtQkMyNi0wRjc2MDVBNjdGOEUiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjFUMTQ6NDE6MzIuNjk1WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NjA0ODM2MjYiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjFUMTU6NTg6MjMuMDg2WiJ9"},"reviews":[{"rating":"STAR_5","review":"I loved the movie, have zero complaints, and walked out feeling wonderful about Star Wars. With that being said, what I also love, is all of these negative reviews about how choppy or incomplete the film is, saying it has so many useless plots and throw away lines as well as many \"other problems.\" I am old enough to have seen all the critics rip apart the Empire Strikes Back, but now its considered as possibly the best of the franchise. People ripped apart the prequels, but now they are beloved by many fans of the franchise, and they cheer when something they love is referenced in the movies. Even shows like the Clone Wars had so-called upset fans with how bland and cheesy the show was as at the time, but now characters like Ahsoka Tano are some of the most beloved characters cheered for at Star Wars Celebration. The problem is not Disney, George Lucas, J.J. Abrams, or even Ryan Johnson. The Problem with the franchise is that its fan base has grown up too much since the 80's and 90's, and 2000's, for that matter since 1977, and in recent years, it has been popular that people band-wagon on loving Star Wars, and then hating the franchise when a new movie comes out, and lost touch with what it means to be a child-like spirit in the cinema, the same when you had when you saw Star Wars for the first time. You were not criticizing the movie ever step of the way, you were riding the roller coaster ride regardless of where it was turning, because as Flash Gordon did before it, this is a fantasy of story, not a perfect-plot checklist, and I have to say, this movie made me laugh and it made me cry legit tears. This movie accomplished what the Star Wars movies before did for me, finding laughs, feels that tug the heart strings, and made me want to run home and play the video games. Star Wars was never meant for adults with no imagination, it was meant for the children or the eternal child in adults with open-minds and imagination, whom will grow up loving this franchise and pass it on to their children through imagination and mythology. The fan base which loses touch with the product gets old and dies off, and all that is left is the \"true fans,\" whom will carry the torch; all these little children whom love Jar Jar Binks will soon be in their 30's, and he will be a beloved character by the average fan, and their children; believe it. When we were children, we were picked on for being a 'nerd' for loving Star Wars; now every Jock and body-builder on the planet wears his favorite Star Wars t-shirt when they go see the movies. I hope this movie shakes off the band-wagoners, and leaves the True Fans to bask in its creative glory, as we speculate what is next in more meaningful and positive ways, as we have for decades up to now. Its great to be an old fan whom does not judge the franchise he loves, which draws from humanities greatest tropes and mythology, loving all of the throw away lines and everything. Every expanded universe book or show comes from some throw away line from one of the movies, \"You served my father in the Clone Wars,\" remember that gem of a line? Well look at the meat and potatoes we were fed after that zinger, decades worth of fantastic fan base satisfying media built off of terrible script writing. Did you cheer when you Heard Rex's voice in the Star Wars Rebels trailer? Me too, because I was a huge fan of the Clone Wars, as it added so much substance to the previously hated prequels. Now everyone is upset there is not \"more prequel\" references in the sequel movies. It is IMPOSSIBLE to appease all start wars fans; I think it would be easier to bulls-eye womp rats with a T-16. I bet a couple of decades from now, Ryan Johnson and J.J. Abrams alike will be appreciated for their takes on Star Wars, just like with many haters changing tunes gradually about the prequels. I loved this movie, and yes, I loved the Last Jedi too, Canto Bight for life. If you are a real Star Wars Fan, and you love the original trilogy, the prequels, the sequels, the Clone Wars, Rebels, the Mandalorian; if you love these movies, books, shows, you will especially love this movie, because you will find Easter Eggs from all of these wonderful platforms of creativity, and appreciate how it pays homage to a story which has been developed in the minds and hearts of the creators, and its fans for over 40 years. Go and just enjoy it. Do not listen to the critics with calcified-hearts bashing this movie; they existed since the beginning tearing this franchise apart, calling themselves \"upset fans,\"; go in as a child, and love the movie as I did, you will not regret it.","displayName":"Matthew L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T15:58:23.086Z","updateDate":"2019-12-22T20:47:23.911Z","user":{"userId":"960483626","realm":"RT","displayName":"Matthew L","accountLink":"/user/id/960483626"},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_1","review":"Poor story. Rushed. No imagination. Same old song and dance from the originals with nothing new to offer for a grand finale","displayName":"Chris","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T15:58:19.584Z","updateDate":"2019-12-21T16:01:20.930Z","user":{"userId":"369D5B5E-440F-4750-A2D3-C494869D811F","realm":"Fandango","displayName":"Chris","accountLink":null},"score":1,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_4","review":"It was a good ending to the saga and very enjoyable.  It spent needed time fixing damage caused by the horrible Last Jedi. It was even better on the second viewing!","displayName":"Chris C","displayImageUrl":"https://graph.facebook.com/v3.3/10157857409519850/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T15:34:16.042Z","updateDate":"2019-12-21T23:40:53.224Z","user":{"userId":"978459256","realm":"RT","displayName":"Chris C","accountLink":"/user/id/978459256"},"score":4,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"Loved it. Felt so Star Wars-y, and it was an emotional, exciting end to this saga that I love. Can’t wait to see it over and over again.","displayName":"Jose","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T15:32:13.191Z","updateDate":"2019-12-23T05:22:47.431Z","user":{"userId":"6463E285-2A69-4878-BE86-0BD61598E693","realm":"Fandango","displayName":"Jose","accountLink":null},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_4_5","review":"One of the best Star Wars movies I’ve seen since the start! This was wonderful. I love how they handled the death of Carrie Fisher. The entire storyline was excellent.","displayName":"Jeff B","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T15:27:44.648Z","updateDate":"2019-12-22T20:01:51.770Z","user":{"userId":"F79C7CD1-B89D-466E-AC8A-B628E5D0FF88","realm":"Fandango","displayName":"Jeff B","accountLink":null},"score":4.5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"simply phenomenal. fitting end to the saga. JJ cleaned up the mess from the first two. had an issue tho: wish it was 3 hours long? :D","displayName":"Ahmed M","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T15:24:54.860Z","updateDate":"2019-12-23T18:06:08.499Z","user":{"userId":"848D7883-40DB-4E7E-8459-60713B2558A5","realm":"Fandango","displayName":"Ahmed M","accountLink":null},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_0_5","review":"This movie has left me scarred and deformed.","displayName":"Victoria S","displayImageUrl":"https://graph.facebook.com/v3.3/2127880480662924/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T14:57:03.292Z","updateDate":"2019-12-31T11:03:52.148Z","user":{"userId":"978046134","realm":"RT","displayName":"Victoria S","accountLink":"/user/id/978046134"},"score":0.5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"JJ did the franchise right with this saga ending epic.  Absolutely loved it.","displayName":"Randy L","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T14:52:25.089Z","updateDate":"2019-12-28T18:44:54.680Z","user":{"userId":"F1BD3AA2-6840-4014-9D53-49626D9F1415","realm":"Fandango","displayName":"Randy L","accountLink":null},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"Plenty of action!!! Great story line. Awesome finish to a great saga!!! I’m not gonna spoil the ending GREAT MOVIE!!!!","displayName":"Michael","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T14:50:10.449Z","updateDate":"2020-01-03T12:53:13.003Z","user":{"userId":"D86CA376-6652-4235-B015-97ED68322C77","realm":"Fandango","displayName":"Michael","accountLink":null},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"Great conclusion to the Skywalker saga.","displayName":"Marvick B","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T14:41:32.695Z","updateDate":"2020-01-03T20:32:14.124Z","user":{"userId":"C2E627C8-548A-4608-BC26-0F7605A67F8E","realm":"Fandango","displayName":"Marvick B","accountLink":null},"score":5,"timeFromCreation":"Dec 21, 2019"}]}