{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MDgyMjE3MTciLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMzFUMTY6MzA6MDYuODc3WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb18wYWJjMWEyZC1hNGU5LTQxZDYtOWNhNy0yNzVjNTU5NTRkNGEiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMzFUMTY6MzU6MDYuNTk5WiJ9"},"reviews":[{"rating":"STAR_5","review":"A satisfying conclusion to this epic story","displayName":"Fay","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-31T16:35:06.599Z","updateDate":"2019-12-31T16:35:06.599Z","user":{"userId":"0abc1a2d-a4e9-41d6-9ca7-275c55954d4a","realm":"Fandango","displayName":"Fay","accountLink":null},"score":5,"timeFromCreation":"4d ago"},{"rating":"STAR_4","review":"I loved it!  The critics are crazy and live to hate.  True to the original and enjoy the ride!","displayName":"Gwen","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-31T16:34:20.122Z","updateDate":"2019-12-31T16:34:20.991Z","user":{"userId":"48e15e23-7788-4afe-a14a-b57b854a84e9","realm":"Fandango","displayName":"Gwen","accountLink":null},"score":4,"timeFromCreation":"4d ago"},{"rating":"STAR_2_5","review":"First two thirds were fun, with humor and delightful cameos and callbacks. By the final third I was bored. The references to previous movies started to feel gimmicky and the ending was underwhelming, lacking any emotional weight.","displayName":"Cedric H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-31T16:33:39.961Z","updateDate":"2019-12-31T16:33:45.925Z","user":{"userId":"977775286","realm":"RT","displayName":"Cedric H","accountLink":"/user/id/977775286"},"score":2.5,"timeFromCreation":"4d ago"},{"rating":"STAR_5","review":"Best since original saga. Sadly has to drag along its own version of episode 8 to recover from the actual version of the movie.","displayName":"Harrison T","displayImageUrl":"https://graph.facebook.com/v3.3/1472694591/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-31T16:33:02.070Z","updateDate":"2019-12-31T16:33:06.582Z","user":{"userId":"841509915","realm":"RT","displayName":"Harrison T","accountLink":"/user/id/841509915"},"score":5,"timeFromCreation":"4d ago"},{"rating":"STAR_5","review":"Love it! There was never a boring moment in the movie. Eventually, I will want to watch it again.","displayName":"Robert V","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-31T16:32:42.238Z","updateDate":"2019-12-31T16:32:42.238Z","user":{"userId":"6ebd63ac-6a05-43b1-aedc-459fed1d5b3a","realm":"Fandango","displayName":"Robert V","accountLink":null},"score":5,"timeFromCreation":"4d ago"},{"rating":"STAR_2","review":"Crazy story, that failed to do more than take money from my pocket that I can never get back. Jar Jar Abrams should really just stick to directing because telling a story is not really his thing.","displayName":"John K","displayImageUrl":"https://graph.facebook.com/v3.3/100001759835759/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-31T16:31:59.071Z","updateDate":"2019-12-31T16:31:59.071Z","user":{"userId":"967625849","realm":"RT","displayName":"John K","accountLink":"/user/id/967625849"},"score":2,"timeFromCreation":"4d ago"},{"rating":"STAR_5","review":"Great ending to the Saga","displayName":"matthew j s","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-31T16:31:29.473Z","updateDate":"2019-12-31T16:31:29.473Z","user":{"userId":"C2EA8F89-AF98-400F-A181-A7D278EFD180","realm":"Fandango","displayName":"matthew j s","accountLink":null},"score":5,"timeFromCreation":"4d ago"},{"rating":"STAR_3_5","review":"3.5 Star Review: (Disclaimer: Only read if you have seen the film. No Spoilers here. But I do go into almost spoilerish territory which some may be able to decipher and thus be spoiled by it. To keep those safe, only people who have seen the film should continue)\n42 years after the release of one of the biggest theatrical releases of all time, 9 films later and with fandom divided by who knows how many factions now, the \"Skywalker\" saga finally comes to an end. There is a reason why I put the name in quotation marks, but I can't go into that detail or I will be spoiling.\nAs the final entry in this epic saga, this is a film I care very much about since it was one of my first sci-fi films I ever saw. When I was a kid the only movies I loved watching over and over and over again were the original trilogy movies. Then of course, in 1999, Episode 1 was released and my love for the series continued to grow as I was only 8 years old at the time. I've gone on to read countless novels on the Star Wars universe and have fallen in love with the film making process of bringing the first 6 films to life thanks to the extensive documentaries and special features I've seen on the DVD's and Blu-rays released over the years. My respect for George Lucas and his vision has only grown over the years and while I've grown in disappointment at the fans who vilify him. Thanks to his story that spans 6 films, we have a universe of lore and storytelling that is ripe for new stories to tell and to one day hand over to our kids and future generations. One of the aspects of the 6 films I have tremendous respect for is the art of storytelling that encompasses those films. Through those six films we are shown a narrative that revolves around the Skywalkers and more specifically, the rise and fall and then eventual redemption of Anakin Skywalker, the Chosen One. Episode VI - The Return of the Jedi successfully completes the tale and brings the story full circle with Anakin finally coming back to the light and fulfilling the prophecy by killing off Emperor Palpatine. The Rebel Alliance celebrates and there is peace and justice in the galaxy with the force ghosts of Anakin, Yoda and Obi-Wan Kenobi looking on at Luke, Leia, Han and the rebels as they dance the night away. It was an ending that closed things nicely and as stories and narratives are concerned, it tied up all loose ends and firmly established itself as a Skywalker story from beginning to end.\nWith the newly released Episode IX - The Rise of Skywalker, however, without spoiling anything specific from the film, I see the new storytellers in these films do their best to include call backs across all movies and to be honest, I loved every one of those callbacks. It was nostalgic. Heck, it was MAGICAL at times. Moments that gave me goosebumps watching on the big screen combined with the artistry of John William's fantastic score. But where I am unable to forgive the storytelling of JJ Abrams and Chris Terrio (writer of Argo, Batman v Superman and Justice League) is where they fail to connect Episode 9 to that Anakin/Luke Skywalker story told in the first 6 episodes. Episode IX is easily a 4 star film but the more I've thought about this creative decision (or lack thereof) the more I realize this film and new trilogy ultimately ignores what the first 6 movies were all about and essentially rewrites the story to have Episode IX wind up in the same position as did Episode VI. As a standalone trilogy and focusing solely on Episode IX, I absolutely love Rey and Kylo Ren's story arcs. They are among the most powerful character stories you will find in the Star Wars universe and their stories were done justice. I think everyone can agree that Rey has definitely earned becoming that hero in this new trilogy and it is well deserved. Unfortunately, it comes at the expense of making The Return of the Jedi, and thus the original/prequel trilogy, meaningless. The writers of Episode IX cleverly filled this film with countless homages and callbacks to the original trilogy and some aspects of the prequels as well and in doing so, were able to hide and ultimately forget about the major theme and story of Episodes I-VI. The ending of Episode IX makes me wonder why these 3 new movies are called a part of the Skywalker saga. Sure, there is the symbolic aspect of it, in particular with those last few words spoken in the film. But in all fairness, it was more of a cop-out done by the writers to force this film and this new trilogy to \"fit in\" to the Skywalker saga after not being able to creatively make it happen in a way that took into account the Anakin/Luke story.....which was a true Skywalker story. The film closes the book on this saga but again, that was also already done in Episode VI....with even the final conflict and ultimate resolution resembling some aspects of Return of the Jedi as well.\nAs mentioned earlier, Episode IX delivers in many other good ways. The homages and call-backs are all fantastic and I found the General Leia scenes to actually fit in quite well to the film as a whole. The film's climax in particular was AMAZING. I will likely see this film again 2 more times just for the climactic battle at the end between........well I can't say who on here or it will spoil the scene. But it's a scene that is beautifully shot and full of the types of symbolism that makes Star Wars so powerful. Oh, and THAT lightsaber you see at a point in the movie where I can't say where or it's a spoiler??? THAT was incredible. Adam Driver and Daisy Ridley are the clear standouts in this final film, as they should be. Both their characters and their story arcs are wonderfully played out, even if I don't agree on a certain creative decision at the end.\nThe Rise of Skywalker is a highly entertaining film and is actually quite good on its own. It is definitely a must watch on the biggest screen possible. Personally, I'd recommend seeing it in true IMAX at the TCL Chinese Theatre, AMC IMAX Universal Studios Hollywood or at the Irvine IMAX Spectrum Theatre. All other \"IMAX\" theatres in Southern California are not true IMAX theatres and that includes San Diego. As stated, however, I can't forgive the writers nor the filmmakers for ignoring what the first 6 films were about and what the ending in Episode VI meant. That ending, and thus the conflicts, sacrifices done in those films, have now been rendered meaningless by this new trilogy. Plus, if you really boil it down, we're right back where we were again after Episode VI just now with different characters and a twist.","displayName":"Adrian D","displayImageUrl":"https://graph.facebook.com/v3.3/1530878404/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-31T16:31:24.657Z","updateDate":"2019-12-31T16:31:28.170Z","user":{"userId":"905421310","realm":"RT","displayName":"Adrian D","accountLink":"/user/id/905421310"},"score":3.5,"timeFromCreation":"4d ago"},{"rating":"STAR_5","review":"The movie wrapped up the Star Wars saga nicely. Bringing back Harrison Ford and Mark Hamill was a little eerie as were the scenes with the late Carrie Fisher. If only they had incorporated Yoda and Obi-Wan, too! :)","displayName":"david e","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-31T16:30:43.418Z","updateDate":"2019-12-31T16:30:43.418Z","user":{"userId":"9791942f-2928-462c-8e98-216c3da478fd","realm":"Fandango","displayName":"david e","accountLink":null},"score":5,"timeFromCreation":"4d ago"},{"rating":"STAR_0_5","review":"Using Palpatine was extremely lazy writing. It destroys the point of the originals and prequel, and really the flow of the last two movies just doesnt fit. \n\nThis .... is not the way","displayName":"Riaan G","displayImageUrl":"https://graph.facebook.com/v3.3/844647347/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-31T16:30:06.877Z","updateDate":"2019-12-31T16:36:39.746Z","user":{"userId":"908221717","realm":"RT","displayName":"Riaan G","accountLink":"/user/id/908221717"},"score":0.5,"timeFromCreation":"4d ago"}]}