{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY5OTQwNzIiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjNUMTg6NDU6MjEuNTQ0WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb19BMzk3MzkwRS01MEU5LTRFNUItQkVBOC03OUE3Qjg5OTQyRjkiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjNUMTg6NDY6MjkuODE5WiJ9"},"reviews":[{"rating":"STAR_5","review":"Awesome! WOW!!  Thanks JJ!!","displayName":"joseph a","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-23T18:46:29.819Z","updateDate":"2019-12-23T18:46:29.819Z","user":{"userId":"A397390E-50E9-4E5B-BEA8-79A7B89942F9","realm":"Fandango","displayName":"joseph a","accountLink":null},"score":5,"timeFromCreation":"Dec 23, 2019"},{"rating":"STAR_5","review":"This was visually stunning. A beautiful movies. I loved every moment and I plan to sneak away to this movie again soon.","displayName":"Selina S","displayImageUrl":"https://graph.facebook.com/v3.3/453169582278136/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-23T18:46:28.644Z","updateDate":"2019-12-23T18:46:43.522Z","user":{"userId":"978470989","realm":"RT","displayName":"Selina S","accountLink":"/user/id/978470989"},"score":5,"timeFromCreation":"Dec 23, 2019"},{"rating":"STAR_1_5","review":"This movie is an illogical hot mess. It also negates the entire story told by the original trilogy.  Darth Vader's sacrifice to save his son and restore balance to the force, didn't happen because Palpatine lives.  The happy ending at the return of the Jedi is an illusion.  Watching the original trilogy has always been a source of joy for me.  Not anymore.  How can one listen to the witty banter between Han and Leia without thinking of the absolute misery that lies ahead for then?  If you are going to give me tragedy, you'd better give me Hamlet.  And Luke will turn out to be a failure as a teacher and a coward as a Jedi.  Hiding out on Ahch To and not telling Han and Leia what finally turned their son to the Dark Side?  Please!  The last Skywalker gives his life to save the last Palpatine and for what?  Rey, who wanted a family, is alone, cut off for what should have been her soulmate.  Too little redemption and too late.  This is supposed to be a fairy tale.  Fairy tales have happy endings. Couldn't those high paid Hollywood writers come up with something better?","displayName":"Michael C","displayImageUrl":"https://graph.facebook.com/v3.3/10219963358010768/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":false,"createDate":"2019-12-23T18:46:24.002Z","updateDate":"2019-12-28T18:46:37.539Z","user":{"userId":"978470926","realm":"RT","displayName":"Michael C","accountLink":"/user/id/978470926"},"score":1.5,"timeFromCreation":"Dec 23, 2019"},{"rating":"STAR_2","review":"As a standalone movie it would've been a nice experience. As the final chapter of an epic saga, the plot holes and inconsistencies with previous movies made it a complete disaster.","displayName":"Bruno S","displayImageUrl":"https://graph.facebook.com/v3.3/623920947685478/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-23T18:46:23.489Z","updateDate":"2019-12-23T18:46:30.253Z","user":{"userId":"978470987","realm":"RT","displayName":"Bruno S","accountLink":"/user/id/978470987"},"score":2,"timeFromCreation":"Dec 23, 2019"},{"rating":"STAR_5","review":"Although this trilogy has left alot to desire, this movie is by far one of the best of the entire 9. Some say this made the Vader/Luke and their story irrelevant but I beg to differ. In the beginning (Episodes I-III) the theme was that the Dark Side was a pathway to many abilities some believe to be unnatural. The unnatural pregnancy/birth of Anakin was set forth by the Emperor, and although it set forth the motions of the Vader/Luke endgame, it still was not the true balance the Force needed to bring everything back to normalcy. This was actually a completely Dark Sided affair and the Luke saga only set forth into motion the coming of Rey and all of the Jedis coming together (within her) to eventually confront Sidious (all of the Sith) to bring a complete end and bring balance back to the force. Rey, born of Dark but brought to Light was the true meaning of \"balance\" in the Force. Loved it!","displayName":"Brandon L","displayImageUrl":"https://graph.facebook.com/v3.3/1106899319/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":false,"createDate":"2019-12-23T18:46:12.674Z","updateDate":"2019-12-23T18:46:19.780Z","user":{"userId":"909978214","realm":"RT","displayName":"Brandon L","accountLink":"/user/id/909978214"},"score":5,"timeFromCreation":"Dec 23, 2019"},{"rating":"STAR_5","review":"I'm a Star Wars fan, ever since I was a child. These stories changed my childhood and it helped me to become the person who I am right now. I know we all have our opinions, and just like what director and co-writer of this film J.J Abrams said, \"You can't please anyone.\" He's already expecting negative reviews, because of the choices he made for the film and some other aspects. But for me, although there are still a few unanswered questions, and after seeing the film TWICE, Star Wars: The Rise of Skywalker indeed ended with a super high satisfaction. There were a lot of jaw-dropping moments and entertaining moments, that made this film an epic roller coaster ride. If I was given the chance to rank all the nine films of the Skywalker saga, it would be at 4th or 5th. It had some flaws, but the nostalgia and the soundtrack gave the chills every single time, that made me forget for awhile the flaws that it had. And I also liked the irony that this is the end of the Skywalker saga and yet the title is \"THE RISE OF SKYWALKER.\" I hope that in the novels or in the expanded universe, Rey will still have a story to tell and also the rest of the characters, 'cause I wanted more of them. Their backstories and all the things that happened to them. That would be great.\n\nStar Wars: The Rise of Skywalker didn't please anyone, but it pleased me so much, and when it comes out on January 8th here in the Philippines, I will definitely see it again for the third time.","displayName":"Jethro P","displayImageUrl":"https://graph.facebook.com/v3.3/2836845093041352/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-23T18:45:58.917Z","updateDate":"2019-12-24T03:51:41.078Z","user":{"userId":"978470921","realm":"RT","displayName":"Jethro P","accountLink":"/user/id/978470921"},"score":5,"timeFromCreation":"Dec 23, 2019"},{"rating":"STAR_3_5","review":"Better than the prequels. I thought the action was good, the jokes landed well, and the pacing was OK. I felt that they didn't take any emotional risks; (slight spoiler) there was zero risk of a complex or dark ending. The power levels were over-the-top, easily matching and possibly surpassing the Legends (basically fan-fic) levels. The nostalgia references was also really high. It would be easier to accept (and enjoy) all that if this was the last ever Star Wars film, but we all know there'll be plenty more to the story. Still, the entire crew clearly cared about this film, they tried their best, and I enjoyed it.","displayName":"Tony D","displayImageUrl":"https://graph.facebook.com/v3.3/13754118/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-23T18:45:44.441Z","updateDate":"2019-12-23T18:45:53.480Z","user":{"userId":"916104666","realm":"RT","displayName":"Tony D","accountLink":"/user/id/916104666"},"score":3.5,"timeFromCreation":"Dec 23, 2019"},{"rating":"STAR_2","review":"Better than TLJ but that aint saying much. I know JJ Adams had to fix a ton of things from TLJ, movie should of been split into 2 or more movies to do so. What we got was a mess. Bring back the old evil from the originals was a bad idea. Making Rey a Mary Sue didn't help either. They wasted Finn, that character had so much potential, TLJ killed that and Rise Of Skywalker didn't do much to bring Finn back up. What was the whole point of Kylo Ren?? Gets beat by the same person every movie, then turns back to being Ben Solo, while the whole time in love with the person who beats him...what is this Twilight in space?","displayName":"William E","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-23T18:45:41.132Z","updateDate":"2019-12-23T18:46:26.470Z","user":{"userId":"978470933","realm":"RT","displayName":"William E","accountLink":"/user/id/978470933"},"score":2,"timeFromCreation":"Dec 23, 2019"},{"rating":"STAR_5","review":"It was a fabulous movie! Just what I wanted for Christmas! Stunning visuals and I loved where they went with the characters!","displayName":"h d r","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-23T18:45:33.168Z","updateDate":"2019-12-23T18:45:33.168Z","user":{"userId":"80232913-8635-448b-85ce-d31ff0fb81b7","realm":"Fandango","displayName":"h d r","accountLink":null},"score":5,"timeFromCreation":"Dec 23, 2019"},{"rating":"STAR_4","review":"There were a lot of stories JJ had to try to wrap up and although I may rate the movie like a 5 out of 10, it is mostly due to how poorly setup this movie was by the worst Star Wars movie of all time; last Jedi. He did a good job trying to wrap up the movie, but this trilogy portion of the saga was destroyed by changing directors and not having a three movie storyline and concept prior to releasing the force awakens.","displayName":"Bret B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-23T18:45:21.544Z","updateDate":"2019-12-23T18:45:29.069Z","user":{"userId":"976994072","realm":"RT","displayName":"Bret B","accountLink":"/user/id/976994072"},"score":4,"timeFromCreation":"Dec 23, 2019"}]}