{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MjE1NTk0MTEiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMTlUMjI6MzE6MjcuMzc0WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzg0NDE5MzIiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMTlUMjI6MzM6MjIuOTQ4WiJ9"},"reviews":[{"rating":"STAR_5","review":"Abrams has repaired the broken that Johnson made. It's a good end for the saga","displayName":"Nacho S","displayImageUrl":"https://graph.facebook.com/v3.3/10220999738445824/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-19T22:33:22.948Z","updateDate":"2019-12-19T22:33:32.548Z","user":{"userId":"978441932","realm":"RT","displayName":"Nacho S","accountLink":"/user/id/978441932"},"score":5,"timeFromCreation":"Dec 19, 2019"},{"rating":"STAR_4","review":"Yeah there's some cringey lines in it but it is important to take the movie into context of what the director and writers had to work with after all the plotlines that were upended from TLJ.","displayName":"Bruce C","displayImageUrl":"https://graph.facebook.com/v3.3/10200977317915374/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-19T22:33:14.571Z","updateDate":"2019-12-20T15:46:59.940Z","user":{"userId":"977048039","realm":"RT","displayName":"Bruce C","accountLink":"/user/id/977048039"},"score":4,"timeFromCreation":"Dec 19, 2019"},{"rating":"STAR_5","review":"i'd give an 8 to 9.. loved the movie, despite jedis and siths looks overpowered, thre was a satisfatory explanation to that, good conclusion to the saga","displayName":"Victor P","displayImageUrl":"https://graph.facebook.com/v3.3/10201011009795960/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-19T22:33:03.381Z","updateDate":"2019-12-19T22:33:12.984Z","user":{"userId":"978441936","realm":"RT","displayName":"Victor P","accountLink":"/user/id/978441936"},"score":5,"timeFromCreation":"Dec 19, 2019"},{"rating":"STAR_0_5","review":"I cannot imagine a worse storyline that made less sense that took less effort that contradicted the lore more that was less entertaining and that could have ruined the joy of star wars more than what they did in episodes 8 and 9. this movie was terrible in every way and they should be ashamed of it. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-19T22:33:02.621Z","updateDate":"2019-12-19T22:33:44.634Z","user":{"userId":"965946906","realm":"RT","displayName":null,"accountLink":"/user/id/965946906"},"score":0.5,"timeFromCreation":"Dec 19, 2019"},{"rating":"STAR_3_5","review":"It's definitely going to rile up a few people, especially to those who loved The Last Jedi, as The Rise of Skywalker almost acts as a course correction for that movie. At the end of the day, I personally found enjoyment in the movie, leaving me somewhat satisfied, although I can definitely see the reasons why people might not like it.\nThe characters have more to work with in this movie, the action and visual effects were great and the pacing was okay for most of the time. Although, sometimes it felt like there is too much 'movie in this movie'.","displayName":"Benjamin K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-19T22:32:44.535Z","updateDate":"2019-12-19T22:32:44.535Z","user":{"userId":"978441918","realm":"RT","displayName":"Benjamin K","accountLink":"/user/id/978441918"},"score":3.5,"timeFromCreation":"Dec 19, 2019"},{"rating":"STAR_2_5","review":"Great direction, poorly written and visually pleasing ending to the saga.\n\nTo answer simple questions:\n\nDid I enjoy this movie? Yes. Could it have been better? Yes. Could the whole trilogy have been better? Yes.\n\nMy feelings now:\n\nRelief. Relief that this is now finally over, we can move on. To new stories, new characters and a new part of the galaxy far far away.","displayName":"Ben W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-19T22:32:16.084Z","updateDate":"2019-12-28T14:00:38.026Z","user":{"userId":"976107488","realm":"RT","displayName":"Ben W","accountLink":"/user/id/976107488"},"score":2.5,"timeFromCreation":"Dec 19, 2019"},{"rating":"STAR_5","review":"The movie was fantastic, was the perfect send off that the series needed, the best possible way to end the entire Skywalker saga. I cannot fathom why people hate on this movie - it was the pure essence of Star Wars and can't wait to see it again!!! 10/10","displayName":"Witt C","displayImageUrl":"https://graph.facebook.com/v3.3/100000453927796/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-19T22:32:11.927Z","updateDate":"2019-12-19T22:32:19.814Z","user":{"userId":"972595916","realm":"RT","displayName":"Witt C","accountLink":"/user/id/972595916"},"score":5,"timeFromCreation":"Dec 19, 2019"},{"rating":"STAR_5","review":"Epic and satisfying in every single way. A must see now and for future generations.","displayName":"Rosie F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-19T22:31:54.852Z","updateDate":"2019-12-19T22:32:03.055Z","user":{"userId":"978438732","realm":"RT","displayName":"Rosie F","accountLink":"/user/id/978438732"},"score":5,"timeFromCreation":"Dec 19, 2019"},{"rating":"STAR_2_5","review":"The plot is meh and lacks imagination and seems like they just took seems from endgame and repacked them and the cartoony effects this is not what Star Wars is like the rest of the sequel trilogy they just keep getting worse Disney do not understand how to make a Star Wars movie correctly rogue one was descent but episodes 7-9 are just meh","displayName":"Ben M","displayImageUrl":"https://graph.facebook.com/v3.3/792212354649490/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-19T22:31:30.597Z","updateDate":"2019-12-19T22:31:39.291Z","user":{"userId":"978441920","realm":"RT","displayName":"Ben M","accountLink":"/user/id/978441920"},"score":2.5,"timeFromCreation":"Dec 19, 2019"},{"rating":"STAR_4","review":"I attended a press screening last Tuesday. Here is my review via BatmanOnFilm.\n\nEven though Batman is my favorite fictional character of all time; Star Wars remains my favorite franchise of all time.\n\nStar Wars: The Rise of Skywalker (written by Chris Terrio & JJ Abrams) is the last film, in the 9-part Skywalker saga that George Lucas launched in 1977 with \"Star Wars\" (later deemed, Episode IV: A New Hope.\n\nI was able to see an early screening held for online press on Tuesday — and I left the theater with a feeling of conflict, disappointment, excitement and fulfillment.\n\nTo say this film is a mixed bag for me, would be quite an understatement.\n\nLet me address a few issues I had with the film and then end on what I loved about it. Because that is the kind of a guy I am. Always ending with positive feelings!\n\nRian Johnson's 2017 \"The Last Jedi\" was a critically acclaimed, bold and beautiful film. The issue that Lucasfilm had with it, is that online fandom (relatively small, but loud group of folks) basically hated it.  And when you have several thousand people trolling and spamming the internet with their ire of a movie, it can eventually morph itself into validity.\n\nIn other words, the fans that hated it and were so active on social media with said hatred, that they succeeded in owning the narrative to an otherwise very successful movie.\n\nSetting aside the racist/sexist faction of that fandom, lets address the thousands of good faith fans that truly hated Luke's arc, Rey's lack of backstory (who are her parents?!), Snoke's origin, etc.\n\nDirector JJ Abrams and his co-writer Chris Terrio seem to go out of their way to please those fans.  Far too much of The Rise of Skywalker feels like contrived fan service that reacts directly to the online fandom that hated The Last Jedi.\n\nAnd it weighs down the film, a bit.\n\nNow, I would argue that if the online backlash did not exist — or if I was unaware of it — then I don't think I would view this film from that perspective.  (Example: My wife is 100% unaware of online fandom, she liked The Last Jedi and I bet she will love TROS.)  But in the end, it does exist and The Rise of Skywalker often plays like an unnecessary apology letter to a relatively small portion of pissed off fans.\n\nWith that said — and I say this as someone that absolutely loves The Last Jedi — many crucial elements from that movie remain, and JJ Abrams incorporates them beautifully into the new film.\n\nSo, for every \"apologetic\" moment, there is also lovely moments that 100% pay homage to The Last Jedi.\n\nAnd for that, I am grateful.\n\nIt is also worth noting, that once again the cast is stellar.\n\nKylo Ren (Adam Driver) is, by far, the most interesting Star Wars character ever to be put on film.  I would even go as far to say that The Rise of Skywalker is as much his story, as it is Rey's (my 3rd favorite Star Wars character, right behind Luke).\n\nPlus, many of the \"fan service\" moments land; and when they do, it will make you want to stand up on your feet and explode with joy.  For someone that loves all 3 trilogies, those moments were a real treat for me.\n\nIn the end, is The Rise of Skywalker a mixed bag?\n\nSure.\n\nBut even though I rolled my eyes more times than I did watching The Phantom Menace for the first time, I also cried for the first time while watching a Star Wars movie.\n\nCried.\n\nLike, actual tears.\n\nThree times.\n\nAlso, I am looking forward to seeing it again this week and who knows, maybe I will like it even more than I do now.\n\nPlease go see it. Enjoy it. And ignore online noise, too.\n\nBut after you do, I will gladly accept your acknowledgement that you now know just how brilliant The Last Jedi truly was. – Rick Shew\n\nGRADE: B\nPS: Billy Dee Williams is still the coolest guy in the room.","displayName":"Rick S","displayImageUrl":"https://graph.facebook.com/v3.3/667754072/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":true,"createDate":"2019-12-19T22:31:27.374Z","updateDate":"2019-12-20T17:18:25.533Z","user":{"userId":"921559411","realm":"RT","displayName":"Rick S","accountLink":"/user/id/921559411"},"score":4,"timeFromCreation":"Dec 19, 2019"}]}