{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzg0NDk4NzAiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjBUMTQ6NTE6NDcuMzQwWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb19EQ0E0MEZFNS0yRTE4LTRDRDEtODYwQi1CREIxREZFNjg4NUYiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjBUMTU6MTQ6MjguNjk0WiJ9"},"reviews":[{"rating":"STAR_5","review":"I loved it, I really enjoyed the adventure the theatre was full of cheers, Rey, Finn & Poe are awesome.","displayName":"Facebook U","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T15:14:28.694Z","updateDate":"2019-12-26T16:20:53.362Z","user":{"userId":"DCA40FE5-2E18-4CD1-860B-BDB1DFE6885F","realm":"Fandango","displayName":"Facebook U","accountLink":null},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_3","review":"It's not as bad as the critics say but it's not as good as the other recent Star Wars movie. Does wrap up the saga quite nicely. It doesn't really deserve all the hate it gets from the critics, it's better than the prequels","displayName":"Jordan L","displayImageUrl":"https://graph.facebook.com/v3.3/211774106506222/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T15:09:00.219Z","updateDate":"2019-12-31T17:34:32.118Z","user":{"userId":"978450028","realm":"RT","displayName":"Jordan L","accountLink":"/user/id/978450028"},"score":3,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_2","review":"Probably the worst Star Wars movie ever along with episodes 7-9","displayName":"Sergio","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T15:08:19.655Z","updateDate":"2020-01-01T04:56:59.417Z","user":{"userId":"D88D676B-53D6-439D-AE8E-6A99CA9AB676","realm":"Fandango","displayName":"Sergio","accountLink":null},"score":2,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"Best movie of the year. Bleep the critics","displayName":"Donovan20 S","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T15:02:54.364Z","updateDate":"2019-12-20T21:40:38.440Z","user":{"userId":"976926348","realm":"RT","displayName":"Donovan20 S","accountLink":"/user/id/976926348"},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"I enjoyed it. It had good pace, a few twists and turns, beautiful to watch and they did a good job pulling it all together. Star Wars will always have its haters, no matter what. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T15:01:32.408Z","updateDate":"2019-12-22T19:16:13.634Z","user":{"userId":"944129834","realm":"RT","displayName":null,"accountLink":"/user/id/944129834"},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"2nd time seeing it, still love the movie and happy with the ending","displayName":"Richard","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T15:00:21.937Z","updateDate":"2019-12-30T18:33:25.405Z","user":{"userId":"0557AC86-6F73-4472-94E8-DB94384BAC94","realm":"Fandango","displayName":"Richard","accountLink":null},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_4","review":"This movie was made for the fans, people who love Star Wars, it tries to fix the issues The Last Jedi introduced, it doesn't work sometimes, but it does a good job giving fans what they want.\nIt's a good ending for this sequel trilogy, I think each trilogy works as it's own, and each one has its own ending.","displayName":"Jorge A","displayImageUrl":"https://graph.facebook.com/v3.3/2729352013754572/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T14:59:40.646Z","updateDate":"2019-12-20T17:18:25.479Z","user":{"userId":"978449946","realm":"RT","displayName":"Jorge A","accountLink":"/user/id/978449946"},"score":4,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"Amazing!! Hands down one of the best!","displayName":"Gvsosa","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T14:59:30.210Z","updateDate":"2019-12-28T19:55:38.488Z","user":{"userId":"488CC80A-45D8-485D-A876-B26755024E09","realm":"Fandango","displayName":"Gvsosa","accountLink":null},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_4","review":"Helps to wash away some of the foul aftertaste left by The Last Jedi.","displayName":"Patricio G","displayImageUrl":"https://graph.facebook.com/v3.3/1413710402/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T14:54:21.680Z","updateDate":"2019-12-20T18:22:16.596Z","user":{"userId":"912533145","realm":"RT","displayName":"Patricio G","accountLink":"/user/id/912533145"},"score":4,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_1_5","review":"The Rise of Skywalker is not a bad film. On the surface, it reads like any other Star Wars film that has preceded it. On a first viewing, perhaps, one might not even notice the glaring issues with the film and feel content with most of it. However, The Rise of Skywalker falls prey to a very jarring system malfunction. Despite heavy marketing that declared this — THE END OF THE SAGA — it leaves audiences with more questions than answers. Not only did this film create more loose ends in its eleventh hour, rather than tie them off, but it untied several previously resolved loose ends. \n\nRead no further if you desire to remain unspoiled by the film that had its entire plot leaked nearly six months ago, which Disney and Lucasfilm made no attempt to remove from the internet. Only to then have it subsequently spoiled, in full, by Burger King — of all businesses — a week before its release. \n\nThat is not Poe Dameron's backstory. I have no idea where J.J. Abrams birthed this strangely shoehorned spice smuggler backstory (which mind you, seemed to only serve as a poorly contrived reason for him to know Zorri Bliss, played by J.J.'s friend and the incredibly talented Kerri Russell) but it does not fit the established, and well documented, account of Poe's pre-The Force Awakens existence. Since his introduction in 2015, there have been several comics and novelizations that have delved into his story. He was the son of Shara and Kes Dameron, members of the Alliance to Restore the Republic (Shattered Empire, which was published in advance of The Force Awakens). Poe grew up to become a pilot, training in the New Public Defense Fleet (Before Awakening, which was published in tandem with The Force Awakens premiere). \n\nI am not the person to fully delve into this matter and I will leave this to be fully addressed by other members of this fandom, but I have seen numerous Latinx members of the Star Wars community call into question why Abrams chose to turn the only Latino member of this trilogy in a drug dealer, when his pre-established and well-documented canon origin is a Resistance pilot. To me it felt like a weak attempt to turn him into a Han Solo type character, without any regards to 2019-optics. \n\nNot only did this film forget pre-established canon material, it often felt as though it forgot itself. When presented with challenges, they were often resolved nearly immediately giving the audience little time to breathe. There were so many of these moments that this review would be significantly longer if I enumerated them all, so I'll dwell on one of the top ones that made me mutter \"what?\" in the theatre (don't worry, my auditorium was so noisy and no one was disturbed). Zorri Bliss finds Poe and Co. upon their arrival on Kijimi with shocking ease, she threatens to kill them and promptly realizes that Rey is the scavenger that the First Order is looking for and then threatens to turn her in for the bounty. Rey promptly knocks her down with her staff and suddenly Zorri is more than happy to assist them and take them to the cutest little droidsmith, Babu Frik. Once the issues with C-3PO is resolved, she gives up her one chance out of Kijimi without a second thought. Not only is this all breezed through at a record speed, but her ticket off of Kijimi literally lets Poe and Co. board a First Order vessel without much initial fanfair, to rescue Chewie. There was no challenge in that entire scenario. Even when there were suggestions of challenges they were easily swept aside, posing no real challenge to the team of heroes. Challenges throughout the entire film were simply weak impressions of what they should've been, situations I hope are given more weight and time to breathe in the forthcoming novelization. \n\nBut perhaps, the greatest travesty of this film, is the complete underutilization of Adam Driver. The same Adam Driver who has, in case you've missed out, been nominated by the Academy, the Golden Globes, the Emmys, the Tonys, the BAFTAs, and the Screen Actors Guild. He has been nominated for eighty-four awards and won thirty-three of them for his performances in the past ten years. From the moment that Ben Solo is redeemed and throws his lightsaber into the ocean of Kef Bir to the moment that he unexpectedly fades away after kissing Rey — he utters one line. \"Ow.\" Of course, Driver manages to make the best out of the silent film of his remaining moments on screen, performing an incredible blaster fight sequence worthy of his father Han Solo, showing the roguish shades of redemption we were robbed of. \n\nThe audience in my theater cheered at the moment when he climbed his way out of the pit that he had been unceremoniously yeeted into by Palpatine. The enthusiasm building around me as he restored Rey's life and they finally kissed — sealing the deal on three movies worth of latent sexual chemistry — only for him to promptly die without a word uttered. While I sobbed in my seat, the audience around me was silent. You could have heard a pin drop throughout the celebratory scenes, confusion lingering in the auditorium, up until the moment that the story transitioned to Tatooine and several audience members broke the silence to whisper about the return to ‘the beginning'. A stray cheer and a whoop fluttered through the crowd when Leia and Luke appeared to Rey. Why was Ben Solo not stood beside his mother? \n\nPersonally, Ben Solo's prompt demise seemed like the product of bad storytelling. It was rushed, and by the time the audience processed the confirmation of Rey and Ben's affection for one another, his death had taken them by complete surprise. His death seemed in conflict with the dialogue he shared (some, entirely recycled from J.J.'s The Force Awakens) with his father after his mother's death. Both Han Solo and Princess Leia died trying to bring their son back to the light, they succeeded — only for him to die with no real acknowledgement. \n\nTo those of us who loved Kylo Ren and rooted for his ‘Bendemption' all along, his death felt like a smack in the face when paired with the release of The Rise of Kylo Ren, a canon comic exploring his origins. On the eve of The Rise of Skywalker's premiere, the comic revealed Ben Solo's innocence in what happened at the Jedi Temple — the story that Luke Skywalker told. Ben Solo was the product of Emperor Palpatine's manipulation through different means since he was in his mother's womb. The film was less about the Rise of Skywalker and more about the tragic end of the Skywalkers. A film branded as ‘hopeful' felt devoid of any and all hope. I still wonder how Rogue One managed to kill off its entire cast and still manage to be the most hopeful film under Disney's ownership of Lucasfilm. \n\nI could expand upon the sheer travesty of Ben Solo's butchered redemption arc and unnecessary death, but there are other issues that need to be addressed.\nUpon watching this film, I understand now why Kelly Marie Tran was absent from early marketing images. She is hardly in this film, when she was — without a doubt — a stand out performance and beacon of hope in The Last Jedi. Not only was she undervalued as a member of this cast, but her character served no purpose whatsoever. Her potential relationship with Finn (they shared that brief kiss, after all!) was diluted to a shoulder pat. I desperately hope that Disney and Lucasfilm expand upon her story through another media, whether it's a spin-off story with her and Jannah kicking ass across the galaxy on Disney+ or her very own comic series, but her character bore so much potential. Potential that The Last Jedi's director Rian Johnson left on the table, that J.J. apparently chose not to take. \n\nThroughout the entire course of the film, Finn has something to tell Rey. It's brought up several times, as a reminder to the audience. Finn has something to tell Rey! But he never does. He doesn't even tell Poe when he reminds the audience, I mean, asks Finn about it later on. Of course, it's vaguely shown, rather than told, by Finn exhibiting evidence of being Force sensitive. A fan theory I've personally clung to since The Force Awakens. He vaguely discusses it with Jannah, shows it when he feels Rey die, but otherwise never verbally confirms or reveals what he intended to tell Rey. Stellar storytelling there. All of this aside, his character lacked a purpose in the film, outside of yelling \"Rey!\" and having a few good comedic moments with Poe Dameron. I longed for The Last Jedi, that gave him his own adventure with Rose Tico, where he matured into the character he could've been in The Rise of Skywalker. At least The Last Jedi, Finn's character had his own journey outside of propping up others. \n\nI still have not found the words to fully elaborate how disappointed I am with Rey's story. Some people have expanded upon this in great depth and I am in awe of their analysis. Throughout The Force Awakens and The Last Jedi her story was that she was a no one, it was reiterated and reinforced and it felt liberating to have a character unattached to anyone in the previous series. A strong female character, unattached by the weight of male characters, prepared to make a name for herself. Instead all of that potential was haphazardly thrown away for an undercooked story about her being the heir of Palpatine. Which on the surface sounds cool, until you read deeper. Why was Palpatine never hinted at in The Force Awakens? General Pryde's character could have easily existed then, serving to provide an expositional line about his lifelong history of serving the Emperor. There was ample time for Snoke to allude to Palpatine in The Last Jedi. But of course, all of this would have occurred, had J.J. — or anyone — had an overarching plan for the trilogy. Not to mention, the throwaway line about Luke and Leia knowing about her true origin the entire time was so gimmicky. As if to say, \"Ha! See, everyone knew! I didn't come up with this entirely last minute after reading a couple interesting fanfics.\" \n\nNot only did the Palpatine storyline seem to rely solely upon the audience accepting the facts that they did not have, nor were they ever given, the dyad lore was entirely useless in the end. In essence, the idea of Rey and Ben being a dyad seems fascinating. But it's presented to the audience through exposition, loosely explained, and what is explained turns out not to be true. In the end, Rey defeated Palpatine alone, and despite being deeply connected to Ben, he simply died without any effect to Rey. So much for them rising and falling together like the loose dialogue surrounding the dyad appeared to allude to. Again, this aspect of the story should've been introduced at some point in The Force Awakens and expanded upon in The Last Jedi. \n\nRey closes the film out on Tatooine with BB-8, staring into the binary suns that look strangely like her little round droid friend, after rebranding herself as Rey Skywalker. The encounter feels forced. At the beginning of the film an inhabitant of Pasaana asks for her surname and she has none to give, at the close of the film a random old woman on Tatooine does the same. It's a forced moment to make you go \"aw\" but for me it felt contrite and cringe-worthy. A valiant attempt, I suppose. \n\nThe Rise of Skywalker managed to wrap everything up into a neatly tied bow, a bow so extravagant that you somehow overlook that the box wasn't wrapped and, in fact, it's empty. At its core, the film was the victim of an absent structure and absolutely no pre-planning. Key parts of the story clearly belonged in the second act of a trilogy. Even if Disney had intended to have three separate writers and directors for the trilogy (after all, Colin Trevorrow was slated to originally create the final installment) they should've had a clear, overarching plan for the trilogy. In the end the trilogy tried. It really did. But after forty-two years of Emperor Palpatine screwing with the Skywalkers, it seems weirdly unsettling to quietly accept the death of last Skywalker, while a Palpatine is walking around using their surname. \n\nLingering Thoughts: \n\n➼ How did C-3PO manage to be the best part of this film? I was rooting for him to die beforehand.\n\n➼ Remember when they said they promised not to CGI Leia? Yikes.\n\n➼My audience cheered when Hux helped Poe and Co. escape. Shoutout to the person who went \"that's it?\" when Pryde killed him forty-five seconds later. So much more could've been done with that. There was just no breathing room there. \n\n➼Also, Pryde was just an older Hux. What was the point? Sorry, Richard. I love your enthusiasm but your character served no purpose. \n\n➼What was with the heavy focus on Rey watching the children on Pasaana, only to be promptly segwayed into a Force Skype with Kylo Ren? That's some, uh, untapped implications there from a literary analysis stand point. Especially paired with some of the other thrown away lines about giving someone your lifeforce, the future being within Rey, and so forth. \n\n➼ Pst, Daisy and Adam, what was with all those comments on the press tour about how badly both of your characters wanted families? Was there a completely different cut of this movie you filmed? I would love to see that. \n\n➼ Where were half of this film's scenes? It felt so empty. So much connective tissue missing, moments that felt rushed, and lines that seemed to allude to other lines that got lost on the cutting room floor. \n\n➼Zorri Bliss was a lame way to give Kerri Russell a role. Literally. What purpose did she serve? If you cut her out of the film, nothing would change. \n\n➼ Why did you bring back, arguably, one of the best villains in the saga and not even explain his return. Why was Palpatine even brought in? What? Why? Ugh.\n\n➼ I'm impressed by how little lense flare there was. Solid growth, J.J. Solid growth. \n\n➼ I will never be over Ben's smile the second before he died.\n\n➼ Why couldn't we just get FinnPoe? Why? I'm with Oscar and John on this one.\n\n➼ Why was Ben not a Force Ghost at the end? Was he just deemed unimportant, you know the character that ranks #1 over all of the new characters in this trilogy. Is he not really dead? What's the story here?\n\n➼ Where did Rey get her lightsaber?\n\n➼ BEN SOLO DESERVED BETTER.","displayName":"Maggie L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":true,"createDate":"2019-12-20T14:51:47.340Z","updateDate":"2019-12-21T21:01:12.962Z","user":{"userId":"978449870","realm":"RT","displayName":"Maggie L","accountLink":"/user/id/978449870"},"score":1.5,"timeFromCreation":"Dec 20, 2019"}]}