{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NTkxNTk3NzciLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjBUMTc6MTQ6MTkuMzQyWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzg0NTExOTMiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjBUMTc6MTg6NTAuNDAwWiJ9"},"reviews":[{"rating":"STAR_2","review":"This film wasn't nearly as good as I was hoping it would be.  It's a typical JJ Abrams film that's non-stop and high speed with shaky camera shots to confuse the Moviegoer into believing they're watching something better than what it is, and when the \"mystery box\" surprise is revealed at the end, it's crap.\n\nToo many plot holes created during the film that you can sink the entire movie of Titanic into with room to spare and destroyed prior cannon in the worse kind of way, but I was expecting as much from JJ Abrams.\n\nTo Many Elements \"borrowed\" through out the movie from Empire Strikes Back and mix in a very lame showdown that reminded me too much on Return of the Jedi.\n\nIf you thing The Empire Strikes Back and Rogue One where the best of the Star War Films of the entire Saga, then this film isn't for you and you'll be like me thinking that this film was complete crap and using more colourful words walking out.  If you have ADD and get distracted by shiny objects and forgot story plot lines, then this film is for you!\n\nI will admit there where a very few good scenes in the movie, but that's why it didn't get a 1 Star Review.","displayName":"David H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":true,"createDate":"2019-12-20T17:18:50.400Z","updateDate":"2019-12-20T17:18:50.400Z","user":{"userId":"978451193","realm":"RT","displayName":"David H","accountLink":"/user/id/978451193"},"score":2,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"I created an account to let all old-school Star Wars fans know that this movie is absolutely fantastic ! Don't miss it cause of the critics rating.\n\nI have no idea what's up with the so-called professional critics but apparently they really do not understand what Star Wars is all about. This movie is a true adventure film, packed with heart and action. And the final is the most epic thing I've seen since decades. See it in the loudest and biggest cinema near you! Thank you JJ.","displayName":"Flo T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T17:18:37.395Z","updateDate":"2019-12-20T17:41:51.620Z","user":{"userId":"978451049","realm":"RT","displayName":"Flo T","accountLink":"/user/id/978451049"},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_4_5","review":"Coming off The last Jedi this movie had a lot to answer, but with the time allowed it answered on all fronts.","displayName":"Nick E","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T17:18:33.309Z","updateDate":"2019-12-20T17:18:35.898Z","user":{"userId":"976962515","realm":"RT","displayName":"Nick E","accountLink":"/user/id/976962515"},"score":4.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_4","review":"Has some flaws, but has the fun, adventure, and spirit of what a Star Wars movie is meant to be.","displayName":"Jonah P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T17:18:09.631Z","updateDate":"2019-12-20T17:18:15.650Z","user":{"userId":"978109000","realm":"RT","displayName":"Jonah P","accountLink":"/user/id/978109000"},"score":4,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"I thought it was awesome. It was a very satisfying end to the core Skywalker Nonology and opened up a future for the new characters in the universe should they choose to do so (probably). Do not trust the bad critic reviews. This movie was awesomely fun and great to behold. Make up your own kind and go enjoy the film.","displayName":"Jason C","displayImageUrl":"https://graph.facebook.com/v3.3/216703542664458/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T17:18:02.745Z","updateDate":"2019-12-20T17:18:08.186Z","user":{"userId":"978451270","realm":"RT","displayName":"Jason C","accountLink":"/user/id/978451270"},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_3","review":"Movie was rushed and the plot was weak.","displayName":"Jerry","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T17:17:39.769Z","updateDate":"2019-12-27T07:12:34.774Z","user":{"userId":"b1896cf7-aae3-4995-95ea-3b9989f8d78b","realm":"Fandango","displayName":"Jerry","accountLink":null},"score":3,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_3_5","review":"Wonderful movie with an epic ending, they fixed every flaw in the last movie.\nThe 1.5 star I removed is because they didn't bring Anakin or Obi-Wan which made me a little disappointed but overall is great.","displayName":"Ahmed E","displayImageUrl":"https://graph.facebook.com/v3.3/1009050826111373/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T17:17:08.648Z","updateDate":"2019-12-20T17:18:11.199Z","user":{"userId":"978427192","realm":"RT","displayName":"Ahmed E","accountLink":"/user/id/978427192"},"score":3.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_4","review":"Is it perfect? No. Did one of the main stars die before filming? Yes. Did that mean they had to re-write substantial portions of the film and plot lines? Probably. Where there gaping holes and dialogue that feels forced and rushed? Like you read about. \n\nI don't think J.J. Abrams was given the opportunity to make the exact film he wanted due to the tragic and very sad, unexpected passing of Carrie Fisher. Did he do the best he could with the negative press and reviews from fans alike of the The Last Jedi? I think so. He went back to what worked for The Force Awakens. He gave old Star Wars fans a nostalgia filled movie that feels like the same films we have already watched with nothing too new or too daring. \n\nThe reveal of Rey's lineage was a good surprise twist. I enjoyed the film from start to finish. I liked it more than any of the dreaded prequels. However after seeing it Thurs night, and then watching about 30 minutes of clips from the prequels featuring Anakin's fall to the dark side and the rise of the Evil Emperor Palpatine, I now can appreciate just how well those prequel films were written, how well they were cast, and how good the actors were (only now in hindsight.) I still think Hayden Christiansen's wooden and boring performance is the low point of the prequel trilogy, with the one exception being his transformation into pure evil and hatred at the end of Revenge of the Sith, turning into Darth Vader... but as a whole... the writing on The Rise of Skywalker is some of the most mailed in, least inspiring, least effective and least exciting of all 9 films. You always know where the film is going, you don't really feel like you're on an epic saga, massive ending journey. You just go scene to scene to help along the obvious plot lines\n\nSadly my biggest critique is that 2 of the 3 \"new Trio\" never really worked for me. There were a few moments where Boyega's boyish charm and genuine surprise made me laugh or smile in the first few movies. He doesn't really get past that. It never elevates. Not believably. None of that here. Isaac never cut it for me. He doesn't have the swagger or the charm, his one liners that should put everyone on the floor seem flat and miss their mark. He plays it too cool, so cool it's uninteresting. I always liked Rey, but her modern saga counter parts that could have lifted this film past it's flaws, could have made us focus on the fun and excitement of it all, actually pull down the scenes that they're in, leaving the only truly enjoyable and memorable moments of scenes with the old cast members, or those with Rey, Kylo Ren, and Palpatine. \n\nI'm also sad they didn't give Billie Lourd more to do. If she had joined in with the main team for the final battle, played a larger roll, it would have given the film some more heart for nostalgic fans and helped us rally behind an Epic battle with the rest of the cast that otherwise we didn't care that much about since Boyega and Issac never make us care enough about their characters to worry about their fate. She could have filled in for Leia, with the heart this film needs. Old school fans would have rallied for her just because we cared so much about her Mom. Yet all she has is a few throw away lines and scenes. Not much of an homage. \n\nBack to Boyega and Issac. I don't think they're bad actors. I think a big part of it is due to the writing and dialogue they're given to work with, but I still feel like they could have at least taken their energy to another level. Something was just missing from them - the whole trilogy. Something that Hamill, Ford, Williams, and Fisher had in spades. You can't write it, you can't edit it in, it's just a spark. A spark that's missing here, that could have lifted this film from good, to great. An Epic Journey. A thrill ride where you can't think about the issues of the film, writing or pacing, because you're too busy laughing and enjoying the film and the characters. The believability. The stakes. The heart. \n\nThis film misses that mark big time. In the end it's fun. It tells a story. There are amazing nods and set pieces that bring up some serious nostalgia for the original trilogy. Sadly that just reminds me how much better those original films and cast chemistry were than this generation. It wasn't cast as well from the get go. The writing wasn't as good. The spark wasn't there. I'd watch it again, I'll own this trilogy in Blu Ray (I still wont buy the prequels). It was a great effort, it pulled on my nostalgia string, but it wasn't life changing. I'm not sure it made the Star Wars universe better. It definitely hurt it a little but in places. I know thousands of people poured their blood sweat and tears into the making of these films. (For that alone I give 4 stars) I appreciate all of that, but it could have been so much more. It could have been a contender.","displayName":"Tim P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T17:16:00.747Z","updateDate":"2019-12-20T17:17:56.264Z","user":{"userId":"901275193","realm":"RT","displayName":"Tim P","accountLink":"/user/id/901275193"},"score":4,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_2","review":"Papaltine back without explanation was a ridiculous attempt to please the fans and, this added to the fact that a garbage collector  is the most powerful jedi in the galaxy and do things that many took years to do, is just horrible. Yes, this movie has good aspects, but It all gets Lost in the middle of this huge fan service.","displayName":"Joo M","displayImageUrl":"https://graph.facebook.com/v3.3/111678483666336/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T17:15:00.278Z","updateDate":"2019-12-20T17:21:28.632Z","user":{"userId":"978451179","realm":"RT","displayName":"Joo M","accountLink":"/user/id/978451179"},"score":2,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_0_5","review":"A vapid, \"fightless\" (no epic fights ), safe, boring, redundant cookie-cutter StarWars film. literally the worse one yet. the critics are right this time. \n\nboring music\nboring visuals\nboring story\nboring fighting \nno martial arts(so sadd)\neverything is blan. \ncliche ending and martyrdom...\nvery safe, censored, and scared film.\n\nall forms of eastern philosophy and thinking are completely removed. take note that Lucas was inspired by Akira Kurosawa films.  hence we get the following turn of events.\nakira kurosawa films > geroge lucas stars > disney starwars.... the further we come away from the original idea the more lost we get. \n\nat least the last Jedi physically manifested the dao. \n\nthis film isn't even suitable for children to watch.","displayName":"Wolfie W","displayImageUrl":"https://graph.facebook.com/v3.3/100000467336098/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T17:14:19.342Z","updateDate":"2019-12-23T23:49:35.728Z","user":{"userId":"959159777","realm":"RT","displayName":"Wolfie W","accountLink":"/user/id/959159777"},"score":0.5,"timeFromCreation":"Dec 20, 2019"}]}