{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb19DODFDRUQ4RS1BNjc3LTRDOTQtODQ0NC1GRTVFMDEyRTc0OUYiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjBUMDY6MzQ6NTcuNzAyWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzg0NDU5NjgiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjBUMDY6NTM6MDMuNzczWiJ9"},"reviews":[{"rating":"STAR_1_5","review":"I've witnessed the death of Star Wars. The Rise of Skywalker is a desperate, disrespectful, and abysmal finale to a saga that once inspired entire generations of moviegoers. \n\nAs a standalone film, based solely off its own merits, The Rise of Skywalker is a horrendous mess where flashy visuals are meant to nullify the film's sheer lack of substance. It's primary weakness is that the pace of the movie is fast, way too fast. Settings change so rapidly that entire set pieces are simply afterthoughts for viewers trying to catch up to what's happening with the main characters. This sets up a scenario where frustratingly fast trips from planet to planet, in search of strange, new devices, becomes the catalyst for the plot's development. Storytelling is secondary to deus ex machina and seemingly endless exposition. There is no linear growth of a cohesive story and nostalgia is weaponized to try and make us forget about how awful this movie really is.\n\nUltimately, the film is utterly devoid of any actual narrative. Moments that were clearly supposed to resonate with me, the viewer and life-long Star Wars fan, felt empty and meaningless. The events of the previous film cheapened the attempts to reintroduce elements of the Star Wars I grew up with. Every time some new, nostalgic shot was aimed in my direction, it simply whizzed by, having no impact on me whatsoever. In the climax of the movie, all I could think was: \"It's too late.\" The empty vessels that are supposed to be the main characters of this trilogy did absolutely no justice to their predecessors and left a ragged scar on the legacy of the franchise. It's not surprising though. When you build shallow stories using characters with charisma of an old Poptart, you set the stage for failure.\n\nThe real tragedy is that throughout this film, there were brief segments of what the JJ Abrams' trilogy could have been. The actors, despite being handed terrible scripts, really made the most of what they were given. The set pieces, while unique and memorable, were overshadowed by the brevity of their appearance. Characters that could have been compelling and genuinely likable, were given the scraps of lazy, complacent writing. I will always wonder what this story could have looked like if it was generated by a single writing team and guided by appropriate left and right lateral limits that respected the Star Wars universe.\n\nLastly, it's blatantly obvious that JJ Abrams disagreed with Rian Johnson's creative decisions in The Last Jedi. As a result, JJ tries to get the film back on track to his original plan. The product was something akin to cramming the story of all 3 Lord of the Rings movies into a single, 2.5 hour long film. It's truly stunning how poor the execution was. The sequel trilogy represents the manifestation of disrespectful, effortless attempts at entertainment with a weak foundation disguised as something \"bold\" and \"daring\". This movie is a damn cinematic travesty and doesn't deserve to carry the Skywalker name. As I was leaving the theater, trying to wrap my head around what I just witnessed, I thought to myself: \"I'd rather watch The Last Jedi.\"","displayName":"Joseph T","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":true,"createDate":"2019-12-20T06:53:03.773Z","updateDate":"2019-12-20T20:47:35.932Z","user":{"userId":"978445968","realm":"RT","displayName":"Joseph T","accountLink":"/user/id/978445968"},"score":1.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_3","review":"An entertaining movie, but disappointing end to the saga.","displayName":"Gaute J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T06:52:15.751Z","updateDate":"2019-12-30T13:27:53.398Z","user":{"userId":"976952862","realm":"RT","displayName":"Gaute J","accountLink":"/user/id/976952862"},"score":3,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_0_5","review":"Worst Star Wars movie EVER. Disney really screwed up with the last 3 movies.","displayName":"Dany D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T06:51:40.411Z","updateDate":"2019-12-20T20:27:57.098Z","user":{"userId":"978445976","realm":"RT","displayName":"Dany D","accountLink":"/user/id/978445976"},"score":0.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"Star Wars The Rise of the Skywalker was soooooooooooooooooooooooooooooooooooo good. Don’t listen to the critics you cannot do enough fan service for Star Wars. My 8 year old was in heaven and so was I.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T06:51:11.225Z","updateDate":"2019-12-21T00:16:40.862Z","user":{"userId":"260343095","realm":"RT","displayName":null,"accountLink":"/user/id/260343095"},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"Fun film felt like a Star Wars movie. Good pacing, beautiful cinematography, and good chemistry between the charters.  They pack a lot into this movie but they pull it off. Some good fan service in this film but not cheap fan service. Satisfying ending. My wife who is not a Star Wars fan came with me. She has never seen a Star Wars movie twice in a theater, she wants to go back and watch this again in the theaters. That's the biggest endorsement you can get in my book. I went for a second time and wow how much more enjoyable it was. The brain just has so much process after the second viewing its so much fun, great adventure. Recommend seeing at least twice.","displayName":"Bryan S","displayImageUrl":"https://graph.facebook.com/v3.3/100001126789453/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T06:49:26.614Z","updateDate":"2019-12-21T21:34:45.171Z","user":{"userId":"952935413","realm":"RT","displayName":"Bryan S","accountLink":"/user/id/952935413"},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"Fantastically written with a beautiful story. It holds up even better on repeat viewings.","displayName":"Jason b","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T06:37:45.688Z","updateDate":"2019-12-28T23:46:03.659Z","user":{"userId":"F9754667-F2D4-42B6-951A-04326AC8ACD8","realm":"Fandango","displayName":"Jason b","accountLink":null},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_0_5","review":"The entire series had no planning. Nowhere is this better seen than in Rose's 76 seconds of screen-time. Didn't they just set up a romance between her and Finn in the last? Didn't they try and set her up as a main character? The whole trilogy is a blatant money grab by Disney. If you enjoy products instead of art, this movie is for you.","displayName":"Jeffrey E","displayImageUrl":"https://graph.facebook.com/v3.3/1222861971/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T06:37:03.375Z","updateDate":"2019-12-27T09:41:45.645Z","user":{"userId":"832968071","realm":"RT","displayName":"Jeffrey E","accountLink":"/user/id/832968071"},"score":0.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_4","review":"the beginning felt a little stale and superficial, but once it got going it was a lot of fun.  the haters need to stop comparing what they think they remember from their their childhood nostalgia with their now-adult-take in the modern movies.  Just stfu and enjoy an exciting movie. \n\nthe battles and some of the environments were quite entertaining - i would definitely recommend.","displayName":"Jason U","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T06:36:55.227Z","updateDate":"2019-12-22T20:41:33.917Z","user":{"userId":"953147586","realm":"RT","displayName":"Jason U","accountLink":"/user/id/953147586"},"score":4,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"Another example of critics being critics and not having the faintest idea of that the people want. I loved the movie in spite of its (few) mistakes. It has enough nostalgia in a way that doesn't feel forces and that makes you smile and cry and cheer. It makes up for the unforgivable mistakes made in The Last Jedi and keeps the shiny bits from it. Fan service? Yes. Too much? No. Rian's idea wasn't bad, regarding subverting expectations, but you cannot do that in the middle of a trilogy that already stablished plot points full of misery and speculation. J. J. fixes all that, and I loved every redeeming scene.","displayName":"Martn F","displayImageUrl":"https://graph.facebook.com/v3.3/654385855/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T06:36:37.463Z","updateDate":"2019-12-20T17:43:00.792Z","user":{"userId":"876371549","realm":"RT","displayName":"Martn F","accountLink":"/user/id/876371549"},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"Good mix of action and characters, connected a lot of elements from earlier movies.","displayName":"JoeS2","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T06:34:57.702Z","updateDate":"2019-12-20T06:34:57.702Z","user":{"userId":"C81CED8E-A677-4C94-8444-FE5E012E749F","realm":"Fandango","displayName":"JoeS2","accountLink":null},"score":5,"timeFromCreation":"Dec 20, 2019"}]}