{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzI2NTM3NDkiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjJUMjE6MTQ6MzAuMzM0WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NjY1MDY0NzQiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjJUMjE6MTc6MjQuODg0WiJ9"},"reviews":[{"rating":"STAR_5","review":"Pure outstanding entertainment Great action scenes Storyline was satisfying Acting was also fine","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-22T21:17:24.884Z","updateDate":"2019-12-22T21:17:24.884Z","user":{"userId":"966506474","realm":"RT","displayName":null,"accountLink":"/user/id/966506474"},"score":5,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_5","review":"As a SW fan, I gave this movie 8/10, and like 1000/10 as far as emotion goes 😭💓💓 Great flippin movie ❤","displayName":"Anna M","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-22T21:17:14.210Z","updateDate":"2019-12-22T21:17:14.210Z","user":{"userId":"9BB33172-98AC-40B9-AA92-85D6FEFDF6FD","realm":"Fandango","displayName":"Anna M","accountLink":null},"score":5,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_5","review":"It is an EPIC finish of the saga\nIt was filled with spectacular adventure, great action, emotional payoff and a fitting end and tribute to the characters. JJ had a rocky start and was left with little to work with but he stuck the landing.","displayName":"Filip G","displayImageUrl":"https://graph.facebook.com/v3.3/10215599010463920/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-22T21:17:09.684Z","updateDate":"2019-12-22T21:17:16.548Z","user":{"userId":"978466634","realm":"RT","displayName":"Filip G","accountLink":"/user/id/978466634"},"score":5,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_0_5","review":"I've finished watching it and i will agree it's a big improvement since from JJ's previous major failures since the Force Awakens. HOWEVER, he still continued with his major blunder in making the main character as a super Jedi that can float in mid air while meditating and pull down large spaceships still. Lastly, the sword fighting was kind of slow moving, but could have been better portrayed. It's was certainly good that JJ came under massive pressure from the public to bring back Luke that manifests from the Force nearing the end of the movie. Even though he did try to wipe out his character forever in an earlier episode, and go against the story line of the Jedi that masters the force set down by George Lucas. I would rate it 5/10 due to the main character being portrayed still as a super Jedi, and because he had everyone landing troops with horses on a Star Destroyer either in high altitude or edge of space. Also, seemingly thousands of friendly fighting spaceships turn up out of no where it seems, and then again becomes more powerful than the emperor even after having her power sucked out of her. The Red Tomatoes website concurs with me and many others too agree it seems in what they think about the movie that JJ absolutely ruined the ending of the movie by going way overboard - again as usual for him. Seen it one time and never again like JJ's other previous episodes of Star Wars. While with George Luces's episodes I can watch them time & again, and enjoy those instead.","displayName":"Stephen L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-22T21:17:09.296Z","updateDate":"2019-12-22T21:19:06.247Z","user":{"userId":"976956395","realm":"RT","displayName":"Stephen L","accountLink":"/user/id/976956395"},"score":0.5,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_5","review":"Really enjoyed it. had fun. that's all that mattered to me.","displayName":"Kris","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-22T21:16:11.967Z","updateDate":"2019-12-22T21:16:11.967Z","user":{"userId":"AD1571D7-C8F1-4262-B837-6363C5473475","realm":"Fandango","displayName":"Kris","accountLink":null},"score":5,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_3","review":"Movie had some entertaining parts and really good cgi but the story aspect was a let down","displayName":"Tommy G","displayImageUrl":"https://graph.facebook.com/v3.3/748778318964010/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-22T21:16:11.639Z","updateDate":"2019-12-22T21:16:18.126Z","user":{"userId":"978466662","realm":"RT","displayName":"Tommy G","accountLink":"/user/id/978466662"},"score":3,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_2_5","review":"It would appear that JJ Abrams took every complaint aimed at Rian Johnson's Last Jedi movie and attempted to correct them to Kathleen Kennedy's and Disney's perspective of nostalgia: nothing new! From this perspective, unless you have the proper parentage, Skywalker or Palestine, the force is either mediocre or useless to you.  When Star Wars came out in 77, we used to pretend that we had the force; in Johnson's The Last Jedi, the idea that the force was in everything and bound the universe together resonated with those of us who were children in the 70s.  Now, 40+ years later, We're told that","displayName":"Jeff A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-22T21:15:07.324Z","updateDate":"2019-12-22T21:15:07.324Z","user":{"userId":"977686659","realm":"RT","displayName":"Jeff A","accountLink":"/user/id/977686659"},"score":2.5,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_5","review":"I absolutely LOVE it! Felt like a throwback to the original trilogy. J.J. Abrams completed a saga that has been a part of my life since childhood. He treated this with love and respect, I felt. Strongly recommended.","displayName":"Frederick R","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-22T21:15:06.588Z","updateDate":"2019-12-22T21:15:06.588Z","user":{"userId":"40b5a954-7d09-42ab-b528-815cc39cec2d","realm":"Fandango","displayName":"Frederick R","accountLink":null},"score":5,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_5","review":"Good Star Wars movie, fixes some of the mistakes of the last movie.","displayName":"Richard M","displayImageUrl":"https://graph.facebook.com/v3.3/1495933058/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-22T21:14:34.443Z","updateDate":"2019-12-22T21:14:38.907Z","user":{"userId":"858690793","realm":"RT","displayName":"Richard M","accountLink":"/user/id/858690793"},"score":5,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_3","review":"Problematic. I give it 6/10 and so far, judging by IMDb's Metacritic aggregator and Rotten Tomatoes, I'm a fraction generous.\n\nOne of the biggest problems is something which George Lucas himself caused, way back. Lucas first envisaged the Jedi as akin to samurai, but starting with The Empire Strikes Back he introduced more mysticism and superpower into the Jedi. In every movie since, the abilities of Jedi have increased. So it is not J. J. Abrams' fault that the Force-users are now showing godlike magical ability. Bringing me to this latest movie. Healing with the Force, actual resurrection with the Force, teleporting objects with the Force, lightsabre duelling when separated by miles, and Force ghosts acting in the physical world (okay, that was seen in The Last Jedi too).\n\nSecond problem is Leia. To start with, she was never a Jedi. Now, with no satisfactory explanation, her status is raised as not only a Jedi but a Jedi capable of training Rey. Add to that the awkward way in which Carrie Fisher's outtake footage from the two previous shoots was worked into this movie, unconvincing.\n\nThird problem is the loose scattering of every character possible - Maz Kanata, Rose Tico, and a couple of others, are included for no other reason than to include them.\n\nFourth problem is that the big bad is Palpatine. He died. He just completely died. He was as dead as can be. With absolutely no explanation, here he is alive. Even Voldemort's survival had an explanation.\n\nThe plot and the pacing and the sheer shark-jumping scale of the climactic battle are also problems. The movie is 25 minutes too long thanks to multiple sidetracks and set-piece action sequences and the excesses of the battle.\n\nYou might wonder where I got 6 from since I have tipped such a bucket over it. Well, it is Star Wars and there was good recognisable style and substance to it. And the interactions between Rey and Ren are the dramatic highlight of the film. Richard E Grant delivers a good performance as does Anthony Daniels. There is a brief sequence also where Rey, Finn and Poe infiltrating the command ship is pleasingly reminiscent of Leia, Luke and Han on the Death Star.\n\nOverall, though, I am not convinced that I couldn't have written better.","displayName":"John D","displayImageUrl":"https://graph.facebook.com/v3.3/10206749335286090/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":false,"createDate":"2019-12-22T21:14:30.334Z","updateDate":"2019-12-22T21:14:39.880Z","user":{"userId":"972653749","realm":"RT","displayName":"John D","accountLink":"/user/id/972653749"},"score":3,"timeFromCreation":"Dec 22, 2019"}]}