{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MTIyODk3MDgiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjdUMTU6MTA6MDIuNDg3WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb180NWFjNTkzMi0zNjBmLTQ1YTItYTQzMC01OGJjNDM0MWY2YWYiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjdUMTU6MTQ6MzUuMDU2WiJ9"},"reviews":[{"rating":"STAR_4","review":"good action, good character development. story line could have been a little better","displayName":"Brent H","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-27T15:14:35.056Z","updateDate":"2019-12-27T15:14:35.056Z","user":{"userId":"45ac5932-360f-45a2-a430-58bc4341f6af","realm":"Fandango","displayName":"Brent H","accountLink":null},"score":4,"timeFromCreation":"Dec 27, 2019"},{"rating":"STAR_3_5","review":"A little whiplashy at first, fun movie, awesome special effects, great scene transitions, could have had a more unpredictable ending","displayName":"Catseye Creations","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-27T15:14:27.761Z","updateDate":"2019-12-27T15:14:27.761Z","user":{"userId":"7e46343a-7745-4c67-946f-30003334a21f","realm":"Fandango","displayName":"Catseye Creations","accountLink":null},"score":3.5,"timeFromCreation":"Dec 27, 2019"},{"rating":"STAR_5","review":"I loved it. I had so much fun. The perfect movie? Of course not, but don't take it so seriously. It's Star Wars, go have fun with it.","displayName":"Kuba P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-27T15:14:26.379Z","updateDate":"2019-12-27T15:14:26.379Z","user":{"userId":"978483605","realm":"RT","displayName":"Kuba P","accountLink":"/user/id/978483605"},"score":5,"timeFromCreation":"Dec 27, 2019"},{"rating":"STAR_0_5","review":"Well it’s typical JJ Abrams and Hollywood now a days to have unoriginal ideas and revive literally dead characters only to kill them again only this time “bigger and badder.” Also killing characters shouldn’t be used just to emotionally tug at heart strings, they ought to be meaningful and flow naturally out of the story (no spoilers but when you see it you’ll know what I mean). JJ Abrams is a one trick pony with no more originality, Star Wars is withered husk that Disney is solely responsible for its death, and let’s hope that this will it for Star Wars for quite a long time. But I doubt it... sad to see the hype from The Force Awakens to fall from graces in The Last Jedi and flatline with The Rise of Skywalker... ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-27T15:13:49.749Z","updateDate":"2019-12-27T15:13:49.749Z","user":{"userId":"260247584","realm":"RT","displayName":null,"accountLink":"/user/id/260247584"},"score":0.5,"timeFromCreation":"Dec 27, 2019"},{"rating":"STAR_2","review":"Very poorly written. Disjointed in its delivery of a story. Better than the Last Jedi by a long shot, but just barely better than The Force Awakens which wasn't good at all. Its as if the writers had no idea what the Hero's Journey should entail or how to make the lead character relatable to normal humans so that we could celebrate in her personal growth and eventual triumph. The special effects and cinematography were very well done, but the story was meh!","displayName":"John M","displayImageUrl":"https://graph.facebook.com/v3.3/1412140843/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-27T15:13:36.726Z","updateDate":"2019-12-27T15:13:47.953Z","user":{"userId":"844444373","realm":"RT","displayName":"John M","accountLink":"/user/id/844444373"},"score":2,"timeFromCreation":"Dec 27, 2019"},{"rating":"STAR_0_5","review":"This movie was like a bad fever dream. It didn't tie into the the eight other movies in the Star Wars/ Skywalker saga, it took away a female characters power by tying them to a canonically dead character, and killed off Ben Solo- Han and Leia's only child. What was the point of the whole series if it just ends in tragedy like it began? Why is Rey alone on a dead planet that has no meaning to her? Why did none of the force ghosts speak to Ben but speak to only Rey? Where did all the scenes of Kelly Marie Tran go? Does JJ Abrams understand what the words fun and hopeful mean? Because seeing a character  who spent their life being mentally tortured then be thrown into a pit, have to drag themselves out of said pit, and give their life force to their soul mate to the die unceremoniously 2 seconds later is not fun and not hopeful. Seeing a character who spent her whole childhood and teenage years abandoned on a desert planet, longing for family, to end again on a desert planet alone is not fun or hopeful. It's also just bad writing. What did Luke, Leia, and Han sacrifice their lives for? Also where's Bens force ghost since you killed him off? This movie made it clear that Star Wars IS NOT for everyone and that anyone who isn't an old white cis man isn't the Disney Star Wars demographic. They should have spent less time trying to retcon TLJ to satisfy misogynistic and racists fans and more time writing a an original story with a happy ending.","displayName":"Laura E","displayImageUrl":"https://graph.facebook.com/v3.3/515977748/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":false,"createDate":"2019-12-27T15:12:51.479Z","updateDate":"2019-12-27T15:13:02.662Z","user":{"userId":"787264233","realm":"RT","displayName":"Laura E","accountLink":"/user/id/787264233"},"score":0.5,"timeFromCreation":"Dec 27, 2019"},{"rating":"STAR_4","review":"There are several (darker) choices the film could've made to be exceptional... instead it is merely a very entertaining adventure, full of fan-service.","displayName":"Ryan D","displayImageUrl":"https://graph.facebook.com/v3.3/594435081/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-27T15:10:41.758Z","updateDate":"2019-12-27T15:10:50.671Z","user":{"userId":"791267379","realm":"RT","displayName":"Ryan D","accountLink":"/user/id/791267379"},"score":4,"timeFromCreation":"Dec 27, 2019"},{"rating":"STAR_5","review":"Engaging storyline and character development. It has the excitement and pulls on the heart strings like the earliest releases, but then delivers with excellent high end tech and staging. A delight from start to finish!","displayName":"Jill C","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-27T15:10:38.763Z","updateDate":"2019-12-27T15:10:38.763Z","user":{"userId":"f59ec512-2837-4eda-988d-ce5f6a3b8f08","realm":"Fandango","displayName":"Jill C","accountLink":null},"score":5,"timeFromCreation":"Dec 27, 2019"},{"rating":"STAR_5","review":"What a great way to not just bring an end to the sequel trilogy, but an end to the Skywalker saga. It was heart wrenching, fan servicing, face paced, super fun that sold me on ways I hadn't predicted. I knew the spoilers going in and I was still surprised and loved the movie. It may have had a few small gripes from me, but they in no way detracting from the amazing work by the cast, the beautiful cinematography, the fun group adventure story line, and great moments from unexpected characters. It's so much fun, see it and have a great time!","displayName":"theJarett","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-27T15:10:22.742Z","updateDate":"2019-12-27T15:10:22.742Z","user":{"userId":"c0f54a18-a689-475b-9859-1aae7fe5a878","realm":"Fandango","displayName":"theJarett","accountLink":null},"score":5,"timeFromCreation":"Dec 27, 2019"},{"rating":"STAR_2","review":"It's just not a good movie, sorry. Let's start by addressing the absolute retcon JJ Abrams and TROS pulled over Rian Johnson and TLJ. Simply put, TROS glosses over and essentially eliminates key plot points of TLJ -- it erases it's core message. The problems with this movie are plentiful, but the main issue is that it attempts to do far too much. Abrams tries in TROS to fit three movies into one. It doesn't work. Is it fun? Yeah. Does it look amazing? Definitely! But the movie and direction and plot are so nonsensical at times it had me genuinely scratching my head. I completely understand why the audience score is much higher than the critics. Audiences are much more forgiving of plot holes and general movie malpractice in place of seeing their favorite characters team up. As someone else noted, this movie could have literally been written by a Reddit thread of theories. Instead of crafting the best movie possible, Abrams decided to go full on fan service and sacrifice what makes a good movie. I will say, I continue to love the cast. Ridley, Boyega, and Isaac are all wonderful and it was a joy to see them team up. It wasn't enough to save the final movie in the Skywalker saga. Two stars.","displayName":"Matthew R","displayImageUrl":"https://graph.facebook.com/v3.3/1215623496/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-27T15:10:02.487Z","updateDate":"2019-12-27T15:10:04.344Z","user":{"userId":"912289708","realm":"RT","displayName":"Matthew R","accountLink":"/user/id/912289708"},"score":2,"timeFromCreation":"Dec 27, 2019"}]}