{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzc5OTMxMDMiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjBUMjA6NDI6MTUuNTgwWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MjI1NjEwNjYiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjBUMjA6NDM6MTMuNTM0WiJ9"},"reviews":[{"rating":"STAR_4","review":"The critically loved, hollow movie known as \"The Last Jedi\" forces rise of Skywalker to be rushed from the lack of plot development in previous movies. For what this movie was handed it has turned out far better than I could of imagined. Some parts including the end are \"Mclunky\" but it is still enjoyable and remembers what made Star Wars great.","displayName":"Eden S","displayImageUrl":"https://graph.facebook.com/v3.3/100000253359352/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:43:13.534Z","updateDate":"2019-12-20T21:06:03.830Z","user":{"userId":"922561066","realm":"RT","displayName":"Eden S","accountLink":"/user/id/922561066"},"score":4,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"Fantastic Wrap up of an epic sci fi tale.","displayName":"Robert","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:43:10.131Z","updateDate":"2019-12-20T20:43:10.131Z","user":{"userId":"15621643-BBE0-4DBB-B0B0-D5CFAA93415A","realm":"Fandango","displayName":"Robert","accountLink":null},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"Fun, adventurous thrill of a film.  Has flaws, sure, but it's still an exciting ride.  Worth it, for sure.","displayName":"Lucas J","displayImageUrl":"https://graph.facebook.com/v3.3/10214891332534420/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:43:08.612Z","updateDate":"2019-12-20T20:43:12.188Z","user":{"userId":"976927981","realm":"RT","displayName":"Lucas J","accountLink":"/user/id/976927981"},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"The critics are wrong about this one. The critic backlash comes from those who praised the Last Jedi, which was a film whose only purpose was to tear down the characters and story we all loved and grew up with. Sure, the new generations deserve some of that Star Wars magic and if anything, efforts like \"Rogue One\" and \"The Mandalorian\" have succeeded in being original yet respectful. The Last Jedi does not. \n  Alas, like all politicial/Social Justice  issues conversations that have plagued social media these days, the critics will attack this movie in revenge of that 43% RT audience score the Last Jedi currently has. Why? Because their \"critics\" score stands at 91%. Simple as that, they claim to know better than you.\n J.J. Abrams has done the best he could have conceivably done in order to bring us this Great film. Sure, it's not without flaws, but I just want to make sure that you point out the flaws that you see with your own eyes and not through the eyes of critics have the need to sell you ideas they THEY think should be Star Wars. It's definitely jam packed with action and some would calling pacing issues. I consider myself quick to pick up on stuff and did not feel things being rushed at all. As for plot points seeming a bit forced, see 'The Last Jedi' for \"non-existent\" plot/Story points and then get back to me. \n  Today's critics don't know Star Wars and they certainly don't know you. I hope you enjoy the final installment in the Skywalker Saga as much as I did.","displayName":"Alberto D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:43:05.508Z","updateDate":"2019-12-20T20:43:20.838Z","user":{"userId":"973202650","realm":"RT","displayName":"Alberto D","accountLink":"/user/id/973202650"},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_3","review":"I wish they would have kept Palpatine a secret instead of right out of the gate.","displayName":"Tamara","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:42:52.799Z","updateDate":"2019-12-20T20:42:52.799Z","user":{"userId":"80d74c96-e76c-4f14-b7ba-b0f3106112f3","realm":"Fandango","displayName":"Tamara","accountLink":null},"score":3,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"It isn't as bad as they, nor is it all that. Yet, it does deliver, and that's all that matters.","displayName":"David","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:42:29.990Z","updateDate":"2019-12-20T21:22:11.423Z","user":{"userId":"AF6FEB44-4A9A-46FF-B752-352A6B2B8F41","realm":"Fandango","displayName":"David","accountLink":null},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_2","review":"Warning: Spoilers ahead\n\nStar Wars: The Rise of Skywalker was a decent addition to the franchise - as long as one does not think too much of the actual plot. The film is fast-paced, which could have been a good thing, but fails here to give the viewer the time to digest some of the information that is thrown at him - it often seems as that is intentional: Move on quickly, before they realise this does not make sense!\n\nPalpatine is the best example of this: First, he wants Kylo to kill Rey, and when he fails to do so, he wants him to bring her to him. Then Palpatine wants to kill Rey so he can transfer his 'evilness' into her, and when she later does, nothing of this sort happens. \nThere is very little character development; instead, new characters are introduced that have mostly nothing to do. Many plot points are too convenient: the famous (but often lacklustre) trio lands on Pasaana, meet Lando by convenience who knows exactly how to help their quest, are chased by the bad guys only to fall into a quicksand-cave where - who would have guessed! - they find the artefact they were looking for!\n\nJJ Abrams does a lot to backtrack on some of the interesting things established in The Last Jedi, and it often feels like the film is desperate to please. Story and characters are neglected for all sorts of nostalgic moments that rarely add anything, while the basic themes established in the original trilogy - Love, family, and redemption - are distorted at will to fit the shaky plot. \n\nThe biggest problem, however, poses the ending of the film. Many questions remain unanswered: How did Palpatine return? Why did he need Ben Solo for his plans? Was the force bond created by Snoke or Palpatine? What happens to the bond if one dies? Why did Luke fade instantly when he died, but Leia did not? Why did Rey not fade, but Ben did? Why did Ben Solo die by transferring is force energy, when it was never established that the transfer came at a price (example: Rey healing the snake and Kylo without ever breaking into a sweat). \n\nOne could look over all those things if it was mainly the end of the sequels, and not of the whole saga. With Palpatine's return, Anakin/ Darth Vader's sacrifice seems worthless; Luke's, Han's and Leia's death - and hope to turn Ben back to the light - seem empty with Ben's death. It is established that Leia stopped her Jedi training because she saw her son's death at the end of that path - and he dies anyway. \nThe Skywalker Saga - one that was affected by Palpatine - ends with a Palpatine defeating him. Not a Skywalker, not a Skywalker and a Palpatine together - two sides of the force, a true balance. As such, it feels like this was the story of Rey, the story of the Palpatines, and not fitting to end a saga centred around the Skywalkers. There is much to argue about Ben Solo's fate - his death was definitely a letdown, as it also defies the established themes of George Lucas' vision of a fairytale, of hope and love and redemption. The attempt was there: he got redeemed, he did was Anakin could not, namely save his love. But his death feels hollow and forced and seeds the message of \"Even if you do good, you will die.\" He is forgotten in a second, as the film cuts to the end-of-war celebrations, and he does not even receive the honour to be a force ghost along with his mother and uncle. With Rey seeking a family and belonging, her end is bleak too: she mind have found friends in the resistance, but she is still alone. The film tries to tell us that she has found a new family with the Skywalkers, which she wants to honour by taking their name. It would have been beautiful if one of the first scenes of the trilogy hadn't been Lor san Tekka telling Kylo/Ben that \"You cannot ignore the truth that is your family.\" With the last true Skywalker - Ben Solo - dead and every Skywalker's life ending in tragedy, the \"Rise of Skywalker\" fails to give a true payoff to everything any Skywalker as gone through. \n\nThe film is outstanding in terms of costume, effects, and acting; especially Adam Driver's portrayal of Kylo Ren's struggle and the transformation into a cheeky Ben Solo - along with a nod to his father Han - is mesmerising, and even more impressive when taking into account that Kylo Ren's last words are midway through the film and Ben Solo only ever mutters an \"ow\" but never speaks a word. \n\nStar Wars: The Rise of Skywalker is a good addition if people prefer pew-pews and light saber action, but it fails as a meaningful conclusion to the Skywalker Saga.","displayName":"Sarah S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":false,"createDate":"2019-12-20T20:42:25.002Z","updateDate":"2019-12-20T20:56:33.256Z","user":{"userId":"976954062","realm":"RT","displayName":"Sarah S","accountLink":"/user/id/976954062"},"score":2,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_4_5","review":"(No spoilers) The Rise of Skywalker solidifies a shaken franchise after the lacking impact The Force Awakens left on fans returning to their beloved Star Wars alongside the complete disappointment The Last Jedi came to be.","displayName":"Matt O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:42:24.885Z","updateDate":"2019-12-20T20:42:56.638Z","user":{"userId":"978453017","realm":"RT","displayName":"Matt O","accountLink":"/user/id/978453017"},"score":4.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_0_5","review":"I don't blame JJ Abrams too much for the mess that is this movie. Rian Johnson painted him into a corner. There are rare glimpses of what this movie could have been, and the actors do their best with a horrible script. But as a cohesive story this film left the Star Wars fan in me both sad and tired. The whole Disney trilogy is one big missed opportunity.","displayName":"Fredegar D","displayImageUrl":"https://graph.facebook.com/v3.3/100005346971529/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:42:22.137Z","updateDate":"2019-12-20T20:42:31.967Z","user":{"userId":"960697718","realm":"RT","displayName":"Fredegar D","accountLink":"/user/id/960697718"},"score":0.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_3_5","review":"This movie trades continuity for nostalgia.  Although this film could have been done much better, as Rian Johnson quite remarkably demonstrated, it could have been done much worse as well.  Visually stunning and action packed, even if lacking in Star Wars continuity.  Things that don't happen in other Star Wars movies happen in this one, which is a good or a bad thing depending on the audience.","displayName":"Paul H","displayImageUrl":"https://graph.facebook.com/v3.3/10219425376405192/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:42:15.580Z","updateDate":"2019-12-20T20:42:33.992Z","user":{"userId":"977993103","realm":"RT","displayName":"Paul H","accountLink":"/user/id/977993103"},"score":3.5,"timeFromCreation":"Dec 20, 2019"}]}