{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb18yMGUwMWExMi1kMjhmLTRjMjMtODA1OC1lYTZkNzM4NTkxMTUiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjJUMTc6MjI6MjIuNTE0WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzg0NjU2NTciLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjJUMTc6MjQ6MTEuMjQ4WiJ9"},"reviews":[{"rating":"STAR_2","review":"movie have impossible task to undone  last 2 bad  movies\nand fall  miserably .","displayName":"Pedja L","displayImageUrl":"https://graph.facebook.com/v3.3/10157843448455364/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-22T17:24:11.248Z","updateDate":"2019-12-22T17:25:08.233Z","user":{"userId":"978465657","realm":"RT","displayName":"Pedja L","accountLink":"/user/id/978465657"},"score":2,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_5","review":"IX is a wonderful romp through 42 years of nostalgia, and while it suffers hard from the mistakes of its predecessors, it's the best ending to the 9-movie saga we could have hoped for.\n\nAs a standalone movie, Star Wars Episode IX: the Rise of Skywalker satiated my inner child as I can now finally put my Star Wars hopes to rest. Episode IX made me feel what only The Mandalorian had recently succeeded in doing - it hearkens back to how I felt about Star Wars when I first watched some 30 years ago. After five straight movies of trying to reinvent the wheel - and mostly failing to do so - Star Wars finally got back on-target for the last entry in the Skywalker saga.\n\nAt times disjointed and meandering, at other times brilliant and clever, and at yet other times insulting to the viewer - Episode IX had some great moments to drive the trilogy home. Abrams had a Herculean task in trying to tie together nine movies of other directors' visions and other writers' story choices, but overall, the nostalgia and fan service in IX give enough juice to carry it across the finish line.\n\nYou can't really talk about a Star Wars movie now without also talking about the rest of the trilogy, and thus, most of the problems that Episode IX had were because of issues in Episodes VII and VIII, and the attempts to erase the misgivings from Episodes VII and VIII are blatant and feel reactionary, at best. Going into Episode VII, Abrams and company feared fan backlash so much that they took almost no chances with plot or character or story, and the trilogy suffered for it. The chances that they did take were ignored or erased in Episode VIII, leaving very few choices for Episode IX that would actually make sense or feel in any way important to the viewer. A vast majority of the emotional beats in Episode IX skip three movies back to find their significance, and nearly every important character decision or event relies on the greatness of the original trilogy to carry its weight. If Episode VII was meant to pass the torch onto new characters and if Episode VIII was meant to 'Leave the past behind,' both movies failed spectacularly to set up anything noteworthy in Episode IX, as the new story and new characters just don't have enough development to stand on their own. Spending screen time on characters and events that don't matter, don't impact the story, and don't have any emotional draw makes for a very dull and frankly insulting cap to the bright, big personalities that the first six movies did so well. Star Wars has always been about the characters and their exploits, and Episode IX starts wrapping up character's stories who didn't have any meaningful arc to begin with because this is the final movie and it had no choice but to do so. The only characters in Episode IX with any emotional value are Rey, Kylo, and Leia, and while the story of Rey and Kylo does wrap up extremely well given the circumstances, the absolute remainder of the cast meant next to nothing whatsoever to the story, and probably could have been done entirely without. Most, if not all, of the complaints that I have with Episode IX are actually complaints with how VII and VIII failed to further any significant plot or character development for any character in the series - so little, in fact, that moments during Episode IX that should have been full of heavy emotion and pride and giddiness were instead relatively flat and lifeless because we had little to no personal attachment to the characters. From Palpatine to Luke, Han to Leia, Chewbacca, C3P0, Lando, Rey, Poe, Finn, Rose, Hux, Phasma, and all manner of lesser characters, Rey and Kylo were really the only two who actually needed to be on-screen, and most of their screen time is spent wordlessly staring through the void at one another, reminding me of Moana's Hei-Hei staring across space and time at another Hei-Hei. Seven hours' worth of storytelling time in the trilogy feels wasted in Episode IX because of the lack of significant emotional payoff for most of the characters and events. The lifelines of a trilogy like Star Wars are how well the movies work together and combine to tell a coherent, engaging story with the characters at the forefront - and Episode IX comes so very close to succeeding where the previous two movies faltered, and does well enough that it nearly makes up for their failings. Ultimately, however, you can only build things so high without a strong foundation, and Episode IX is just that - starting over again two-thirds of the way into the trilogy because there was no significant foundation set for what should have been an emotional grand slam.\n\nIn my industry, we talk about being given the tools to succeed, and Rian Johnson failed to pass those tools back to Abrams. You could say that Abrams didn't pass those tools to Rian Johnson to begin with, and that Abrams' failing in this was handing the reins to Rian Johnson and approving an Episode VIII script that had no meat. I believe that Episode VIII slammed the Trilogy into reverse one movie from the finish line, and - much like in improv - you don't really succeed by saying \"no\" to what's already happened, and unfortunately, I feel that Episodes VIII and IX both failed at this. Episode VIII was all about subverting expectations, but the major failing was that in a 9-movie epic, Episode VIII (and the middle of the new trilogy) is not the place for that to happen, nor was Episode IX the place to have to reverse the reversal.\n\nI made a comment after watching Episode IX that \"I sure wish there were a movie in-between Episode VII and Episode IX so that any of this trilogy made sense.\" And that sums up my feelings about the trilogy pretty well. Had Episode VIII been anywhere even remotely well-done in terms of story, plot, or character development, this trilogy would have been a masterpiece, and Abrams likely wouldn't have had to spend much of his screen time in episode IX hand-waving the mistakes of his predecessor. I feel like Episode IX was a hastily-compiled clip show, trying desperately to plug holes in the ship to keep it from sinking. From the explanation of Snoke's existence to Palpatine's involvement to Hux's rapid and confusing involvement, to the backpedaling of Rey's parentage, to Luke nearly breaking the fourth wall to explain his actions in the previous film, to Leia's character being poorly shoehorned into a movie that really did not need her, to all of the character deaths that would have meant something - but instead, didn't (or that didn't even occur, because Plot Armor) - to all of the wasted screen time on characters that did nothing and made us feel nothing, it is difficult to divorce Episode IX from the previous two films. But while I feel that the sequel trilogy is a massive failure mostly because of the potential that it wasted, Rise of Skywalker ends the saga on an uptick.\n\nEpisode IX was still the shining gem in what could have been an astounding trilogy. It suffers suffers hard from two straight movies about nothing, and while Abrams put himself into a poor position for his return, he did as well as he could have in picking up the pieces of a shattered franchise. In IX, the Cinematography and musical score are once again top-notch, and, much like Episode VIII, if only there were stronger writing and character choices that actually mattered would this capstone be considered great. Overall, Episode IX: The Rise of Skywalker is still an absolute must-see for fans and non-fans alike, and provides enough nostalgia and fan-service to warm the heart, but do not expect for it to succeed in fixing the flat, dull, lifeless, and unimportant characters or the lack of story beats that could have made this trilogy astounding.","displayName":"Matt B","displayImageUrl":"https://graph.facebook.com/v3.3/10156100404966012/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-22T17:24:08.531Z","updateDate":"2019-12-22T23:26:01.401Z","user":{"userId":"977249318","realm":"RT","displayName":"Matt B","accountLink":"/user/id/977249318"},"score":5,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_3_5","review":"This movie gets significantly better as it goes on. The first act is paced terribly, making it really unengaging. As the film goes on, it gets a lot more fun. However, much of the plot still feels thrown together and I can't help but think the entire trilogy would have been better off had they introduced some of these ideas from the start.","displayName":"Kyle C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-22T17:24:03.934Z","updateDate":"2019-12-22T17:24:08.420Z","user":{"userId":"978465669","realm":"RT","displayName":"Kyle C","accountLink":"/user/id/978465669"},"score":3.5,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_1_5","review":"Filled with plot holes. Knock off of Return of the Jedi as well.","displayName":"Joe","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-22T17:23:31.699Z","updateDate":"2019-12-22T17:23:31.699Z","user":{"userId":"9D019F37-D1AB-4E22-8D65-EE8D03CA8468","realm":"Fandango","displayName":"Joe","accountLink":null},"score":1.5,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_5","review":"This movie has always been atop in other series for a reason.  To end such a saga is a blow to movie going.  \n\nTo give life back to someone who once gave you life in sacrifice, is one hell of a thing to do.","displayName":"PayPal U","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":true,"createDate":"2019-12-22T17:23:25.904Z","updateDate":"2019-12-22T17:23:25.904Z","user":{"userId":"E51D5F98-D46A-4071-ABEB-54E06198BA88","realm":"Fandango","displayName":"PayPal U","accountLink":null},"score":5,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_2","review":"Story line made no sense Rey calls herself a Skywalker what a joke wow Disney really dropped the ball such a disappointment still a Star Wars fan but dissatisfied with the end of Movie","displayName":"David","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":false,"createDate":"2019-12-22T17:23:13.989Z","updateDate":"2019-12-22T17:23:13.989Z","user":{"userId":"1FA37E02-97ED-4A11-B86B-422CA8E60459","realm":"Fandango","displayName":"David","accountLink":null},"score":2,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_1","review":"This movie is straight trash.  Go watch Screen Rant \"Rise of Skywalker\" on youtube and you'll enjoy that a HELL of a lot more than this garbage.. Thank god its over","displayName":"Geoffrey M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":true,"createDate":"2019-12-22T17:23:11.501Z","updateDate":"2019-12-22T17:23:17.177Z","user":{"userId":"941988939","realm":"RT","displayName":"Geoffrey M","accountLink":"/user/id/941988939"},"score":1,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_5","review":"JJ Abrams, in my opinion fixed the Rian J mistakes made in episode 8 quite well, and from the very beginning of episode 9. Questions were answered and the action was amazing! I appreciated Luke Skywalker catching the lightsaber that Rey threw and telling her how disrespectful that would have been, fixing Rian J's  abomination from the previous film.","displayName":"Mk5640","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":false,"createDate":"2019-12-22T17:23:03.091Z","updateDate":"2019-12-22T17:23:03.091Z","user":{"userId":"a35207e5-5001-4292-9656-84ba8aadf3c9","realm":"Fandango","displayName":"Mk5640","accountLink":null},"score":5,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_5","review":"Well worth a watch! I absolutely hated The last Jedi. Nothing about it felt like it was a star wars movie.\nBut this! This was Star Wars and it was truly epic! \nWhen I saw the trailer, I thought it would be terrible, especially when I saw that weird horse battle kinda scene. But honestly, it works! 🤩","displayName":"Asche M","displayImageUrl":"https://graph.facebook.com/v3.3/559246951079901/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-22T17:22:56.735Z","updateDate":"2019-12-22T17:23:03.439Z","user":{"userId":"977052404","realm":"RT","displayName":"Asche M","accountLink":"/user/id/977052404"},"score":5,"timeFromCreation":"Dec 22, 2019"},{"rating":"STAR_2","review":"Spoilers: ending was ABSOLUTELY cliche and the whole franchise should be embarrassed by this move. Reminds me of The Phantom's Menace in terms of how much of a JOKE this movie was.","displayName":"Alex N","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":false,"createDate":"2019-12-22T17:22:22.514Z","updateDate":"2019-12-22T17:22:22.514Z","user":{"userId":"20e01a12-d28f-4c23-8058-ea6d73859115","realm":"Fandango","displayName":"Alex N","accountLink":null},"score":2,"timeFromCreation":"Dec 22, 2019"}]}