{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzg0NDIyNzUiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjBUMDA6MDA6NTQuMDI1WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MTI1NDEwMzUiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjBUMDA6MDM6NDkuNzA5WiJ9"},"reviews":[{"rating":"STAR_3","review":"The Rise of Skywalker is a film on damage control, damage control that was not needed… yet, I still kinda liked it.\nIt's a film that is obsessed with doing what it thinks the fans want yet building on something that decided to challenge what the fans want. Resulting in a hodge podge of backtracking and half hearted soft-retcons in an attempt to appease a fanbase split in two because of irreconcilable opinions… yet, I still kinda liked it.\nIt's a sequel that follows a film that had the guts to do something daring, it was a rough diamond that proved that Star Wars was capable of something absolutely remarkable and daring… yet, I still kinda liked it.\nIt's an absolutely gorgeous movie, filled with everything you could expect from a Star Wars film. The set pieces are fun, the cinematography is off the charts, lots of action and explosions, it's everything you would expect to get from a Star Wars film… a crowd pleasing, popcorn action flick that moves forward with J.J Abrams signature breakneck pace… it's exactly what you would expect, sure the lightsabers are still being swung around like bats and action choreography is suffering from bad \"keyframes\", yet, I still kinda liked it… right?\n\nOk, fine. No I did not. In fact, the more time I spend with the film the more disappointed I get. There are two keywords I would use to describe TROS, \"uninspired\" and \"lacking in imagination\". It's extra frustrating coming of The Last Jedi who dared to give a middle finger to the expectations of fans and push Star Wars in new directions. \nAfter TLJ I remember sitting in the theatre silent for 10mins having to just process the film and what it had made me go through. I felt a new reinvigorated excitement for SW now when I had no idea where it would go next!\nTROS was the reverse. I feel no new excitement for Star Wars, instead it kinda killed it for me. Because in a way it brought Star Wars back to my expectations\n\n\nIs this just gonna be a comparison between TLJ and TROS? Yes, I really need to convey what makes TLJ great to show why TROS is so disappointing for someone who loves TLJ.\nThe main thesis of TLJ was that failure is the greatest teacher, don't hold on to the past but don't let it die either, learn from it. TROS threw all of that out of the window.\nSure, TLJ is a flawed film with a lot of problems but the heights TLJ manages to reach are fantastic. TLJ is a flawed great film while TROS is a solid good film, My point is, the ambition to go high and occasionally reach it, is more laudable than then aiming for consistent adequacy.\nLet's face it, Star Wars has always been one of those \"theme park\"-movies that Scorsese describes (At Least the good ones) and you know what? That's fine. I fucking love theme parks. Theme parks are cool as fuck! I love shit like the MCU but the thing is, TLJ showed that SW could be something more and not something more as the best MCU-movies but something truly great. Not just a great action adventure with fun melodrama but something that carried both emotional and thematic depth. That it could be a franchise that wasn't only interested in being a crowd pleaser but a challenge it's audience. Let me go into detail about this.\n\nWARNING, this is gonna sound nerdy as fuck! Also, spoilers for TLJ coming up.\nThe interesting thing about TLJ is that it was challenging the standard morality of Star Wars. It questioned the idea of the Jedi and the Sith, where they really necessary or not? It was building the foundations for Star Wars and the force to become more nuanced. Instead of being all black and white it could bring the more complicated grey that is so relevant in our society.\n\"That Force does not belong to the Jedi. To say that if the Jedi die, the light dies, is vanity\" This line is a great example of what make TLJ so great. SW has always been obsessed by the idea of balance, the fact that the ancient Jedi island has spot full of the \"Dark Side\" and the way Luke describes it as a form of counterbalance is emblematic of the fact that Rian Johnsson truly understands the narrative of the Force and the Jedi. It's a brilliant interpretation to say that not only were the Sith bad but the current known form of the Jedi was bad too. The movies portray the light side as the side that is balance, destroying the Sith would bring balance. TLJ says no, it's a yin and yang, the dark and the light needs each other.\n\nWhen there was too much light, when the vast majority of force users were Jedi, Darth Sidious rose, then he killed all the Jedi and there was too much dark. \nSo Luke rose, then he turned his father who killed Darth Sidious and there was too much light. So Kylo Ren rose. Rinse and repeat. \n\n\nFor the galaxy to have peace maybe the universe (and us SW-fans) need to develop a more nuanced understanding of the force. This is what I call a great theme that is rooted in our own understanding of the real world. \nTLJ is built around this idea of nuance but what elevates it even further is the second theme, learning from failure. There is a reason why Kylo is still the villain at the end, he wants to burn it all down, Rey wants to learn.\nTLJ ends with the setup for the characters to really learn that nuance and push the understanding of the franchise forward. Would not an ending that makes us recontextualise the franchise's and our understanding of the foundational mystical element of the narrative be something truly epic for the saga to end on?\nIt's the whole Joseph Campbell Hero's Journey thing again, the hero has to return home but he and everything has to have changed.\nGuess what TROS does with all those wonderful themes? complete back pedaling and resetting.\nBtw can I also just mention how brilliant the choice of not having a single lightsaber duel in the movie was? The final scene between Kylo and Luke is how every Jedi conflict should be. Jedis strive to avoid conflict find a pacifist solution, only resorting to violence if pushed to the absolute. Luke not engaging in combat at the end of TLJ is a testament to how well Rian Johnsson understands the idea of Jedis. This is what he means with: \"What is best for the story\". Of course not a trace of this understanding can be found in TROS.\n\nThis is the core of my disappointment with TROS… I saw the light of something truly special and instead they finished it off with something that was enjoyable but lacking all that depth in it's storytelling and imagination, relying on visual spectacle and nostalgia instead.\nI guess I simply wanted better from it, because I've seen it be better and because I want it to be better, I want Star Wars to be better because I love Star Wars and I'd be proud to see it become just that.\nIt's a shame really, you can really see the filmmakers desperately try to please everyone. Not in a cynical way but in a \"Fans we hear you!\"-way. I will be fair they don't shit on all the ideas that TLJ brought to the table, that's what I mean by soft-retcons. There are actual things they build on that is quite fun but it messes up so hard because it also tries to give the haters what they want (And to be honest here, I think it's impossible to give them that in just one movie).\nI may not like TROS but I would honestly be quite heartbroken if I found out the fans did not like this one. I really hope I'm wrong about the haters here. I know that if this was me when I was a young Star Wars fanboy would have loved TROS.\n At the time of this writing I know the Rottentomatoes-cirtic score and I agree with them, however the audience score has not been released, I truly hope that it gets a high score from the audience. I'm just… kinda tired of this… I feel like my side of the fandom has lost but I want someone to be a winner here, This is the end of the Saga again... the last thing I want is the entire fandom to feel lost.","displayName":"Kenneth L","displayImageUrl":"https://graph.facebook.com/v3.3/1400357407/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":true,"createDate":"2019-12-20T00:03:49.709Z","updateDate":"2019-12-20T00:03:55.202Z","user":{"userId":"912541035","realm":"RT","displayName":"Kenneth L","accountLink":"/user/id/912541035"},"score":3,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"Absolutely, there are no reasons for me to hate this film.\nThe storyline of this movie ended the Skywalker saga perfectly. The hidden meaning of this movie impressed me the way that not all of any other Starwars prequels could do. Besides, many scenes are so beautifully designed that made me cry, yet it is highly entertaining to me.","displayName":"Gade S","displayImageUrl":"https://graph.facebook.com/v3.3/718477785/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T00:03:32.647Z","updateDate":"2019-12-20T00:03:39.004Z","user":{"userId":"894118648","realm":"RT","displayName":"Gade S","accountLink":"/user/id/894118648"},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_3_5","review":"Whole their were a few moments that seemed over the top, and a few more made just to sell toys, in this film, every scene actually moved the film forwards (unlike ep viii).\nSome interesting choices towards the end of the film took away some of the shine for me, but overall I'd say it was a decent film.","displayName":"Jaydon B","displayImageUrl":"https://graph.facebook.com/v3.3/10157480658935468/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T00:03:07.315Z","updateDate":"2019-12-20T00:03:13.067Z","user":{"userId":"978442281","realm":"RT","displayName":"Jaydon B","accountLink":"/user/id/978442281"},"score":3.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"Don’t listen to the critics. Listen to your inner child. To the you who saw the first movie. How did they feel? Now, how do you feel?","displayName":"Chris","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T00:02:15.394Z","updateDate":"2019-12-20T00:02:15.394Z","user":{"userId":"E5CAEC59-4683-4E42-BD6C-B4AD0C1546C6","realm":"Fandango","displayName":"Chris","accountLink":null},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_0_5","review":"Worst star wars movie ever. Don't go see this unless you want to laugh because it ruins everything the older movies have established.","displayName":"Joep R","displayImageUrl":"https://graph.facebook.com/v3.3/100004742107435/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T00:02:10.123Z","updateDate":"2019-12-20T00:02:16.227Z","user":{"userId":"955955901","realm":"RT","displayName":"Joep R","accountLink":"/user/id/955955901"},"score":0.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_4","review":"The dialogue is clunky, especially around Carrie Fishers scenes. The story seems familiar. But it's still good.","displayName":"Ben J","displayImageUrl":"https://graph.facebook.com/v3.3/678948855/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T00:01:50.453Z","updateDate":"2019-12-20T00:01:56.369Z","user":{"userId":"921207614","realm":"RT","displayName":"Ben J","accountLink":"/user/id/921207614"},"score":4,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_3_5","review":"Good movie, after the desastre of the last Jedi.\n\nReally sad to understand that the trilogy trilogy is not about the saga of the skywalkers but yes the history of the Papatins.\n\nAlso sad for the wasted opportunity with the original trilogy cast... and to se Luke with little to non importance in this trilogy","displayName":"Adrian S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T00:01:36.479Z","updateDate":"2019-12-20T00:01:41.180Z","user":{"userId":"978442261","realm":"RT","displayName":"Adrian S","accountLink":"/user/id/978442261"},"score":3.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"Una película muy entretenida, llena de emoción, acción y con un final digno para cerrar la trilogía.\nLastima las críticas, pero que pensaban ver? La historia ha sido muy buena","displayName":"Carlos C","displayImageUrl":"https://graph.facebook.com/v3.3/10220519790294340/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T00:01:24.284Z","updateDate":"2019-12-20T00:01:36.708Z","user":{"userId":"978442278","realm":"RT","displayName":"Carlos C","accountLink":"/user/id/978442278"},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_3_5","review":"You may find a really good Star Wars movie. But you might also find a really bad one. Paraphrasing Obi Wan: It all depends on your point of view. \n\nThe key to this (or any other) Star Wars movie is to go in with the same optimism that you had when you were a kid watching your first Star Wars movies - whichever ones they were. The reason we adults still watch Star Wars is because they remind us of our childhoods and how our imagination was captured. \n\nWith that childlike spirit in mind, you have to look past the creative decisions forced upon Rise of Skywalker as well as some awkward explanations thanks to what The Last Jedi left behind for it to work with. Rise of Skywalker was always running into a headwind and it's amazing it even got over the finish line at all.\n\nIt's a bit like how we didn't care that Return of the Jedi had a bit of explaining to do regarding Obi Wan saying that Darth Vader killed Luke's father only for Vader to end up being Luke's father. We just let Obi Wan off the hook and got on with the story. Rise of SkyWalker just has a lot of these moments do deal with. \n\nIf you go into it as an adult with an encyclopedic knowledge of the Star Wars lore and every character's story arc since Phantom Menace looking to pick it all apart ... you're going to hate Rise of Skywalker. If you want to find reason to hate this film, you will. But that's like going to Paris just to complain about the loud traffic and the dog shit on the streets when you're supposed to be marveling at the Eiffel Tower.\n\nAs a life long SW fan is his mid forties I knew would only enjoy the film if I decided to like it. My affection for SW and my want to maintain it exceeds my desire to be just another angry guy on the internet moaning about Disney, Rian Johnson and Kathleen Kennedy. \n\nOverall, if The Last Jedi is a slightly better movie than it is a Star Wars movie, Rise of Skywalker is a slightly better Star Wars movie than it is a movie. Episodes 7, 8 and 9 might not make for a convincing trilogy, and it inflicts some collateral damage on some legacy characters but it does decent justice to the broader themes of the entire saga; hope, confronting fear, friendship, and redemption. \n\nWhile I think the entire Disney sequel trilogy is a study in how to get it wrong, Rise of Skywalker gets a pass from me because of the circumstances it was placed under by executive and creative decisions made by its predecessor.","displayName":"Blair E","displayImageUrl":"https://graph.facebook.com/v3.3/834738297/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":true,"createDate":"2019-12-20T00:00:57.891Z","updateDate":"2019-12-20T00:01:10.964Z","user":{"userId":"805024203","realm":"RT","displayName":"Blair E","accountLink":"/user/id/805024203"},"score":3.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_3","review":"Rushed story, bad laying out the characters. Bad fights, bad plot, copied ending. And the same end as part 6, where you think what have i been watching.","displayName":"Richard V","displayImageUrl":"https://graph.facebook.com/v3.3/10219360178727870/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T00:00:54.025Z","updateDate":"2019-12-20T00:00:59.452Z","user":{"userId":"978442275","realm":"RT","displayName":"Richard V","accountLink":"/user/id/978442275"},"score":3,"timeFromCreation":"Dec 20, 2019"}]}