{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF8yNjAzNDM3OTEiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjFUMDE6MTQ6MTAuNjU0WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb18yOTU0NEJDRi1FRjBGLTQwNTQtODhFOS1FNTY3QjFCODUyODAiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjFUMDI6MTk6MTIuODI4WiJ9"},"reviews":[{"rating":"STAR_5","review":"Loved the action and finality the hell with the critics !","displayName":"gilbert l","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":true,"createDate":"2019-12-21T02:19:12.828Z","updateDate":"2020-01-03T03:55:05.920Z","user":{"userId":"29544BCF-EF0F-4054-88E9-E567B1B85280","realm":"Fandango","displayName":"gilbert l","accountLink":null},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"I feel we need to remember the Last Jedi for a second. The problem with the new trilogy, in my humble opinion, is that the Last Jedi stopped any character development, of the sort we had in the first two trilogies. To have the Last Jedi open at the close of the last movie, might have been far from what fans expected and I understand that Rian (selfishly in my opinion) wanted to shake things up, taking the style of story telling we had expected to experience in this galaxy, to take that off in another direction. But it was the most damagingly un-Star Wars thing he could do. \nI think we got just two Star Wars films in the end, the first was a two parter... \nLucas reimagined the opening of 50s Flash Gordon matinee serials, with their scrawling recap in type, and made it iconic. Rian proved that the cliffhanger switch from similar serials, where the hero gets out of a car you saw him die in at the close of the last weeks instalment, just leaves the audience feeling cheated. \"He didnt throw the cock-a-doody LIGHTSABRE!\"\nThe opening of The Rise of Skywalker, by just throwing us in to it again mid drama and not explaining and giving too much exposition, if feels more like traditional, Lucas inspired Star Wars. \nThe real beauty of the break between stories in the Lucas scripts is that when we as an audience rejoin Star Wars characters, three years having elapsed since the last movie, they seem to have lived through those three years or so and their story has advanced. Always some time has passed in their galaxy, and we find ourselves looking at characters who have developed in some way, perhaps effected by the events of the movie we saw 3 years before. The title crawl serves to update us on events, not spelling everything out, but throwing us back into the story with a brief update. We find characters we feel we know changed and promoted to General and Commander, battles having been won by them, escape plans worked on for years perhaps. Time has past for them anyway and we feel that, certainly within the Lucas films and both the Force Awakens and The Rise of Skywalker. We get dropped into it all and have to catch our breath then catch up. \nThere is a lot of fan service in this movie, its true. I felt at times that Disney was apologising for Last Jedi. For me they needed to, but theres that one moment at the end between Maz and Chewie that I already know I'll grow to loath, and anticipate with same dread as I do the approach of Jedi Rocks in the currently messed with ROTJ. Their scene just feels a bit clumsy and forced. Again its referencing the old trilogies and tv shows, to connect dots and link the new to the old. It would be almost better if George had gone back and given him one in ANH digitally. (I hope thats too cryptic to be a spoiler😏).\nThe real beauty of Star Wars in film, is that ok George Lucas borrowed many elements of our hero stories, mythologies and history to create this Galaxy, every fantasy writer does. But its the unexplained that makes the original movies so wonderful for me. The characters live in the Star Wars mythology, with all the impossible technology and it is fantastical and goofy at times, but the characters speak in a very real and human way. Thats the way Lucas wrote the dialogue (Harrison.. shhhhh🤫).\nThe reference to names of places or people that just don't get explained or mentioned again. Achorhead, The Battle of Taanab, Bothans, etc, ect. Thats how we speak in our real world, we dont explain everything we say to eachother and we are not certain to end up at a location because we mention it. The original trilogy is mysterious but somehow familiar in a way. The beauty of the reveal of Jabba the Hutt as a giant slug in ROTJ was that in the previous two films we had only heard a name. But it would have been just as truly Lucas to have never shown him unless the story really called for it, which it did. (He vomited on his own good writing when he added him to ANH for the \"Special\" editions.)\nStop explaining Star Wars and showing us everything Disney!!  Leave threads..., let kids imaginations and fan fiction guess at what things are. It helps this fantasy be a little more believable too. I dont want to know what a Bothan looks like if its just to show me you know Star Wars!\nThe issue with this trilogy specifically is that the characters didn't have time to develop between The Force Awakens and The Last Jedi. \nIf you think about it the whole time scale spent between the opening of Awakens and the  closing credits of Last Jedi, for the characters, may only have been a week, two, a month? And how did those characters develop in that time? I don't remember any in Last Jedi.\nJJ has dropped us in to the action from the outset again with The Rise of Skywalker, we know we have a bit to catch up on, but that's traditional Star Wars and feels true to the Lucas films. The opening crawl update is less redundant than the one in Last Jedi.\nThey did a great job in delivering for us a decent Star Wars movie with The Rise of Skywalker, paying respect to Lucas vision. I just wish I could see JJs middle chapter in his trilogy. 😩","displayName":"Charlie N","displayImageUrl":"https://graph.facebook.com/v3.3/1017408980/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":true,"createDate":"2019-12-21T02:01:23.987Z","updateDate":"2019-12-21T21:31:40.226Z","user":{"userId":"852747055","realm":"RT","displayName":"Charlie N","accountLink":"/user/id/852747055"},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_4","review":"Don't listen to the critic reviews. If you enjoyed The Last Jedi then you most likely won't like Rise of Skywalker. But this film comes back to the fans and answered what they wanted to see. Any questions you had from The Force Awakens will be answered in here. It's a shame JJ Abrams wasn't given the second movie because this could have been an amazing trilogy. I really enjoyed watching Rise of The Skywalker and think JJ did the best he could with what Johnson left him ( which wasn't much of anything).","displayName":"Kevin S","displayImageUrl":"https://graph.facebook.com/v3.3/100001266955400/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T01:55:07.491Z","updateDate":"2019-12-22T21:01:05.564Z","user":{"userId":"927387083","realm":"RT","displayName":"Kevin S","accountLink":"/user/id/927387083"},"score":4,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_0_5","review":"Lazy, messy, annoyingly frustrating, and deeply disappointing. What a complete waste of a sequel trilogy. Disney should be embarrassed, Kathleen Kennedy should be fired, and JJ Abrams and Rian Johnson should never be aloud to be creatively involved with anything Star Wars related ever again. I feel so bad for George Lucas. I feel bad for Star Wars fans. You guys deserve better.","displayName":"Gregory C","displayImageUrl":"https://graph.facebook.com/v3.3/1289271801/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T01:53:08.788Z","updateDate":"2019-12-21T20:56:30.155Z","user":{"userId":"952013998","realm":"RT","displayName":"Gregory C","accountLink":"/user/id/952013998"},"score":0.5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"The Rise Of Skywalker just set up to go hard into sith stuff. Old Republic era... here we come! Abrams well done on saving us from the whatever The Last Jedi was.","displayName":"Nick S","displayImageUrl":"https://graph.facebook.com/v3.3/10105678979516512/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T01:53:00.726Z","updateDate":"2019-12-23T17:48:35.765Z","user":{"userId":"978455299","realm":"RT","displayName":"Nick S","accountLink":"/user/id/978455299"},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"I had a few issues with Last Jedi but I loved Rise of Skywalker.","displayName":"William S","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T01:42:05.264Z","updateDate":"2019-12-21T20:56:12.365Z","user":{"userId":"910216515","realm":"RT","displayName":"William S","accountLink":"/user/id/910216515"},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"Exactly what I want in a star wars movie!","displayName":"Bretton H","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T01:40:58.784Z","updateDate":"2019-12-22T22:03:45.512Z","user":{"userId":"1F3ED1EF-37F7-463F-8394-41CFB2F4E6A8","realm":"Fandango","displayName":"Bretton H","accountLink":null},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_1","review":"Sure, normies and commonlike movie-goers will like the film, but as a real star wars fan for years now who knows all about the lore and canon, this has been a slap on the face and a disrespect to the previously established story. Bringing old characters like Palpatine just for the nostalgic factor but destroying the legacy of classic characters such as Luke and Anakin is atrocious.","displayName":"Mauricio V","displayImageUrl":"https://graph.facebook.com/v3.3/570112613/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T01:32:45.856Z","updateDate":"2019-12-26T13:53:54.471Z","user":{"userId":"808724814","realm":"RT","displayName":"Mauricio V","accountLink":"/user/id/808724814"},"score":1,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_2","review":"You can't completely blame JJ or the actors for this. The universe was broken and they try their best to fix it. A breakneck first act filled with repetitive fetch quests followed by a laughable climax this movie fails to salvage the trilogy. A disappointing end for a story that was once held in such high esteem.","displayName":"Trent M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T01:32:43.161Z","updateDate":"2019-12-27T16:18:46.047Z","user":{"userId":"976940253","realm":"RT","displayName":"Trent M","accountLink":"/user/id/976940253"},"score":2,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_0_5","review":"Awful plot holes that defy Cannon and make absolutely no sense in the Star Wars universe. Really does not do justice to the original trilogy characters and doesn’t develop the Disney trilogy characters. The title of the movie makes no sense. The Skywalker’s are all dead, and a Palpatine has survived. Whether it’s Rey or Sheev doing essence transfer into Rey, the bottom line is a Palpatine survived. Skywalkers didn’t. Ray steals the Skywalker name, lightsabers, home, and millennium falcon. No wonder George Lucas wasn’t invited to the premiere of this movie. The entire movie and trilogy is a complete insult to George and the true fans of Star Wars over the past 42 years.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":false,"createDate":"2019-12-21T01:14:10.654Z","updateDate":"2020-01-03T05:25:59.137Z","user":{"userId":"260343791","realm":"RT","displayName":null,"accountLink":"/user/id/260343791"},"score":0.5,"timeFromCreation":"Dec 21, 2019"}]}