{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84NDQyMDY3MzMiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjBUMjA6MTQ6MzUuOTc0WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzgwNzQzNTAiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjBUMjA6MTU6NTcuNTkyWiJ9"},"reviews":[{"rating":"STAR_4_5","review":"The Last Jedi was so bad - and I didnt want to get my hopes up for this one.\n\nBut.....it was AMAZING! I cared about the story, characters and the ending made me cry. Thank you JJ, you saved this trilogy.","displayName":"Joakim S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:15:57.592Z","updateDate":"2019-12-20T20:15:57.592Z","user":{"userId":"978074350","realm":"RT","displayName":"Joakim S","accountLink":"/user/id/978074350"},"score":4.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_0_5","review":"You cannot just judge this movie by itself because it is part of a greater trilogy. Overall this movie shows how rudderless this franchise has gone with someone at the helm, planning out the four year journey Disney was embarking. Instead we got a set of movies that are reactions to the previous films. TFA was a response the the prequels, TLJ was a response to critiques of TFA, and TROS was a response to TLJ. From no on the Star Wars movies are breaking away from the trilogy formula and move towards the MARVEL method. Here's a spoiler, without a Kevin Feige at the forefront these movies will continue to be unfocused.\n\nThe problems with JJ is that he's a fine sci-fi creator but terrible when he works on an existing IP. People say Sci-Fi is limitless and that's true but not when you're working on an existing IP that has dozens of stories that establishes rules of the universe. Dave Filoni understand the SW universe well enough to expand it within the lore while JJ would rather write a plot convenience and shape the lore around it. I'm not mentioning this just to rag on JJ's lore building skills but it does gravely affects the overall writing. In this movie, most problems brought forth is solved so quickly it's ridiculous. Over and over again, plot conveniences just happen back and forth and it sucks any tension. I don't care that Kylo and Rey are \"force dyads\", that's lore horse$h!t to cover up plot convenience. Let's talk about super weapons and force powers, stop trying to artificially create tension by just increasing the power of something or making it bigger. \n\nDid we seriously have to get death star tech again? Star wars is more than just Death Stars, Star Wars is not creatively bankrupt but the people who's been making new stories in this universe seems to be. I heavily opposed bringing Palpatine but they did it and it lame. I'm so glad that Anakin and Luke's heroics was all leading to a Palpatine to kill a Palpatine, that's what all 9 movies were leading up to, Rey. A character who is uninteresting because incompetent planning didn't give her a proper 3 movie arch that reveals her personality and personal aspirations to the audience. Kylo is probably the only character in these movies to actually be properly written, Finn was close but he lacks growth as a character, while Rey and Po just exists. It was nice for them to be together but honestly, are they even friends? May as well be but the previous two movies didn't really show them as a unit and this movie finally realized that it maybe proper to have our main cast to share the screen together for an extended period of time but its it's too little too late. I'm glad there were lightsaber fights but they remain to be underwhelming with too many medium-close range shots and choreography wins no awards. Same with the space battles, nothing spectacular again. This movie felt like Game of Thrones Season 8, I knew it was going to be bad, the last two season already disappointed me and even though I wasn't expecting much, I was still disappointed. A lot of user reviews here remind me of people who enjoyed Season 8. 'I know there's some flaws but I'm emotionally satisfied', that's just dumb.\n\nAlso, how dare they create a CGI Carrie Fisher. I can't forgive them for that, 100% disrespectful and they even said earlier in production that they wouldn't do it but they did. Your contract to appear in Disney films is not up after your own passing, we gotta sell the merchandise of Leia with a lightsaber, gonna sell like hotcakes. REMEMBER STAR WARS?!","displayName":"Andrew S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":true,"createDate":"2019-12-20T20:15:24.440Z","updateDate":"2019-12-20T20:15:33.071Z","user":{"userId":"933473718","realm":"RT","displayName":"Andrew S","accountLink":"/user/id/933473718"},"score":0.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_0_5","review":"Maybe the second best after JJ first film. But the story is extremely flawed. No character development other than for Rey because they threw so many characters in there it was impossible to really root for anyone. But hey, at least it's over.","displayName":"Jason L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:15:01.072Z","updateDate":"2019-12-20T20:15:03.486Z","user":{"userId":"976954684","realm":"RT","displayName":"Jason L","accountLink":"/user/id/976954684"},"score":0.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_2","review":"The movie was bad, but not really due to the story itself. Sure the story had a few holes but the introduction of MORE superweapons (yes plural) and the absurd level to which the force is being used making its wields themselves basically also be super weapons this had me groaning in the theater today. This felt like JJ had a full trilogy planned and when Rian ignore his scripts JJ didn't alter his plan and just did part 3 anyways even though it made the first half hour of the film feel forced.","displayName":"Nathan G","displayImageUrl":"https://graph.facebook.com/v3.3/1621065500/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:14:59.670Z","updateDate":"2019-12-20T20:15:33.157Z","user":{"userId":"853121057","realm":"RT","displayName":"Nathan G","accountLink":"/user/id/853121057"},"score":2,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_4_5","review":"Wow! This movie a a ride and a half. Where to even start? The first time I saw this movie it hit me like a stack of books. As in it was a lot to take in. The second time I saw it, I just relaxed and let it hit me....and I absolutely loved it. I loved The Last Jedi and I love this final movie too, but for very different reasons. I suggest the critics to go back and watch this movie a second time and go in with an open mind. You will love it. Not saying it is perfect, but it is pure classic Star Wars","displayName":"Peter A","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:14:54.800Z","updateDate":"2019-12-22T20:13:23.434Z","user":{"userId":"978452552","realm":"RT","displayName":"Peter A","accountLink":"/user/id/978452552"},"score":4.5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"One of the best Star Wars movies","displayName":"Michael","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:14:46.625Z","updateDate":"2019-12-20T20:15:17.033Z","user":{"userId":"56368311-0FDC-4461-A04B-0C53387CF033","realm":"Fandango","displayName":"Michael","accountLink":null},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_2","review":"JJ Abrams is really great at mimicking a Star Wars movie but is not up to the task of writing one. The Rise of Skywalker is nostalgia bait that gives the finger to The Last Jedi at the expense of storytelling. Rather than craft an original story, Abrams felt that the final chapter in the saga should be spent putting down a fellow filmmaker and rushing through a convoluted plot at lightspeed. Let's hope that when Disney inevitably announces Episode X in 10-15 years they get someone else to map out the next trilogy.","displayName":"Andrew P","displayImageUrl":"https://graph.facebook.com/v3.3/538649598/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:14:42.853Z","updateDate":"2019-12-20T20:14:54.616Z","user":{"userId":"856128435","realm":"RT","displayName":"Andrew P","accountLink":"/user/id/856128435"},"score":2,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"Great movie Star Wars That end go seeing again ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:14:39.229Z","updateDate":"2019-12-20T20:14:39.229Z","user":{"userId":"260090473","realm":"RT","displayName":null,"accountLink":"/user/id/260090473"},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"JJ picked up the four corners of the Star Wars universe blanket and tied said corners together beautifully. He wrapped up the entire saga as well as could be asked and while some big opportunities were left on the table, I cannot fault him or the creative team for their choices. A perfect Star Wars movie.","displayName":"Michael C","displayImageUrl":"https://graph.facebook.com/v3.3/1482275427/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:14:39.087Z","updateDate":"2019-12-20T20:14:45.130Z","user":{"userId":"868589243","realm":"RT","displayName":"Michael C","accountLink":"/user/id/868589243"},"score":5,"timeFromCreation":"Dec 20, 2019"},{"rating":"STAR_5","review":"I had so much fun! I laughed, I cried and I was shocked with the outcome. JJ did such an amazing job the film looked beautiful.","displayName":"Ralph A","displayImageUrl":"https://graph.facebook.com/v3.3/1013315623/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-20T20:14:35.974Z","updateDate":"2019-12-20T20:14:46.000Z","user":{"userId":"844206733","realm":"RT","displayName":"Ralph A","accountLink":"/user/id/844206733"},"score":5,"timeFromCreation":"Dec 20, 2019"}]}