{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb181MEI0MkNFQS04MDMwLTQ3NTUtQUJBNy02MEJBMzMwMEU4NDIiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjFUMjE6MzI6NDcuODkxWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzg0NjExOTkiLCJlbXNJZCI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OSIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6ImQ3MDgzNzk1LTNhYjctM2IxNy05NzE3LWJiZTY0MDFmZmQ3OV9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMjFUMjE6MzM6NDkuMzczWiJ9"},"reviews":[{"rating":"STAR_5","review":"This movie was awesome and entertaining to watch.  Although there was a few times it seem like the story going in other directions, it was a very entertaining movie.  I know that this movie will be a delight to the younger generation of Star Wars fans and not so to the older generation.  It was a great movie and I plan on seeing it again.","displayName":"Marvin N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T21:33:49.373Z","updateDate":"2019-12-21T21:33:51.729Z","user":{"userId":"978461199","realm":"RT","displayName":"Marvin N","accountLink":"/user/id/978461199"},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"Great end to an amazing saga. Brought back many memories from the last 42 years. Have to see it!","displayName":"David J","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T21:33:45.503Z","updateDate":"2019-12-21T21:33:45.503Z","user":{"userId":"E5BB056D-FF52-4171-A4DD-BD021F156082","realm":"Fandango","displayName":"David J","accountLink":null},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"Incredibly surprised at how much I loved this film. I do not understand the mixed reviews from the critics. Redeems many of the flaws in the sequel trilogy. Fantastic bookend to the Skywalker franchise.","displayName":"Time Lord Stu","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T21:33:37.268Z","updateDate":"2019-12-21T21:33:37.268Z","user":{"userId":"7C2367BA-CAE5-493E-AF6B-9B786B84C882","realm":"Fandango","displayName":"Time Lord Stu","accountLink":null},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"Excellent wrap to the series. Best of the modern 6 films.","displayName":"Steve M","displayImageUrl":"https://graph.facebook.com/v3.3/10106651116605858/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T21:33:32.515Z","updateDate":"2019-12-21T21:34:00.901Z","user":{"userId":"976978848","realm":"RT","displayName":"Steve M","accountLink":"/user/id/976978848"},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"I can see where the criticism is coming from, but any problems can be traced back to the previous two movies in this series. They introduced so many plot lines and questions that one movie couldn't snip them all. It doesn't help that nearly every character needed some sort of redemption arc or demonstrated maturity from the last movie.  Others? Well, it seemed like their arcs finished in the previous movie, but they were main characters. How do you sort it out without doing a disservice?  You really can't. But this movie succeeded in having a lot of great moments strung together and did finish everything up.  A tremendous achievement!","displayName":"Pip T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T21:33:25.505Z","updateDate":"2019-12-21T21:33:35.034Z","user":{"userId":"245175153","realm":"RT","displayName":"Pip T","accountLink":"/user/id/245175153"},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"I found myself heading to the theater to see Rise of Skywalker(RoS) at one in the morning. I was worried my fatigue and my preconceived notions would see me leaving the theater 2.5 hours later feeling exhausted and disgruntled. In the months leading up to RoS I diligently searched through every digital grapevine and read every rumored leak I could procure in an attempt to build my case as to why this movie would over promise and under deliver. I was convinced like many who have lost hope, that Episode 9 could never provide a satisfying and triumphant end to a saga as grandiose and widely loved as this one. But today is a day I am happy to admit that I was wrong. RoS was almost exactly what I wanted and needed from the finale. \n\nIt is hard to decide what pieces to touch on first, but I want to first pull from a part of the latest Mandalorian episode. Some of us were maybe a little naive and blindly optimistic that our weekly dose of space western was going to provide a lead in or tie of some sort to RoS. I do believe it did although maybe not how some of us imagined.  At the end of a rather intense dragon like creature encounter, we see baby yoda utilize force healing to halt the poison and mend Karga. I love how the teams collaborated to have this concept delivered by one of the most beloved Star Wars characters of recent imagining(This may have been addressed in a book or lore somewhere but I am simply a movie and game consuming fan, so please do not judge me). What I love about this whole portion is it prepared the audience's minds to receive some crucial parts in RoS and not instantly doubt or reject them.  I applaud this creative direction and I love how an intriguing topic was shared by both projects.\nI have seen many reviews that have been criticizing RoS for playing it safe and paying too much into fan service and not taking enough risk as was the opinion of many with The Force Awakens. However, I could not disagree more. I would argue that at the end of such a beloved franchise is not the time to be taking too many creative risks. How quickly many forget the creative risks taken in The Last Jedi and how they were received.  I believe there were enough new concepts and venues introduced that we did not need to be expecting a reinvention of the wheel but rather a victory lap full of nostalgia, iconic battles, and a satisfactory ending, which wrapping it up where it all began seemed fitting. \n\nNow to my thoughts on Leia and Luke. I admittedly use to be of the opinion that Leia should have been aboard the ship on that heroic mission in TLJ, not Vice Admiral Holdo. But reflecting upon this mindset it would have seen Leia conclude her journey in the TLJ in a very anticlimactic move that had no apparent lasting impact. I will admit that I don't feel Leia was of any real impact in RoS, but for fans I believe the team recreated her and bid her farewell with class in what I believe was a difficult plot line to solve.  Regarding Luke's role in this movie I was caught off guard to see a force ghost interact with the physical world from catching the lightsaber to resurrecting his X-wing from the depths of the waters of Ahch-To. Like the force healing above, I am unsure if this has been known in books or lore but as a viewer encountering these, I felt that it was probably due to my lack of lore knowledge and something I was just not privy to.\nRegarding the storylines of Rey and Ben I feel they travelled a path we all somewhat expected. Ever since the tease of Palpatine's sinister laugh in early trailers, we have more or less assumed a showdown would inevitably happen with the three.  While some may argue the chase across the galaxy writing was tiresome, I choose to look at it more as an exposé of force development and how far the characters have come in fulfilling their roles, although some more than others. \n\nMy main point of criticism that I thought could have used improvement was certain areas of the writing. In more than one area the writing lacked any quotable power. Certain replies or moments of rising tension lacked lines that will be remembered in years to come. I would also suggest that some comic relief could have been easily cut to maintain the mood the director was intending for the audience to be experiencing. Improper or poor comic relief can be distracting and ruin the ability to be caught up in a tense moment.  Lastly, I would have liked to see a more compelling reason for the spy. I believe his purpose was loosely established and never really came to an impactful reason to justify existence. \n\nOverall, I felt the movie was one of the stronger offerings in recent years and provides much in the way of excitement and nostalgia. Regarding the last three episodes and whether or not you have been a fan of the offerings, I believe Star Wars movies eventually go on to become broadly accepted and embraced. I recall the general opinion of the prequels when they released and it wasn't overwhelmingly positive, certainly none of them would have been certified fresh.  Fast forward 15-20 years and\nthere is a good chance that you know quite a few people who will profess them to be their all-time Star Wars favorites. The point is that sometimes it is hard to accept new entries into a world that each of us have spent many hours imagining and indulging in. But now arriving at the end of this lifelong Star Wars saga, I can say I am glad each one of them exists. In conclusion, my thoughts of the Star Wars franchise moving forward is best summed up by the words of a character in one of my other favorite franchises, \"I think I'm quite ready for another adventure\"(Bilbo, Return of the King).","displayName":"Maximilian H","displayImageUrl":"https://graph.facebook.com/v3.3/778395202/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":false,"createDate":"2019-12-21T21:33:15.620Z","updateDate":"2019-12-21T21:33:23.682Z","user":{"userId":"805804833","realm":"RT","displayName":"Maximilian H","accountLink":"/user/id/805804833"},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"Loved it. Took the whole family. What an exhilarating ride! There were some corny parts but overall it was a really good movie.","displayName":"Victor S","displayImageUrl":"https://graph.facebook.com/v3.3/100005172541176/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T21:33:14.043Z","updateDate":"2019-12-21T21:33:17.973Z","user":{"userId":"978461242","realm":"RT","displayName":"Victor S","accountLink":"/user/id/978461242"},"score":5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_3_5","review":"Well I saw the #Starwars #riseofSkywalker and you know what I enjoyed myself I give it a B+👍🏾☺️","displayName":"Mark M","displayImageUrl":"https://graph.facebook.com/v3.3/505308326/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T21:33:13.557Z","updateDate":"2019-12-21T21:33:53.100Z","user":{"userId":"783250426","realm":"RT","displayName":"Mark M","accountLink":"/user/id/783250426"},"score":3.5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_0_5","review":"Joyless, soulless and cynically made. I loved TFA and TLJ, but the more I think about this one, the more I dislike it. Babu Frik was pretty good though.","displayName":"Brent W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T21:32:51.592Z","updateDate":"2019-12-21T21:32:51.592Z","user":{"userId":"978461187","realm":"RT","displayName":"Brent W","accountLink":"/user/id/978461187"},"score":0.5,"timeFromCreation":"Dec 21, 2019"},{"rating":"STAR_5","review":"Really put a good closure for what it was working with and the nostalgic moments worked for me.","displayName":"Orlando E","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-21T21:32:47.891Z","updateDate":"2019-12-21T21:32:47.891Z","user":{"userId":"50B42CEA-8030-4755-ABA7-60BA3300E842","realm":"Fandango","displayName":"Orlando E","accountLink":null},"score":5,"timeFromCreation":"Dec 21, 2019"}]}