{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb19ERDQyNDMxMi02RUU5LTQwMEQtQTQ4Ny04QzdBRDQ1MUVBRTEiLCJlbXNJZCI6IjhhMzYzNzgwLTFmMTEtMzQwYy04ZWNiLWNmMDQ4N2ZmNDdmMiIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhhMzYzNzgwLTFmMTEtMzQwYy04ZWNiLWNmMDQ4N2ZmNDdmMl9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMTVUMTg6MDM6NTAuNDIxWiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb181NDBkYWQxNS04NzQyLTQ3ZTItOWQxOS1hYjBiZGYzYzMwYzkiLCJlbXNJZCI6IjhhMzYzNzgwLTFmMTEtMzQwYy04ZWNiLWNmMDQ4N2ZmNDdmMiIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhhMzYzNzgwLTFmMTEtMzQwYy04ZWNiLWNmMDQ4N2ZmNDdmMl9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTItMTVUMTk6MjM6MjguMjI4WiJ9"},"reviews":[{"rating":"STAR_5","review":"Really good plot twists and very entertaining","displayName":"Maria B","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-15T19:23:28.228Z","updateDate":"2019-12-15T19:23:28.228Z","user":{"userId":"540dad15-8742-47e2-9d19-ab0bdf3c30c9","realm":"Fandango","displayName":"Maria B","accountLink":null},"score":5,"timeFromCreation":"Dec 15, 2019"},{"rating":"STAR_4_5","review":"I loved everything about this movie, the only thing that keeps me from saying that it was perfect is that I was not very surprised at the end, regarding the character involved and not the story itself. I believe it was intentional, since the movie presented the character in question as too suspicious to be true, but in the end it was, which made it surprising but it didn't leave me feeling very surprised because I had already suspected of the character at some point in the story. Besides that, like I said, I loved everything about this movie, the atmosphere, the acting, the scenario etc","displayName":"Bruna N","displayImageUrl":"https://graph.facebook.com/v3.3/1296872440409612/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-15T19:00:30.041Z","updateDate":"2019-12-15T19:00:38.792Z","user":{"userId":"976339159","realm":"RT","displayName":"Bruna N","accountLink":"/user/id/976339159"},"score":4.5,"timeFromCreation":"Dec 15, 2019"},{"rating":"STAR_5","review":"It was really entertaining.  Nice to have a good old mystery with several twists and turns.  Great characters.","displayName":"Angie","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-15T18:48:13.045Z","updateDate":"2019-12-15T18:48:13.045Z","user":{"userId":"FC958512-A67F-42B7-AD11-18363B301181","realm":"Fandango","displayName":"Angie","accountLink":null},"score":5,"timeFromCreation":"Dec 15, 2019"},{"rating":"STAR_5","review":"very well written and directed, lots of twists and turns for people who like a good mystery. No gore which was refreshing!","displayName":"Terry M","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-15T18:37:47.566Z","updateDate":"2019-12-15T18:37:47.566Z","user":{"userId":"4817d8d5-4ebc-42e3-93a9-94e69d350ca5","realm":"Fandango","displayName":"Terry M","accountLink":null},"score":5,"timeFromCreation":"Dec 15, 2019"},{"rating":"STAR_1","review":"Yuck.  Waste of Helen Mirren’s formidable talent.","displayName":"Daniel H","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-15T18:36:14.849Z","updateDate":"2019-12-15T18:36:14.849Z","user":{"userId":"A6FF6E32-B875-4344-B0BF-8FE7591A9DE5","realm":"Fandango","displayName":"Daniel H","accountLink":null},"score":1,"timeFromCreation":"Dec 15, 2019"},{"rating":"STAR_4","review":"Great \"Who done it\"..!  Agatha Christy would be proud..","displayName":"Robert Barney","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-15T18:18:30.352Z","updateDate":"2019-12-15T18:18:30.352Z","user":{"userId":"2A3C7E71-3736-4D86-9C08-B00F97DF9777","realm":"Fandango","displayName":"Robert Barney","accountLink":null},"score":4,"timeFromCreation":"Dec 15, 2019"},{"rating":"STAR_3_5","review":"I think I had higher expectations because of how highly rated it was. It was very entertaining, but Im still wondering why critics and viewers love it so much.","displayName":"Abigail E","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-15T18:11:10.494Z","updateDate":"2019-12-15T18:11:10.494Z","user":{"userId":"13a4d276-a8f2-4087-8af3-f7232b5d4fec","realm":"Fandango","displayName":"Abigail E","accountLink":null},"score":3.5,"timeFromCreation":"Dec 15, 2019"},{"rating":"STAR_4","review":"Daniel Craigs southern accent was inconsistent, other than that very entertaining","displayName":"David","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-15T18:04:57.075Z","updateDate":"2019-12-15T18:04:57.075Z","user":{"userId":"75f34df9-71df-44a5-8003-ec8398d7a410","realm":"Fandango","displayName":"David","accountLink":null},"score":4,"timeFromCreation":"Dec 15, 2019"},{"rating":"STAR_5","review":"Knives Out is steeped in American Mythology, the \"goodness\" of the Founding Fathers, the hand of Divine Providence, Manifest Destiny. Christopher Plummer's Harlan Thrombey embodies the old American Mythology, the self-made man, the man who built the fortune but was ultimately unable to pass his character on to his progeny. He is Providence, among other things, and Providence will reward goodness, not entitlement. Like any good murder mystery, the murder isn't really the point, but Knives Out takes it to another level.\n\nWhat is impressive about Knives Out is its ability to deliver both an engaging whodunit and as an allegory for 2019 America, giving careful attention to both. \n\nHistorically, the rise and fall of empires is often told as the stories of capable leaders and hardened people tempered by hard work and poverty. The children of prosperity become soft and weak, the \"robe and slipper\" generations are often culprits in the internal rot of an empire. Knives Out is the story of entitled, soft heirs who are entitled to a fortune, but who ultimately can never claim it, they've lost touch with the values that built America, and the Hand of Providence will give it to someone who is worthy.\n\nNo one in the Thrombey family can seem to give a straight answer. Detective Blanc, played by Daniel Craig, learns quickly that no one in the family can be trusted to tell the truth. Until he meets Marta, the family's live-in nurse, who for some reason can't lie without getting physically ill. \n\nMarta's inability to lie without vomiting appears at first as a fun gimmick Blanc Benoit can exploit to unpack the events leading up to the murder. Soon enough it becomes apparent that it isn't just that Marta can't lie, Marta (a fitting name given her Washintonesque nature), \"cannot tell a lie\". Well it turns out she can, but the \"anchor baby\" is she is called, is the only character who seems to experience any level of discomfort in doing so. Marta's mother is undocumented, and only Harlan ever seems to entirely accept her into the family. No one ever cares quite enough to remember where she's from, somewhere in South America. She's born in America, but the family treats her as perpetually foreign. \n\nThe movie does seem vaguely concerned with decoupling American values from whiteness, it is already drawing complaints that it wants to see whites \"replaced\". \nBut the point is that whiteness is not the same thing as goodness, and while Trump's America won't accept Marta, the mythological America will. \nAfter Harlan's death we are left determine the killer. We learn quickly that there were two familiar culprits, opioids and an immigrant. In traditional whodunit style, our protagonist was framed, and pinning the crime on drugs and immigrants is anything but an innocent mistake. This is the kind of detail that lets the movie work so seamlessly as a traditional murder mystery and a post-mortem for America.  And the blame is spread wider than one might expect-sure we have a Trump-loving uncle and an \"alt-right troll\", but it's the \"SJW\" niece who sells-out Marta. \n\nKatherine Langford's Meg Thrombey sounds like a bit of a keyboard warrior, the yin to our \"alt-right troll's\" yang. But she is ultimately unwilling to sacrifice the family stockpile when it comes down to it. She's an ally to immigrants until it means giving up wealth, and while Trumpism seems to be the movie's biggest targets, white liberals aren't spared.\n\nAs Daniel Craig gives the traditional murder mystery reveal at the end of the movie. the image of the knives and swords in a circle gives an impressive visual to one of the central messages of the film; we all have our knives out, pointing them at each other, but the knives are fake. It's really more of a donut, with a hole in the middle. And in that middle there's a donut hole, but that hole is its own donut with another donut hole, or something. What does it all mean? The donut is open to interpretation, but we are politically divided, in a state of perpetual accusation, but all similarly complicit. And that empty hole at the middle isn't empty, it is a contrivance that we're all joint victims of.\n\nKnives Out is deeply cynical, and at the same time naively hopeful. It draws on what often feels like an antiquated hope that Providence will smile on Goodness. Goodness that isn't focused on wealth will lead to prosperity. It's smart enough to know that its hope is probably too naïve, drawing on American foundational mythology while recognizing how problematic it all was to start with (in one of its final scenes, and in one of its most self-reflective moments, that family is reminded, after a particularly American nativist comment, that they weren't the original inhabitants of this house, they bought it from a Pakistani realtor in the 80's.) \nIn the end though, Knives Out does seem to hold affection for it's admittedly problematic mythology, and seems to hold belief that \"the arc of the moral universe is long, but it bends towards justice\".","displayName":"Ryan P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":true,"hasProfanity":false,"createDate":"2019-12-15T18:04:22.266Z","updateDate":"2019-12-15T18:04:22.266Z","user":{"userId":"978432760","realm":"RT","displayName":"Ryan P","accountLink":"/user/id/978432760"},"score":5,"timeFromCreation":"Dec 15, 2019"},{"rating":"STAR_3_5","review":"Well done.  Great actors especially Daniel Craig.  But too long by 20 minutes.  Had it figured out by then.","displayName":"Jackie","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-12-15T18:03:50.421Z","updateDate":"2019-12-15T18:03:50.421Z","user":{"userId":"DD424312-6EE9-400D-A487-8C7AD451EAE1","realm":"Fandango","displayName":"Jackie","accountLink":null},"score":3.5,"timeFromCreation":"Dec 15, 2019"}]}