{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb18wZTc0YzEyZC1mZDEwLTQxMDgtYTM3OS0zODBhZWY2MmI2NGMiLCJlbXNJZCI6IjhhMzYzNzgwLTFmMTEtMzQwYy04ZWNiLWNmMDQ4N2ZmNDdmMiIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhhMzYzNzgwLTFmMTEtMzQwYy04ZWNiLWNmMDQ4N2ZmNDdmMl9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMjhUMDE6NDE6NTUuMzk2WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJGYW5kYW5nb19DNjVCNkY4Qi1EMDNBLTQ3NTMtODMyNy1CMENERDdGMDU2NzAiLCJlbXNJZCI6IjhhMzYzNzgwLTFmMTEtMzQwYy04ZWNiLWNmMDQ4N2ZmNDdmMiIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6IjhhMzYzNzgwLTFmMTEtMzQwYy04ZWNiLWNmMDQ4N2ZmNDdmMl9UIiwiY3JlYXRlRGF0ZSI6IjIwMTktMTEtMjhUMDI6MzM6NDguMDI2WiJ9"},"reviews":[{"rating":"STAR_5","review":"Lots of twists and turns, great ending.","displayName":"Patrick Q","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T02:33:48.026Z","updateDate":"2019-11-28T02:33:48.026Z","user":{"userId":"C65B6F8B-D03A-4753-8327-B0CDD7F05670","realm":"Fandango","displayName":"Patrick Q","accountLink":null},"score":5,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_5","review":"awesomely fun! well worth the view","displayName":"Drew P","displayImageUrl":"https://graph.facebook.com/v3.3/10213859114095636/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T02:33:11.612Z","updateDate":"2019-11-28T02:33:51.630Z","user":{"userId":"977961731","realm":"RT","displayName":"Drew P","accountLink":"/user/id/977961731"},"score":5,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_4","review":"Rian Johnson is a filmmaker who likes to dabble across genres and put his high-concept stamp on them. His debut film, 2006's Brick, was a moody noir-flavored mystery set in a modern high school. His next film, 2009's The Brothers Bloom, was a whimsical con artist movie with cons-within-cons, and then Looper took time travel and twisted it into knots. From there the man was tapped to not only direct a new Star Wars movie but write one, and 2017's The Last Jedi proved so divisive that Russia literally created robotic accounts to exploit raw feelings to better sow discord among Americans and undermine democracy. Johnson must have needed a detox from that galaxy far far away, and Knives Out is his version of an Agatha Christie-styled parlor mystery. Once again Johnson has taken an older genre, subverted its form, and made it his own in a way that feels reverent while also fresh, fun, and thoroughly entertaining.\n\nHarlan Thrombey (Christopher Plummer) is a world-renowned mystery writer with a publishing empire in the millions. Then on the night of his birthday party, Harlan is found dead and every family member is a suspect. Could it be Marta Cabreara (Ana de Armas), the nurse who was last seen taking care of the old man? Could it be the daughter, Linda (Jamie Lee Curtis), eager to get out of her marriage to a cheating husband (Don Johnson, having a moment this fall)? Could it be the son Walt (Michael Shannon) who was going to lose his position of power in control of the family publishing empire? Could it be grandson Ransom (Chris Evans) who didn't show up on time for the party but showed up early for the will reading? The local police detective (Lakeith Stanfield) is doing his best to navigate the many suspects. And then there's the famed private eye, Benoit Blanc (Daniel Craig), hired by an unknown benefactor to discover foul play, who interrogates each family member, investigates the corners of the estate, and uncovers the truth.\n\nKnives Out is an incredibly fun movie to watch fly by for its extended 130-minute running time. The guessing game is enjoyable and there is a plethora of suspects and red herrings. Johnson is clearly a fan of the genre and doing his best to send it up in his own way while still staying true to its roots. Just look at the silly, Dickensian names and you can tell Johnson is enjoying himself (there's a character named \"Ransom\"). The mystery is clever but it becomes something more than a whodunnit (more on that below) and that's when Knives Out becomes special. Johnson has been repeatedly accused of being too clever by half, looking to produce some meta gymnastics to subvert audience expectations but to what end? This was an issue with the very end of Brothers Bloom and many had this same complaint with The Last Jedi. It's not enough to subvert expectations if the alternative isn't as compelling. Still, the choices that Johnson makes with Knives Out best serve to improve the emotional involvement in the story. That quality seems like a rarity when it comes to murder mysteries, because it's all about solving the crime and not necessarily how it affects the people on a more human level. It's a problem to be solved, an equation on the board, and the process eliminates the variables systematically. Except with Knives Out, Johnson opens up the central figure of Marta in such a way that she becomes a symbolic figure for the immigrant experience in this country, fighting for dignity and recognition. The political commentary isn't deep, and some of the shots feel a little cheap, but where Johnson succeeds is treating Marta as an empathetic stand-in for an often-invisible class.\n\nA half-hour or so into the proceedings, Johnson makes a very conscious choice that changes how we understand the mystery and especially how we're involved. I'll be careful about spoilers but suffice to say we get some very crucial information that makes us look at the murder differently. For the first act it feels like it's heading into a whodunnit with our clan of suspicious relatives, but it does something else, and I would argue something better. The problem with an Agatha Christie-style whodunnit is that the film is structured toward solving one central mystery and other important dramatic elements can fall by the wayside. Once you know who the killer is, was the journey to unmask them worth the twists and turns? Johnson instead lets the audience in on crucial information so that Knives Out alters, and the \"who\" is less important than how this information affects our relationship with a set of characters. It becomes less who is the killer and more will this culprit get caught and how will they beat the encroaching investigation. It transforms the entire structure, where instead of everything leading to one reveal, now it becomes a series of mini-panics and scrambles to stay ahead of a trap. This made me that much more personally involved and Johnson doubled the dramatic irony and tension of scenes. It becomes more a series of obfuscation where we're involved, remembering what clues might be the ones that ultimately prove too inescapable. There is a downside to this approach, letting out some big reveals early also serves to downplay the vast majority of the supporting players. These people are all given motives and suspicions early on, but once Johnson unloads his twists too many of these same characters just fade into the background, their story use extinguished.\n\nAnother cheerful aspect of Knives Out is simply how much fun its cast is having, none more so than Craig (Spectre). I never really gave much thought to Craig as a comedic actor until 2017's Logan Lucky, where he seemed to be unleashed, digging full bore into a charming and kooky supporting character, and it was downright joyful to watch him cut it up onscreen. He's given such serious, macho roles but he really excels in the right comedic role, and he just has the time of his life playing Blanc. His southern-fried accent, penchant for theatricality, and garrulous nature all contribute to both tweak the idea of the clever inspector while playing into those clichés as well, steering into the fun we have with them. There were several moments I was left breathlessly cackling because of how Craig was delivering his lines with such relish. His explanation of the mystery being \"a donut hole inside a donut hole\" might be one of the best film scenes of the year. It also helps that Blanc has an affectionate working relationship with Marta, the heart of our movie, which makes this eccentric even more endearing to the audience. Just as Kenneth Branagh is continuing the adventures of his mustachioed private eye, I would happily watch another murder mystery featuring Blanc if Rian Johnson felt so inclined (pretty please).\n\nThe other actors do fine work even if many of them end up being underwritten figures either meant to be threatening suspects or cartoonish buffoons. Armas (Blade Runner 2047) is the lead actress and often the contrast for our rich elites and their out-of-touch perspectives; she's the sounding board for their pettiness, acrimony, entitlement, and thinly-veiled racism. Armas just shines in the role as this figure who routinely makes the right choice even when it costs her. She's a relatable, hard-working, kind character trying to keep her moral bearing in this high-stakes contest. Evans (Avengers: Endgame) is enjoyably smug and a welcome force to antagonize and puncture the egos of his fellow family members. Shannon (The Current War) has his effective moments of conveying menace and being laughably impotent. Every other actor does good work but too many of them barely make a blip. I forgot Riki Lindhome (Garfunkel and Oates) was in this movie from scene to scene. It's a big cast so the goal is to make the most of their moments, and there isn't a bad performance in the bunch, though some are far more broad.\n\nKnives Out is a fun experience and further proof that when Rian Johnson really sets his mind on a certain genre, good and clever entertainments sprout. I want this man to tell the stories that excite him because there are still many more genres that could use the Rian Johnson stamp.\n\nNate's Grade: B+","displayName":"Nate Z","displayImageUrl":null,"isVerified":false,"isSuperReviewer":true,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T02:18:24.216Z","updateDate":"2019-11-28T02:18:27.387Z","user":{"userId":"900619245","realm":"RT","displayName":"Nate Z","accountLink":"/user/id/900619245"},"score":4,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_4","review":"awesome movie! even my tweens loved it, and all they like are movies built around explosions!  definitely worth a viewing!","displayName":"thecandytouch","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T02:17:58.790Z","updateDate":"2019-11-28T02:17:58.790Z","user":{"userId":"A9AA904A-C499-446B-8FCF-FBC0DA2E8480","realm":"Fandango","displayName":"thecandytouch","accountLink":null},"score":4,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_5","review":"movie was absolutely amazing","displayName":"Sean Torre","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T02:15:21.241Z","updateDate":"2019-11-28T02:15:21.241Z","user":{"userId":"879A9D71-3026-4268-9FBE-C4390A6D7B4D","realm":"Fandango","displayName":"Sean Torre","accountLink":null},"score":5,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_3_5","review":"Well crafted. It could have been a bit more fun ( if the cast took some acid or something :-). Ana de Armas outshines the entire cast. Why is Daniel Craig drunk and speaking with a southern droll? (He’s English from... England). Captain America, with dyed hair, eyebrows and a quarter inch thick makeup, as the trust fund jerk was a bit painful. (That vintage bimmer quite nice). Michael Shannon wasted in that lame role. Let me stop here. The movie is quite enjoyable. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T02:13:44.014Z","updateDate":"2019-11-28T02:20:51.539Z","user":{"userId":"951280869","realm":"RT","displayName":null,"accountLink":"/user/id/951280869"},"score":3.5,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_4_5","review":"Good plot. Good premise. Good acting. ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T02:06:50.968Z","updateDate":"2019-11-28T02:08:49.359Z","user":{"userId":"789248950","realm":"RT","displayName":null,"accountLink":"/user/id/789248950"},"score":4.5,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_3_5","review":"It was predictable, but the delivery was really good! Fun time, and rewatchable!","displayName":"Michael R","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T01:47:52.147Z","updateDate":"2019-11-28T01:47:52.147Z","user":{"userId":"D21A3732-F099-4971-838E-9A0EB8B163EC","realm":"Fandango","displayName":"Michael R","accountLink":null},"score":3.5,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_3","review":"With all the big names I was set for a good thriller, but this fell short. it was a little too long as plot could have been laid out and resolved sooner.","displayName":"too long","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T01:43:56.618Z","updateDate":"2019-11-28T01:43:56.618Z","user":{"userId":"6344A15A-82D9-452F-8FD6-29CC6DD25F5B","realm":"Fandango","displayName":"too long","accountLink":null},"score":3,"timeFromCreation":"Nov 28, 2019"},{"rating":"STAR_2_5","review":"From the cast I was expecting a little fun, but this a fairly straight whodunit.  Although Act III was a lot better than most whodunnits.","displayName":"Ted K","displayImageUrl":null,"isVerified":true,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2019-11-28T01:41:55.396Z","updateDate":"2019-11-28T01:41:55.396Z","user":{"userId":"0e74c12d-fd10-4108-a379-380aef62b64c","realm":"Fandango","displayName":"Ted K","accountLink":null},"score":2.5,"timeFromCreation":"Nov 28, 2019"}]}