{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY1ODk2ODYiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMzFUMTQ6NTM6MDQifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY1ODk3OTEiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMzFUMTU6NDI6MDAifQ=="},"reviews":[{"rating":"STAR_5","review":"I came to this movie 3 times. It was one of the best movies of all time. I would see it 1000 more times. I think we are all the \"Meh\" emoji. But like fr Id bang that hacker ;) hmu bb","displayName":"Brendan F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-31T15:42:00.000Z","updateDate":"2017-07-31T15:44:33.000Z","user":{"userId":"976589791","realm":"RT","displayName":"Brendan F","accountLink":"/user/id/976589791"},"score":5,"timeFromCreation":"Jul 31, 2017"},{"rating":"STAR_0_5","review":"Warning: Strong language throughout the review!! \n\nThe Emoji Movie has to be the wost film I've ever cringe on since The Boss Baby. This movie SUUUUUUUCKS!!!!!!!!!! The direction of the film is once again is in the hands of an awful director and writer in the movie business, Tony Leondis and co-writters (dumbest writers on the planet) Eric Siegel and Mike White. This movie is severely bad!! It's so bad, I almost received braces from my dentist!!\n\nSony has once again destroyed properties into their films, comparing animatied movies: example the Lego movie and the Lego Batman movie proves to be the successor of making a franchise out of product placements, and make it a great story out of it!! This movie,I cannot stand. This movie has a remarkable cast but ripping off Disney and Warner Bros. property's. The Emoji Movie is Norm of the North bad!! \n\nI have to give credit to the director that his only good project that he ever done in his life was DreamWorks the Prince of Egypt, fantastic under rated film, go seek it out. But making movies from Disney to Sony, Warner Bros., and DreamWorks. Way to ago, your crediting of direction is god awful. From his works of direction, Lilo & Stitch 2: Stitch Has a Glitch, Igor, Kronk's New Groove, Kung Fu Panda: Secrets of the Masters (straight to DVD movie). directing a terrible sequel to a film The Lion King (my favorite animated film) and making The Lion king II: Simba's Pride. It explains why there so many cum stains on the frame of the picture. And of course Home on the Range, Disney's worst nightmare of a movie!! For god sake's why is this man is still making movies today. DreamWorks did the right thing on shelving one of his movies that never released, B.O.O!! Thank you DreamWorks for not delivering another porn hub film!! \n\nThe story of the film was just pointless. For god sakes. they have one of the greatest actors Sir Patrick Stewart playing the emoji poop!! He was so embarrassed of the rule. He publicly announced his role on the Conan O'Brien show, just by practically making fun of it!! If you want to see a great film of his of this year, go see Logan!! T. J. Miller plays the emoji meh, he accidentally makes a wrong face, the evil emoji wants to delete him because he has different personalities, and then for TJ Miller's character saying that \"emoji's is the most important way of communication\" Are you fucking kidding me!! What about a phone, what about email, Twitter or social media. Of course they have emoji's or some type of fracture of the relation in every single communication sources today, but NO ITS NOT!! \n\nTo be honest this is a complete rip off Inside Out and The Lego movie franchise. Sony has to be terrible of releasing animation of this year. Have you seen the new Smurfs movie!! It's not bad of the first two predecessors.. but for fuck sake's, it's still a complicated bad story. The moral of the story of the emoji meh is going to dropbox!! FOR FUCK SAKES.. WHY!!!! \n\nThis is what I think of kids on wanting to go see these types of films, their emotions blossom with a Disney film, because they related with the film and they get it. There were no kids in my theater, there were no other audiences in my theater. Only me, once this movie starts, I drawn out some notes writting \"fuck me, I hate this movie!!\" Almost 6 times!! \n\nThis movie did not have any single good jokes at all, I did not laugh, movies like wants to make a laugh should make people laugh. THATS ITS JOB!! The film didn't deliver the jokes!! And of course at the end of the film, a pointless, lazy, or any other live action or animated film gives us a pointless dance routine. \n\nFuck me this movie is terrible. I hated every single moment of it. A lot of times I do use emoji's. I never get so mad after a movie, yes I do feel dumb when I see a terrible movie. But in rage, here's an example; One of the lines of the movie that turned me off \"wow poop, your so soft!!\" I immediately turn off and start cringing!! This movie is terrible, I can't believe I wasted day of not seeing Atomic Blond!! Go see Dunkirk, go see war for the planet the apes, anything just anything instead of the shit!! \n\nSony's next animated film is called The Star, the birth of Jesus Christ!! But instead of humans, animals with a modern feel! Sony animation, you're going to go bankrupt after this movie! Get your shit together and make a good movie!! Luckily I have no religion preference, I cannot wait to trash your next film!! \n\nGrade: Cringe of HATRED 0/10 \n\nSee my original review, click link right here: https://boxd.it/iUwxP","displayName":"Joey W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-31T15:41:52.000Z","updateDate":"2017-07-31T15:42:11.000Z","user":{"userId":"971983139","realm":"RT","displayName":"Joey W","accountLink":"/user/id/971983139"},"score":0.5,"timeFromCreation":"Jul 31, 2017"},{"rating":"STAR_5","review":"I rate this a 100 emoji out of 5, it was better then i thought it would be, i like the parts when they referenced that Alex watched porn.","displayName":"Gene M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-31T15:29:24.000Z","updateDate":"2017-07-31T15:30:30.000Z","user":{"userId":"976589766","realm":"RT","displayName":"Gene M","accountLink":"/user/id/976589766"},"score":5,"timeFromCreation":"Jul 31, 2017"},{"rating":"STAR_5","review":"amazibg  my kids cried at the beautiful scenes and tbh i did to","displayName":"fadfa s","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-31T15:21:56.000Z","updateDate":"2017-07-31T15:22:18.000Z","user":{"userId":"976589748","realm":"RT","displayName":"fadfa s","accountLink":"/user/id/976589748"},"score":5,"timeFromCreation":"Jul 31, 2017"},{"rating":"STAR_5","review":"Beautiful film, deserves 10 stars but could only give 5","displayName":"Jack D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-31T15:21:13.000Z","updateDate":"2017-07-31T15:21:47.000Z","user":{"userId":"976589749","realm":"RT","displayName":"Jack D","accountLink":"/user/id/976589749"},"score":5,"timeFromCreation":"Jul 31, 2017"},{"rating":"STAR_3_5","review":"It is a really heartwarming movie. It was also really cool to see the world inside the apps that we use every day. Not the best movie, but still pretty good.","displayName":"Jackson R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-31T15:12:51.000Z","updateDate":"2017-07-31T15:14:07.000Z","user":{"userId":"976589734","realm":"RT","displayName":"Jackson R","accountLink":"/user/id/976589734"},"score":3.5,"timeFromCreation":"Jul 31, 2017"},{"rating":"STAR_0_5","review":"WHAT INCLINED PEOPLE TO CREATE THIS UTTER PIECE OF GARBAGE!!!!","displayName":"bob h","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-31T15:06:16.000Z","updateDate":"2017-07-31T15:07:55.000Z","user":{"userId":"976589724","realm":"RT","displayName":"bob h","accountLink":"/user/id/976589724"},"score":0.5,"timeFromCreation":"Jul 31, 2017"},{"rating":"STAR_5","review":"Hands down one of the best films in recent history. Easily beating out all pixar movies. It will be remembered as one of the top human accomplishments in film history. One of the best thought out, And executed films of the past decades. 5 stars. 100% 10/10 I would definitely show my kids this film.","displayName":"Bombo%20 C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-31T15:05:03.000Z","updateDate":"2017-07-31T15:08:45.000Z","user":{"userId":"976589706","realm":"RT","displayName":"Bombo%20 C","accountLink":"/user/id/976589706"},"score":5,"timeFromCreation":"Jul 31, 2017"},{"rating":"STAR_5","review":"I just finished watching, I'm in tears, this is such a powerful movie","displayName":"Diego H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-31T15:04:19.000Z","updateDate":"2017-07-31T15:04:58.000Z","user":{"userId":"976589721","realm":"RT","displayName":"Diego H","accountLink":"/user/id/976589721"},"score":5,"timeFromCreation":"Jul 31, 2017"},{"rating":"STAR_5","review":"phenominal movie. Great humor. lowkey convinced its about transgender people. thank you.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1072838746182546/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-31T14:53:04.000Z","updateDate":"2017-07-31T14:55:26.000Z","user":{"userId":"976589686","realm":"RT","displayName":null,"accountLink":"/user/id/976589686"},"score":5,"timeFromCreation":"Jul 31, 2017"}]}