{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY1NzY3MzMiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMjhUMDE6NTI6NDkifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzAzMjMzNjIiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMjhUMDM6Mzk6MTgifQ=="},"reviews":[{"rating":"STAR_0_5","review":"It was a grueling experience. If there are aliens watching us with a finger on the button...press itð~¢","displayName":"Todd P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T03:39:18.000Z","updateDate":"2017-07-28T03:40:06.000Z","user":{"userId":"970323362","realm":"RT","displayName":"Todd P","accountLink":"/user/id/970323362"},"score":0.5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_4_5","review":"This movie was absolutely amazing and phenomenal,I went to see this movie with my two boys and they(myself included) enjoyed every single minute of it,8/10.","displayName":"Dallas J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T03:28:50.000Z","updateDate":"2017-07-28T09:00:47.000Z","user":{"userId":"976576871","realm":"RT","displayName":"Dallas J","accountLink":"/user/id/976576871"},"score":4.5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"To start this film was a true masterpiece of filmmaking with beautiful visuals and an inspired, original and truly gripping story. \nThis must be one of the best made films since the invention of motion pictures, seriously, Hitchcock, Nolan and Spielberg are put to shame by this cinematic experience which clearly takes influence from French New-Wave cinema and the work of German Director Uwe Boll. Along with the spell-binding cinematography the picture is companied with side splitting humour, an example of this is between Gene and a Coffee cup emoji. The scene goes down as follows: Gene walks by and says 'Hello tea.' The coffee then replies, 'I'm not tea, I'm coffee.' That's it! Probably the best joke shown in cinemas in the past decade.  This humour is as amazing as it is thanks to the stellar voice cast led by (Deadpool star) T.J. Miller, (Alvin and the Chipmunks Actress) Anna Farris and (Talk show host) James Cordon with a brilliant supporting cast including Sir Patrick Stewart (Masterfully cast as Poop), Maya Rudolph (Smiler) & Jake T. Austin (The highly relatable teen: Alex). Also, special commendation must go to Jennifer Coolidge and Steven Wright as Mary and Mel Meh (Respectively) who hilariously manage to keep up their monotone 'meh' voices for the who film.\nThe story itself has previously been compared to Wreck it Ralph and The Lego Movie however these reviewers are obviously just petty little man babies who can't notice art when they see it. The film's only issue regards the lack of payoff after the huge build-up of sexual tension between Gene and Jailbreak this is made up for, however, through Jailbreak's reasoning for (SPOILER) not reciprocating Gene's love. This shows a great move forward in the acceptance that women are not damsels in distress and love objects for white (or yellow in this case) men. The film is blessed with the enthused soundtrack of the greatest pop songs around and the relatability to its audience by using the current top trending YouTube videos: PPAP and I Like Trains. \nFinally, although primarily a comedy the film has two scenes that brought a genuine tear to my eye. I won't spoil the scenes but they involve Gene's parent meeting in Paris and something/someone getting deleted. \nIn conclusion, this chef-d'oeuvre of cinema manages to simultaneously be a brilliant comedy, a heart-breaking love story & a time capsule representing everything 2016/7 stands for.\n ??/10","displayName":"Oliver B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T03:11:07.000Z","updateDate":"2017-08-04T08:03:09.000Z","user":{"userId":"976576848","realm":"RT","displayName":"Oliver B","accountLink":"/user/id/976576848"},"score":5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"Awful movie. You can see they're running out of ideas when they make it about EMOJIS. It literally copies the exact same formula as Wreck-It Ralph. Would not recommend","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/483956428623051/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T03:05:43.000Z","updateDate":"2017-07-28T03:07:36.000Z","user":{"userId":"976576838","realm":"RT","displayName":null,"accountLink":"/user/id/976576838"},"score":5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_4_5","review":"The best movie in the history of films. 10/10 recommend. It's so original, spectacular, one of a kind, genius, unique, awesome, amazing, magnificent, and never done before. I haven't even seen this good quality shit yet but I already know that is gonna be the best. Highly recommend 100/10. I also love the characters like the talking hand or the walking shit ya kno. You could play this movie for movie night or at a gathering with friends or at a funeral aNYWHERE ANYTIME!! The Emoji Movie easily passes as the movie of our generation....ME ME BIG BOY","displayName":"Hannah B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T02:34:07.000Z","updateDate":"2017-07-28T02:43:49.000Z","user":{"userId":"976576790","realm":"RT","displayName":"Hannah B","accountLink":"/user/id/976576790"},"score":4.5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_0_5","review":"Why would anyone watch this piece of shit? IT'S FUCKING AWFUL. It's even worse than Food Fight.","displayName":"Tison K","displayImageUrl":"https://graph.facebook.com/v3.3/100005056384671/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T02:26:12.000Z","updateDate":"2017-08-02T12:47:28.000Z","user":{"userId":"961241071","realm":"RT","displayName":"Tison K","accountLink":"/user/id/961241071"},"score":0.5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_0_5","review":"All the good review's are ironic. I think that says all you need to know.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1697043120603521/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T02:11:14.000Z","updateDate":"2017-07-28T02:12:38.000Z","user":{"userId":"976576760","realm":"RT","displayName":null,"accountLink":"/user/id/976576760"},"score":0.5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"The Epitome of what hollywood has evolved into, some severe head trauma is required to even remotely see this as passable content. One's brain stem needs to be severely damaged to write something as atrocious as this film. I would actually rather live in the chernobyl fallout area than watching this bollocks. And you are in for a real treat for what hollywood is now known for. They are known for making hundreds of generic action and child appeal movies. I am dead, serious, this shit makes me want to defect to North korea. Probably because people who like this will be sent to the death camps. Kim Jong Un has some common sense after all! Again with being child friendly, are you really proud of entertaining the audience that made this thing (FNAF) popular? Also, i don't want to partake in any further movie created by the studio behind this, i think the producers might be on the sex offenders list, and that they might violate me. It's an example of how people get popular from doing the same shit everyone else is.\n\nTL:DR, this movie as great as they saved Hitler's brain. Because he's big mean and scary. He talks like a meanie guy. He wants to stop criminals and terrorists from coming into this country. He's a big fat mean man! Arrrrgggguuuhhhhh! I just hate him for wanting to balance the budget! Lastly, bringing jobs back to America!!! I want welfare not a fucking job! The man is pure evil!\n\n\nI'm right but you just happen to be severely retarded (just like every anti samsung propagandist) and lack braincells because nobody can read this shit made for ants, you can't even see it with a magnifier.\nEDIT: I see that you're an ex Nexus user, you're american and you have the american version. I'm sorry for even trying to argue with someone lacking any kind of braincells and that doesn't know shit about phones. If you had any functioning braincells you wouldn't buy the lagdragon version and then complain about its lag, and you would admit that battery percentage doesn't exist in other phone brainds, but you're american so that explains everything ¯\\_(?)_/¯ \n\nWith all that money hollywood is making from these shitty movies, they could buy the whole of Kenya, and still have enough to live happily for the next few decades. \n\nLove, TC.","displayName":"Chiken k","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T02:03:53.000Z","updateDate":"2017-07-28T02:15:00.000Z","user":{"userId":"976576726","realm":"RT","displayName":"Chiken k","accountLink":"/user/id/976576726"},"score":5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"This movie shows that despite a bad track record, movie studios can jump back to make masterpieces. The Emoji Movie is one of these exceptions, with its stellar voice acting and animation the emoji movie stands out as a must watch movie that beats the likes of Dunkirk.","displayName":"Emoji E","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T01:54:45.000Z","updateDate":"2017-07-28T01:58:39.000Z","user":{"userId":"976576734","realm":"RT","displayName":"Emoji E","accountLink":"/user/id/976576734"},"score":5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_0_5","review":"I made an account just to dislike this movie","displayName":"John F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T01:52:49.000Z","updateDate":"2017-07-28T01:52:49.000Z","user":{"userId":"976576733","realm":"RT","displayName":"John F","accountLink":"/user/id/976576733"},"score":0.5,"timeFromCreation":"Jul 28, 2017"}]}