{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY2MTgzNjQiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDgtMTJUMDc6Mjk6MjIifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY2MTk0OTMiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDgtMTJUMTY6MjQ6NDAifQ=="},"reviews":[{"rating":"STAR_0_5","review":"Hey, Vsauce, Michael here. Where are your fingers? Seriously. It's a pretty easy question. You should be able to answer it. But how do you know? How does anyone know anything?\n\nYou might say, well, I know where my fingers are. I'm looking right at them. Or, I can touch them, I can feel them, they're right here and that's good. Your senses are a great way to learn things. In fact, we have way more than the usual five senses we talk about. For instance, your kinesthetic sense, proprioception. This is what the police evaluate during a field sobriety test. It allows you to tell where your fingers and arms and head and legs in your body is all in relation to each other without having to look or touch other things. We have way more than five senses, we have at least twice as many and then some. But they're not perfect.\n\nThere are optical illusions, audio illusions, temperature sensation illusions, even tactile illusions. Can you turn your tongue upside down? If so, perfect. Try this. Run your finger along the outer edge of the tip of your upside down tongue. Your tongue will be able to feel your finger, but in the wrong place. Our brains never needed to develop an understanding of upside down tongue touch. So, when you touch the right side of your tongue when it's flipped over to your left side you perceive a sensation on the opposite side, where your tongue usually is but isn't when it's upside down. It's pretty freaky and cool and a little humbling, because it shows the limits of the accuracy of our senses, the only tools we have to get what's out there in here.\n\nThe philosophy of knowledge, the study of knowing, is called epistemology. Plato famously said that the things we know are things that are true, that we believe and that we have justification for believing. those justifications might be irrational or they might be rational, they might be based on proof, but don't get too confident because proven is not a synonym for true. Luckily, there are things that we can know without needing proof, without needing to even leave the house, things that we can know as true by reason alone. These are things that we know a priori. An example would be the statement \"all bachelors are unmarried.\" I don't have to go survey every bachelor on earth to know that that is true. All bachelors are unmarried because that's how we define the word bachelor. Of course, you have to know what the words bachelor and unmarried mean in the first place. Oh, you do? Okay. Perfect. That's great. But how do you know?\n\nThis time I mean functionally, how do you know? Where is knowledge biologically in the brain? What are memories made out of? We are a long way from being able to answer that question completely but research has shown that memories don't exist in the brain in single locations. Instead, what we call a memory is likely made up of many different complex relationships all over the brain between lots of brain cells, neurons. A major cellular mechanism thought to underlie the formation of memories is long-term potentiation or LTP. When one neuron stimulates another neuron repeatedly that signal can be enhanced overtime LTP, wiring them more strongly together and that connection can last a long time, even an entire lifetime. A collection of different brain cells, neurons that fire together in a particular order over and over again frequently and repeatedly can achieve long-term potentiation, becoming more sensitive to each other and more ready to fire in the exact same way later on in the future. They're a physical thing in your brain, firing together more easily because you strengthen that pattern of firing. You memorized. This branching forest of firing friends looks messy, but look closer. It could be the memory of your first kiss. A living souvenir of the event. If I were to go into your brain and cut out those cells, could I make you forget your first kiss or could I make you forget where your fingers are? Only if I cut out a lot of your brain. Because memories aren't just stored in one relationship, they're stored all over the brain. The events leading up to your first kiss are stored in one network, the way it felt to the way it smelled in different networks, all added up together making what you call the memory of your first kiss.\n\nHow many memories can you fit inside your head? What is the storage capacity of the human brain? The best we can do is a rough estimate, but given the number of neurons in the brain involved with memory and the number of different connections a single neuron can make Paul Reber at Northwestern University estimated that we can store the digital equivalent of about 2.5 petabytes of information. That's the equivalent of recording a TV channel continuously for 300 years. That's a lot of information. That is a lot of information about skills you can do and facts and people you've met, things in the real world. The world is real, right? How do you know?\n\nIt's a difficult question, but it's not rocket science. Instead, it is asking whether or not rocket scientists even exist in the first place. The theory that the Sun moved around the earth worked great. It predicted that the Sun would rise every morning and it did. It wasn't until later that we realized what we thought was true might not be. So, do we or will we ever know true reality or are we stuck in a world where the best we can do is be approximately true? Discovering more and more useful theories every day but never actually reaching true objective actual reality. Can science or reason ever prove convincingly that your friends and YouTube videos and your fingers actually exist beyond your mind? That you don't just live in the matrix?\n\nNo. Your mind is all that you have, even if you use instruments, like a telescope or particle accelerators. The final stop for all of that information is ultimately you. You are alone in your own brain, which technically makes it impossible to prove that anything else exists. It's called the egocentric predicament. Everything you know about the world out there depends on and is created inside your brain. This mattered so much to Charles Sanders Peirce that he drew a line between reality, the way the universe truly is, and what he called the phaneron, the world as filtered through our senses and bodies, the only information we can get. If you want to speak with certainty you live in, that is you react to and remember and experience your phaneron, not reality. The belief that only you exist and everything else, food, the universe, your friends are all figments of your mind is called solipsism. There is no way to convince a solipsist that the outside world is real. And there is no way to convince someone who doubts that the universe wasn't created just three seconds ago along with all of our memories. It's a frightening realization that we don't always know how to deal with. There's even The Matrix defense.\n\nIn 2002 Tonda Lynn Ansley shot and killed her landlady. She argued that she believed she was in the matrix, that her crimes weren't real. By using the matrix defense, she was found not guilty by reason of insanity, because the opposite view is just way healthier and common. It's called realism. Realism is the belief that the outside world exists independently of your own phaneron. Rocks and stars and Thora Birch would continue to exist even if you weren't around to experience them. But you cannot know realism is true. All you can do is believe.\n\nMartin Gardner, a great source for math magic tricks, explained that he is not a solipsist because realism is just way more convenient and healthy and it works. As to whether it bothered him that he could never know realism was true, he wrote, \"If you ask me to tell you anything about the nature of what lies beyond the phaneron, my answer is how should I know? I'm not dismayed by ultimate mysteries, I can no more grasp what is behind such questions as my cat can understand what is behind the clatter I make while I type this paragraph.\" Humble stuff. What strikes me is the cat.\n\nCats do not understand keyboards, but they know the keyboards are a fun place to be. It's a great way to get the attention of a human, they're warm and exciting, surrounded by noises and flashing lights plus cats love to get their scent on whatever they can, a mark of their existence. We aren't that much different, except instead of keyboards we have the mysteries of the universe. We will never be able to understand all of them.\n\nWe won't be able to ever answer every single question, but walking around in those questions, exploring them, is fun. It feels good. And as always, thanks for watching. Do you want more unanswered questions? Well, you're in luck. Today, nine other amazing channels on YouTube have made videos about questions we still haven't fully answered. Alltime10s has organized them and to watch them all click the annotation at the end of this video or the link at the top of the description. Enjoy.?","displayName":"Jay P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-12T16:24:40.000Z","updateDate":"2017-08-12T16:27:31.000Z","user":{"userId":"976619493","realm":"RT","displayName":"Jay P","accountLink":"/user/id/976619493"},"score":0.5,"timeFromCreation":"Aug 12, 2017"},{"rating":"STAR_3","review":"Bad ratings are unfair this film was ok Ashley had plenty of laughs.","displayName":"Andrew N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-12T15:37:09.000Z","updateDate":"2017-08-12T15:37:09.000Z","user":{"userId":"940992816","realm":"RT","displayName":"Andrew N","accountLink":"/user/id/940992816"},"score":3,"timeFromCreation":"Aug 12, 2017"},{"rating":"STAR_0_5","review":"The kids liked it. The parent thought it was awful. We checked our watch ever 2 minutes to see how much longer till the pain would end.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10154797067763044/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-12T14:05:09.000Z","updateDate":"2017-08-12T14:06:19.000Z","user":{"userId":"976619169","realm":"RT","displayName":null,"accountLink":"/user/id/976619169"},"score":0.5,"timeFromCreation":"Aug 12, 2017"},{"rating":"STAR_5","review":"The emoji movie. What can I say? Is it the best movie that has ever existed? YES! So throw away all of your dvds because this is the only film you will ever need because, as stated in the trailer, the emoji movie is HANDS DOWN the BEST family film. I had waited so long for July 28th but it didn't even come out until august 4th! So eventually I went to watch it and it was AMAZING 10/10 would recommend. He emoji movie is an EMOJINAL roller coaster. Gene just wants to fit in and be a working emoji but he isn't a good enough meh! This isn't like ANY other film out there and I don't know why people keep saying it's like Rek It Ralph!? Hi watch this movie as many times as you can until you can recite the movie word by word.","displayName":"Grace O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-12T11:37:46.000Z","updateDate":"2017-08-12T11:41:41.000Z","user":{"userId":"976618837","realm":"RT","displayName":"Grace O","accountLink":"/user/id/976618837"},"score":5,"timeFromCreation":"Aug 12, 2017"},{"rating":"STAR_0_5","review":"I wish I could rate it lower because this movie is like being raped","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/784205558452925/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-12T11:37:01.000Z","updateDate":"2017-08-12T11:38:02.000Z","user":{"userId":"976618833","realm":"RT","displayName":null,"accountLink":"/user/id/976618833"},"score":0.5,"timeFromCreation":"Aug 12, 2017"},{"rating":"STAR_5","review":"To say The Emoji Movie is a masterpiece is an understatement.\n\nIt is the movie equivalent of the second coming of Jesus Christ in every single frame.It's humour will make anyone laugh,not because it's mindless slapstick and toilet humour,but it's because it is always clever and witty.The coriagraphing is emotional and wonderful.The story is beyond anything I have ever seen in any media or in real life and the characters are so real they have stuck with me and I believed and still believes they are real.","displayName":"Pablo N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-12T11:24:47.000Z","updateDate":"2017-08-12T11:25:09.000Z","user":{"userId":"976618802","realm":"RT","displayName":"Pablo N","accountLink":"/user/id/976618802"},"score":5,"timeFromCreation":"Aug 12, 2017"},{"rating":"STAR_0_5","review":"allowing half a star is an insult to me this movie is one of those movies cobbled together for children to watch heck the movie is basically an advertisement and the 43% who like it are mostly children","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/107737639922833/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-12T10:14:46.000Z","updateDate":"2017-08-12T10:17:36.000Z","user":{"userId":"976618654","realm":"RT","displayName":null,"accountLink":"/user/id/976618654"},"score":0.5,"timeFromCreation":"Aug 12, 2017"},{"rating":"STAR_0_5","review":"junk junk junk. I the poop emoji about fits the rating it deserves.","displayName":"Edward S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-12T09:27:06.000Z","updateDate":"2017-08-12T09:27:45.000Z","user":{"userId":"976617347","realm":"RT","displayName":"Edward S","accountLink":"/user/id/976617347"},"score":0.5,"timeFromCreation":"Aug 12, 2017"},{"rating":"STAR_5","review":"Saw it with my best friend and we both loved it. Came out crying, and with good feelings.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/210877422777752/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-12T09:15:31.000Z","updateDate":"2017-08-12T09:17:00.000Z","user":{"userId":"976618546","realm":"RT","displayName":null,"accountLink":"/user/id/976618546"},"score":5,"timeFromCreation":"Aug 12, 2017"},{"rating":"STAR_0_5","review":"Not too fond in seeing this movie, has no sense of originality in the story and it tries to weakly rip off masters of Disney and Pixar, namely \"Wreck it Ralph\" and \"Inside Out\". The whole movie is a cheap 90 minute advertisement. In all due honesty, they should've gone with The initial \"Popeye\" film with Tartakovsky at the helm... An interesting yet highly flawed concept for an animated film, to quote Jon Lovitz as Jay Sherman, \"IT STINKS!\".","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/669501989910299/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-12T07:29:22.000Z","updateDate":"2017-08-12T07:37:02.000Z","user":{"userId":"976618364","realm":"RT","displayName":null,"accountLink":"/user/id/976618364"},"score":0.5,"timeFromCreation":"Aug 12, 2017"}]}