{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84OTc1OTgxNTkiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDItMTlUMDQ6MzA6NDcuNDk0WiJ9","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcxMzE3MTYiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDItMjJUMTg6NDY6MjcifQ=="},"reviews":[{"rating":"STAR_5","review":"The Emoji Movie is a masterpiece in every meaning of the word. The fantastic dialogue, the outstanding voice acting and the superb animation make you want to be a ??. If you do not love this movie, you are soulless.","displayName":"Ima P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-02-22T18:46:27.000Z","updateDate":"2018-02-22T18:47:51.000Z","user":{"userId":"977131716","realm":"RT","displayName":"Ima P","accountLink":"/user/id/977131716"},"score":5,"timeFromCreation":"Feb 22, 2018"},{"rating":"STAR_5","review":"Before I watched this movie I thought I would never want to see it. After the first time seeing it I thought, \"meh\". Then, it became my daughter's favorite movie so that meant watching it every single night and you know what? It became amazing! The parent mehs are simply adorable. The more I watch it, the more characters blossom and now my daughter and I are trying to learn the emoji pop. The problem isn't the movie...it's people these days. They want a fast thrill and then an end game and will never see it again. Zip. Try and have some personality will you and some humanity! We simply love this movie.","displayName":"Sarah D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-02-20T16:17:46.000Z","updateDate":"2018-02-20T16:22:41.000Z","user":{"userId":"977128496","realm":"RT","displayName":"Sarah D","accountLink":"/user/id/977128496"},"score":5,"timeFromCreation":"Feb 20, 2018"},{"rating":"STAR_0_5","review":"It makes me want to kill myself more than once.","displayName":"Nicole%20 l","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-02-20T09:19:26.000Z","updateDate":"2018-02-20T09:26:33.000Z","user":{"userId":"977128001","realm":"RT","displayName":"Nicole%20 l","accountLink":"/user/id/977128001"},"score":0.5,"timeFromCreation":"Feb 20, 2018"},{"rating":"STAR_5","review":"I watched it because of the low rating, and I ended up loving it.","displayName":"Joe S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-02-20T00:15:42.000Z","updateDate":"2018-02-20T00:17:07.000Z","user":{"userId":"977127406","realm":"RT","displayName":"Joe S","accountLink":"/user/id/977127406"},"score":5,"timeFromCreation":"Feb 20, 2018"},{"rating":"STAR_5","review":"Entre al living de mi casa, con una cierta desconfianza hacia esta película, luego de leer toneladas de criticas malas, las cuales siempre dictan mi juicio antes de ver una película, como cuando creí que iron man 3 era la mejor solo porque lo leí en internet, no me quiero desviar del tema, al fin y al cabo me senté a ver una película solo con el objetivo de criticarla y a medida que transcurría la misma me di cuenta que mis pre conceptos sobre todo lo que me creía me gustaba cambiaron dramáticamente, me di cuenta que no me gustaban las cosas que los críticos adoraban solo por haberlo leído en Internet, así que debo decirlo, emoji movie la mejor película de animación que vi en mi vida, y shawshank redemption es una basura.\n\nBueno amigos eso fue todo se despide su misterioso vecino el Andy.","displayName":"Andy V","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-02-19T19:11:50.000Z","updateDate":"2018-02-19T19:19:18.000Z","user":{"userId":"977126912","realm":"RT","displayName":"Andy V","accountLink":"/user/id/977126912"},"score":5,"timeFromCreation":"Feb 19, 2018"},{"rating":"STAR_1","review":"It is just BARELY more watchable than you have been led to believe, which is unfortunate, because the most pleasure you can derive from the film is by mocking it. Unfortunately its plot is an extremely generic movie-by-template following in the exact same mold as Toy Story, Lego Movie, and Inside Out. It's filled with lazy animation, nonsensical plot points, and insane product placement. Plus, its lead character is voiced by a sex crim. So yeah, one star.","displayName":"Anthony K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-02-19T16:43:45.000Z","updateDate":"2018-02-19T16:45:41.000Z","user":{"userId":"907023216","realm":"RT","displayName":"Anthony K","accountLink":"/user/id/907023216"},"score":1,"timeFromCreation":"Feb 19, 2018"},{"rating":"STAR_4_5","review":"i liked it. Everybody was kind of funny,especially hi-5. But i kind of wanted more because it was only 1hr & 26m.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-02-19T14:06:33.866Z","updateDate":"2018-02-19T14:06:33.866Z","user":{"userId":"260068665","realm":"RT","displayName":null,"accountLink":"/user/id/260068665"},"score":4.5,"timeFromCreation":"Feb 19, 2018"},{"rating":"STAR_0_5","review":"It was so cringy there was some points where i stopped watching it..","displayName":"Brittanie R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-02-19T13:52:38.000Z","updateDate":"2018-02-19T13:53:22.000Z","user":{"userId":"977020249","realm":"RT","displayName":"Brittanie R","accountLink":"/user/id/977020249"},"score":0.5,"timeFromCreation":"Feb 19, 2018"},{"rating":"STAR_1_5","review":"The Emoji Movie\n(2017)\n\nPlot:\nTake an adventure in the secret world inside your smartphone to Textopolis, a bustling city where all your favourite emojis live. In this world, each Emoji has only one facial expression - except for Gene (voice of T.J. Miller), who is bursting with multiple expressions. Determined to become \"normal\", Gene enlists the help of his handy best friend Hi-5 (voice of James Corden) and the notorious code breaker Emoji Jailbreak (voice of Anna Faris). Together, these unlikely heroes embark on an epic \"app-venture\" through the apps on the phone, each its own wild and fun world, to find the code that will fix Gene!\n\nReview:\nMy expectations for this movie really wasn't that high, especially after reading all of the bad reviews but after watching it, I was surprised to see that it actually had a back story. Although it's made for kids, we all can relate to the various apps which are mentioned throughout the film, and the different emoji's which help us to make texting easier but from an entertainment point of view, it really didn't do it for me. The jokes are pretty weak, for kids and adults, along with the storyline which become tedious after a while. Anyway, the movie is based within a phone, were the Emojis live in the city of Textopolis, hoping to be used by the user. Like every phone, each emoji has there own face expression, except for Gene (T.J. Miller) who can change his expressions, which is against there policy. When Gene is finally up to become an emoji on the users phone, he's unable to stick to one expression, which crashes the emoji database. The leader of the emojis, Smiler (Maya Rudolph) is forced to punish Gene for crashing the database, by deleting him all together, so he escapes from Textopolis, with the help of Hi-5 (James Corden) and Jailbreak (Anna Faris), and they try to break back into the phone with Smilers soldiers close behind them. Jailbreak uses her skills to get Gene back into the phone but they have to go through various apps to get through the backdoor in the users phone. While they are doing this, the users phone isn't working properly, so he goes to the App Store to delete all the apps, which will destroy Textopolis. With there life's in danger, and time against them, Gene and his pals have to convince the user that they should stay on the phone, even though Gene caused all of the problems in the first place. It's quite a sweet story, and the relationship between Gene and Jailbreak was quite emotional but it was all a bit childish for me. The animation was half decent but nothing amazing, and the various characters wasn't too bad, especially Hi-5 but there wasn't memorable moments. Personally I think that the director made a bad movie out of a good idea, which is why it didn't go down to well with audiences, even though it made a hefty profit. Disappointing!\n\nRound-Up:\nThis movie was directed and written by Tony Leondis, 50, who also brought you Lilo & Stitch 2 and Igor. With all of the different emojis, the director could have gone in many directions with this film but he chose to stick to one character, which was a bad choice in my eyes. His previous projects also wasn't that great, so I think that Sony made a big mistake picking him for the project. As I wasn't expecting much from this film, I wasn't that surprised with the outcome so it just has to go down as a bad attempt at a good concept.\n\nBudget: $50million\nWorldwide Gross: $217million\n\nGenre: Animation, Adventure, Comedy\nCast: T.J. Miller, James Corden, Anna Faris, Maya Rudolph, Steven Wright, Jennifer Coolidge, Patrick Stewart, Christina Aguilera, Sofia Vergera, Rachael Ray, Sean Hayes and Jake T. Austin. 3/10","displayName":"Leon B","displayImageUrl":"https://graph.facebook.com/v3.3/543725801/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-02-19T09:18:20.000Z","updateDate":"2018-02-19T09:18:28.000Z","user":{"userId":"813585590","realm":"RT","displayName":"Leon B","accountLink":"/user/id/813585590"},"score":1.5,"timeFromCreation":"Feb 19, 2018"},{"rating":"STAR_0_5","review":"The extent American movie studios will go to, in an effort to make money....1/2 star","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-02-19T04:30:47.494Z","updateDate":"2018-02-19T04:30:47.494Z","user":{"userId":"897598159","realm":"RT","displayName":null,"accountLink":"/user/id/897598159"},"score":0.5,"timeFromCreation":"Feb 19, 2018"}]}