{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzc1MzY5OTUiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMTItMjJUMTg6MDg6MTcifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85Nzc2OTEwOTgiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMTItMjhUMDU6MDk6MDAifQ=="},"reviews":[{"rating":"STAR_1_5","review":"Horrible film with a bad plot, but music ok","displayName":"Tyler T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-28T05:09:00.000Z","updateDate":"2018-12-28T05:09:28.000Z","user":{"userId":"977691098","realm":"RT","displayName":"Tyler T","accountLink":"/user/id/977691098"},"score":1.5,"timeFromCreation":"Dec 28, 2018"},{"rating":"STAR_3","review":"Es entendible la opinión de los críticos a la película ya que esta posee demasiados errores, y no la hace ver una película realista, pero en mi opinión lo único que se salva y la hace ver un poco bien es la animación, ya que los efectos son muy coloridos y bonitos, lo único que recalcar es que la película es mas para pasar el rato por su agradable colores y para entretenerse","displayName":"Eduard S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-27T13:39:07.000Z","updateDate":"2018-12-27T13:44:31.000Z","user":{"userId":"977616406","realm":"RT","displayName":"Eduard S","accountLink":"/user/id/977616406"},"score":3,"timeFromCreation":"Dec 27, 2018"},{"rating":"STAR_5","review":"I thought it was a true masterpiece and I thought that making a movie about emojis was such a smart move the people giving hate don't understand true art 😠 ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-26T21:08:03.523Z","updateDate":"2018-12-26T21:08:03.523Z","user":{"userId":"260136264","realm":"RT","displayName":null,"accountLink":"/user/id/260136264"},"score":5,"timeFromCreation":"Dec 26, 2018"},{"rating":"STAR_0_5","review":"Worst movie ever. I half expected a good movie, but 15 minutes in, we left the theater. DO NOT SEE","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/792386097777865/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-25T10:44:51.000Z","updateDate":"2018-12-25T10:46:00.000Z","user":{"userId":"977683136","realm":"RT","displayName":null,"accountLink":"/user/id/977683136"},"score":0.5,"timeFromCreation":"Dec 25, 2018"},{"rating":"STAR_5","review":"Works great if you are struggling to fall asleep!","displayName":"Sophester F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-24T15:51:44.000Z","updateDate":"2018-12-24T15:53:45.000Z","user":{"userId":"977681663","realm":"RT","displayName":"Sophester F","accountLink":"/user/id/977681663"},"score":5,"timeFromCreation":"Dec 24, 2018"},{"rating":"STAR_0_5","review":"a horrible sony film","displayName":"xavier h","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-24T09:39:35.000Z","updateDate":"2018-12-24T09:39:50.000Z","user":{"userId":"977681070","realm":"RT","displayName":"xavier h","accountLink":"/user/id/977681070"},"score":0.5,"timeFromCreation":"Dec 24, 2018"},{"rating":"STAR_0_5","review":"This movie is absolute garbage. My only question is why this was even thought of...","displayName":"Jason D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-23T14:58:51.000Z","updateDate":"2018-12-23T15:00:11.000Z","user":{"userId":"977674187","realm":"RT","displayName":"Jason D","accountLink":"/user/id/977674187"},"score":0.5,"timeFromCreation":"Dec 23, 2018"},{"rating":"STAR_0_5","review":"Weirdest thing ended up happening. I went into the theatre and they never played the movie, just an hour and a half of advertisements voiced by T.J Miller. A shame.","displayName":"Nathaniel D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-23T14:36:38.000Z","updateDate":"2018-12-23T15:06:30.000Z","user":{"userId":"972962833","realm":"RT","displayName":"Nathaniel D","accountLink":"/user/id/972962833"},"score":0.5,"timeFromCreation":"Dec 23, 2018"},{"rating":"STAR_3","review":"Back when this movie was first announced, all the way until after its release, all I heard about The Emoji Movie was how terrible is was going to be, how much of a corporate sellout it was, and the giant bomb it would end up as. Now, I won't say that it's not a corporate tool for cheap advertising, nor argue against its lack of success both critically and financially. But what I am here to do is play a bit of Devil's Advocate. Honestly, all things considered, The Emoji Movie isn't really THAT bad. Or, at least, I've seen much worse. As such, I don't think that it deserves ALL the hatred it gets. Hear me out on this one.\nLet me be clear here. I am not saying that The Emoji Movie is a great film. It's probably not even a good film. But it is a passable film, or at least not cancer in film form as most critics would describe it. Some of it does work, especially for young children, and some jokes did legitimately make me laugh, and I believe that the movie should be acknowledged for that. It's by no means a great feat, but that is at least something. Plot wise, it is a color by the numbers story of being unique but wanting to fit in, and always be yourself and blah and all those standard virtues parroted by kids' films. Is it new or at least innovative? No. Does it do it exceptionally poorly? Also no. It's serviceable for its audience and subject matter.\n\nAll of the actors here do just fine, with no real terrible performances or deliveries to speak of. When they do fall short, it is mostly the fault of the script not having a lot to work with. T.J. Miller does okay as the main character Gene the Meh Emoji. His character arc of wanting to be more in life than the one note that is expected of his station is nothing new, but it's not done godawfully here. Steven Wright and Jennifer Coolidge are good choices for his parents, and they embody the tone that their characters invoke. James Corden as Hi-5 and Maya Rudolph as the Smiley emojis are somewhat underutilized in terms of comedic potential. The human characters are all but meaningless to the plot or at least the action, so they are pretty much of no consequence. One of the many criticisms of this movie that I have seen is that such juvenile humor is beneath the great Sir Patrick Stewart as the Poo Emoji. I strongly disagree. If you are at all familiar with his work in several of Seth MacFarlane's projects (Family Guy, American Dad!, Ted), this is by no means beneath his talents. If anything, he too is kind of underplayed here as he has done far raunchier stuff.\nIn terms of the pop culture that this movie references, I will admit it is a little bit late to the party. I don't know anyone who plays Candy Crush anymore, but there is a decent amount of other neat things that pop up. Spotify, YouTube, Twitter, Instagram, it's all still relevant enough that it can resonate to the extent it needs. I will also say that this movie has a pretty good soundtrack, It is all modern pop, but it is upbeat and energetic, and doesn't delve too far into the annoying stuff.\nOverall, this movie is not anywhere near the cinematic cancer everyone says it is. It's no better or worse than any of the other average animated films we've seen over the last several years. It's not good, and there is far better stuff to show to kids, but if they want to see it, it won't make their brains melt.\nFinal grade: C","displayName":"Robert M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-23T13:19:08.000Z","updateDate":"2018-12-23T13:19:16.000Z","user":{"userId":"921490915","realm":"RT","displayName":"Robert M","accountLink":"/user/id/921490915"},"score":3,"timeFromCreation":"Dec 23, 2018"},{"rating":"STAR_1","review":"Sony is the most greedy company I know. They knew this movie would do absolute trash, but they knew people would see this to crap on it. Rumors say that there are going to be a sequel to this monstrosity. Want an example? Venom - done trash in the critic's mind but done incredibly in the box office. Now they are making (confirmed) more Spider-Man character stand alone movies. Like KravenTheHunter and Morbius. This animation was good but everything else about it is pure ass. I would not recommend. I would age this U some intense parts and crude jokes.\n\nGrade: D","displayName":"Ivan J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-12-22T18:08:17.000Z","updateDate":"2018-12-31T09:08:17.000Z","user":{"userId":"977536995","realm":"RT","displayName":"Ivan J","accountLink":"/user/id/977536995"},"score":1,"timeFromCreation":"Dec 22, 2018"}]}