{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85MTA1MzM2MjkiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMjlUMTg6NTI6MTIifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY1ODQyMjEiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMjlUMTk6NDc6MDYifQ=="},"reviews":[{"rating":"STAR_0_5","review":"A disgusting example of Hollywood commercialism. Sony should be ashamed of themselves, and I really hope this movie flops. Sony does not deserve to make money on this movie, Sony needs to lose money on this pile of garbage that shouldn't be considered a movie. Maybe if Sonly loses money on this their next movie won't be another bottom-of-the-barrel hunk of feces. The Emoji \"Movie\" is NOT a movie. This is just a 2-hour advertisement. There is zero artistic merit in this film. A brick wall makes a better movie than this. I despise this film to the core and you should, too. I despise what this movie represents for the current state on film. Just press the \"make 2-hour piece of media meant to entertain the masses\" button and churn out an effortless \"movie\" based on whatever is new and popular for the sole purpose of making money. And I'm not saying it's bad to want to make money. But it is unfortunate that so many of these made-for-theaters \"movies\" are bland, effortless, pre-packaged video files that feel more like they came out of an assembly line in a factory rather than made by actual talented people who understand that there's more to entertainment than jingling plastic keys in front of toddlers.","displayName":"Matthew S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T19:47:06.000Z","updateDate":"2017-07-29T20:09:08.000Z","user":{"userId":"976584221","realm":"RT","displayName":"Matthew S","accountLink":"/user/id/976584221"},"score":0.5,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_0_5","review":"No character development. No plot. No original or worthwhile jokes. Just atrocious.","displayName":"Mike T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T19:47:03.000Z","updateDate":"2017-07-29T19:47:41.000Z","user":{"userId":"976584218","realm":"RT","displayName":"Mike T","accountLink":"/user/id/976584218"},"score":0.5,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_0_5","review":"Please invent a \"Zero stars.\"\n\nI was convinced, 100% convinced that Norm of the North was the worst, most trite Pixar-knock off I have taken my Nieces/Nephews to see. \n\nI stand before you today, a downright liar. This isn't honestly even worth .5 of a star. Maybe an eighth. \n\nMy nephew is five and knows I am ALWAYS down for a movie, kids, animated or otherwise. Little man asked if \"it was ok if we watched something else forty five minutes in.\"\n\nI'm a HUGE fan of animated kids movies. I have pleasantly been suprised again and again by shows like How to Train Your Dragon, Kung Fu Panda, Zootopia and Kubo of the Two Strings. \n\nThese are shows that teach kids important lessons about life, love, power, friendship, family, bravery, acceptance and the belief that a hero isn't always the big guy in the shiny armor. \n\nThen this thing shuffled onto the floor like a drunken teenager let loose upon Mardi Gras. \n\nThe acting was phoned in, the story was so see through it hurt, the animation was well done but for 12 million, I'd hope to God they got something, and worst of all, the morals were so thinly veiled and shoved down your throat that you'd think you were watching Barney. But at least the big purple T-rex has good intentions. Not just shameless promotion of mobile games.\n\nI've seen great kids cinema. And I'm EVEN MORE offended at how poorly they mishandled this one. I wasn't expecting anything good. But I've NEVER seen a movie so bad it made we want to actually ask for my money back before now.","displayName":"Sam C","displayImageUrl":"https://graph.facebook.com/v3.3/100000091185055/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T19:45:41.000Z","updateDate":"2017-07-29T19:57:52.000Z","user":{"userId":"876514012","realm":"RT","displayName":"Sam C","accountLink":"/user/id/876514012"},"score":0.5,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_0_5","review":"Proper Perspective: \"Hey, go watch Wreck-It Ralph and replace all the candy puns with poop puns, the gamer world with apps on a phone, and give me 10-12 pages of story.\" From there I think it divulged down to 5-7 pages of story, tops. Let's talk about The Emoji Movie...\n\nOfficial Synopsis: Gene, a multi-expressional emoji, sets out on a journey to become a normal emoji.\n\nPlot: Ralph wants to be a good guy (I mean Jean wants to be a Meh) and he meets a glitch that turns out to be a princess (I mean Jailbreak), with his side character former appreciated friend Felix (I mean Hi-5) game jump (go into the wall-paper) to find a way to save everyone from being deleted (that is the same). Wreck-It Meh.\n\nTake: Seriously, just go watch Wreck-It Ralph, enjoy the quality that was that movie, and then imagine an Emoji themed movie with the literal exact same plot. No point in seeing this movie, because your imagination is better.\n\nThere were a couple of positive moments in the movie, which was ultimately a sizzle reel of puns about poop and old emoji's. \n\nA Facebook joke, that on its head is not original, was the funniest part of the movie with ease. \"Why have one real friend when you can have a ton of admirers.\" Well played movie. Also, a scene in Instagram where characters enter an image and it stayed the same, everything still, as the characters walked through the moment. Really cool image. Reminded me of the pool scene in La La Land.\n\nOther than that the movie is a rehash of Wreck-It Ralph with a dash of Inside/Out (I am being very generous), and a pinch of the Lego Movie. To be fair is 80% of a D- script of what a phone based Wreck-It Ralph might be.\n\nSony Pictures Animation is on a five year losing streak with fully animated movies. This years \"Smurf's: The Lost Village\" was a passable movie considering the previous Smurf entries, but \"Hotel Transylvania 2,\" \"Cloudy with a Chance of Meatballs 2,\" and now \"The Emoji Movie\" are all misses.\n\nOverall the voice cast was fine and the animation was stellar, like in virtually all studio animated movies recently. There was just virtually no character development and a paper thin story rushed in 91 minutes.\n\nThe story references felt dated and I saw this opening weekend. From an eggplant joke to a \"Bye Felicia\" reference this movie was all about puns and 2015's cultural identifiers. I've gone into movies in the past expecting a bad movie and been pleasantly surprised, this year's Rock Dog for starters, and I really like animated movies. But this was just a bad movie from the first trailer to when the credits rolled.\n\nRecommendation: My kids liked it, so yours might. Having said that they have liked literally every animated movie they have seen in their entire lives. So, yeah. Redbox this on a night you want to catch up on a show that is friendly for your kids. Pass, hard pass.\n\nThey even had a scene where they went to King Candy's Fungeon (I mean the phone's trash can)...","displayName":"Kristofer H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T19:45:38.000Z","updateDate":"2017-07-29T19:45:51.000Z","user":{"userId":"974137589","realm":"RT","displayName":"Kristofer H","accountLink":"/user/id/974137589"},"score":0.5,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_4_5","review":"Humor on many levels, with a universal theme of the intricate relationship between man, machine, and his struggles through society and romance. Truly a classical must-see, the only element missing from this movie is a touch of sorrow to truly complete the emotional, sensational rainbow we know as The Emoji Movie.","displayName":"Jacob T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T19:39:52.000Z","updateDate":"2017-07-29T19:47:48.000Z","user":{"userId":"976584197","realm":"RT","displayName":"Jacob T","accountLink":"/user/id/976584197"},"score":4.5,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_1_5","review":"1.5/10 Insult to internet culture","displayName":"tobey e","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T19:38:03.000Z","updateDate":"2017-07-29T19:38:52.000Z","user":{"userId":"976584194","realm":"RT","displayName":"tobey e","accountLink":"/user/id/976584194"},"score":1.5,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_2_5","review":"I might be the only person but I thought it was great. Took my 4 year old Thursday night and we had a great time.","displayName":"Laura G","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T19:32:51.000Z","updateDate":"2017-07-29T19:35:11.000Z","user":{"userId":"949890254","realm":"RT","displayName":"Laura G","accountLink":"/user/id/949890254"},"score":2.5,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_5","review":"Cinematic masterpiece ??","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/479016565781936/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T19:14:01.000Z","updateDate":"2017-07-29T19:14:51.000Z","user":{"userId":"976584130","realm":"RT","displayName":null,"accountLink":"/user/id/976584130"},"score":5,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_0_5","review":"The hands down worst movie I've ever seen.\nWere they trying to make the worst movie in existence?","displayName":"Robin H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T18:52:25.000Z","updateDate":"2017-07-29T18:53:36.000Z","user":{"userId":"976584073","realm":"RT","displayName":"Robin H","accountLink":"/user/id/976584073"},"score":0.5,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_4_5","review":"It was a funny, cute, entertaining kids movie. My kids loved it. I laughed as did my male companion. I don't understand the trolls but to each their own.","displayName":"Stacy S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T18:52:12.000Z","updateDate":"2017-07-29T18:52:12.000Z","user":{"userId":"910533629","realm":"RT","displayName":"Stacy S","accountLink":"/user/id/910533629"},"score":4.5,"timeFromCreation":"Jul 29, 2017"}]}