{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF84Nzc2OTQ2NjEiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMTAtMTZUMTc6NDU6MzYifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY3NzU3NjIiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMTAtMjBUMTQ6MjI6MzcifQ=="},"reviews":[{"rating":"STAR_0_5","review":"This was honestly the worst movie ever made...\nIt doesn't even deserve half a star it was so cancerous.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/362291024227602/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-20T14:22:37.000Z","updateDate":"2017-10-20T14:24:20.000Z","user":{"userId":"976775762","realm":"RT","displayName":null,"accountLink":"/user/id/976775762"},"score":0.5,"timeFromCreation":"Oct 20, 2017"},{"rating":"STAR_4","review":"I liked it. It may have been a cash grab, heavily endorsed, but most of the apps the movie explores we already have on our phones and use every day or we have heard of them and have made our decision on whether or not we want them. It had an original concept. It was entertaining. Fun characters. And need I remind everyone, it was meant for kids. Us adults sometimes go too hard on kids' movies. After I watched this movie, I watched another with my 10 year old. It was horrible. Very low production value, bad script, bad acting, unreal reaction to serious issues.....it was horrible. My kid loved it. She will probably watch it again....I will never.","displayName":"Sarah D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-20T00:44:04.000Z","updateDate":"2017-10-20T00:57:19.000Z","user":{"userId":"936125258","realm":"RT","displayName":"Sarah D","accountLink":"/user/id/936125258"},"score":4,"timeFromCreation":"Oct 20, 2017"},{"rating":"STAR_1","review":"the only good thing is maybe the environments","displayName":"Kit C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-19T16:04:37.000Z","updateDate":"2017-10-19T17:15:19.000Z","user":{"userId":"976773778","realm":"RT","displayName":"Kit C","accountLink":"/user/id/976773778"},"score":1,"timeFromCreation":"Oct 19, 2017"},{"rating":"STAR_1_5","review":"I guess it had to happen, we live in a time now where nothing is sacred, nothing is safe from being milked dry, and anything is free game. We've seen it all from various obscure choices in the videogame archives; to [i]Barbie[/i] to [i]Thomas the Tank Engine[/i] to board games and to [i]Lego[/i]. They will make a movie out of bloody anything given half a chance. I'm half expecting an animated movie about the world of marbles to roll along anytime soon (yes I'm proud of that pun).\n\nI think its fair to say I wasn't expecting anything much from this movie, if anything I only saw it out of pure morbid curiosity. I was simply intrigued at how they could construct a narrative around some mobile phone app icons. And my God do they try their best here! They [b]really[/b] stretch and reach and twist that thin ass plot as best they can. Does it work? Not really no, but kudos for trying.\n\nI mean I can't deny there are some nice little touches here, its not all terrible. The emoji's live inside a phone (duh) which is owned by a young boy named Alex. Said boy is going through the usual pre-pubescent angst with girls and whatnot and of course being young he uses his phone a lot. Within the phone the emoji's dwell in the city of Textopolis (I like it), their daily job is to produce their emoticon or expression on demand (when Alex uses it). Gene is a 'meh' emoji but he can also make other expressions which is looked upon as freakish, or like having a rare disease. When Gene gets his chance to be used by Alex he has a nervous breakdown and fudges it up. He then finds himself listed for deletion because he is now deemed a malfunction. Gene must now flee the city with another has-been emoji to help him find a hacker to hopefully get himself fixed.\n\nSo the plot is pretty much the same old shit we've many times before. The protagonist must go on the run to evade the antagonist and her henchmen (henchemoji's). Along the way the protagonist meets new friends that are considered losers basically; and in the end after numerous scrapes they all discover themselves and make friends (whilst saving the day). Its a standard plot mapped on top of this emoji concept. \n\nDespite that its still flippin' convoluted though, the nonsense they set up to explain how emoji's are used on a phone. Its kinda treated like a gameshow scenario where talented, experienced and obviously popular emoji's are used regularly (almost like a sports team). But if an emoji shows good promise or whatever then they get the chance to be 'promoted' onto the phones main app screen. It sounds ridiculous because it basically is. Then all the emoji's that aren't used anymore get lumped into a loser lounge type scenario. Very predictable but also somewhat daft as I'm sure most emoji's actually get used a fair bit the world over.\n\nCall me stupid but one of the main fun things about this movie was spotting all the different emoji's (sad I know). And sure enough they're all here, right down to the national flags. I quite like how the old emoticons are presented as old age pensioners, umm...that's about as clever as it gets really. Aside from that the entire movie plays out like a long TV advert for various smart phone apps like [i]Twitter[/i], [i]Candy Crush[/i], [i]Just Dance[/i] etc...The movie also uses every flippin' bit of computer jargon it can muster, in a very predictable and cringeworthy fashion. For instance, pirating is represented by...yep...pirates. A Trojan horse is...umm...a big horse. A firewall is a big fiery wall (ugh!!!), and a virus is a sick looking electronic bacteria (fuck me!). Add to that a whole bunch of nauseating pop songs, modern trendy teen lingo, various brands and voilà! \n\nThe sidekick characters bland and unfunny (hi-five and a princess), again totally predictable. Alex decides to completely wipe his phone when a few apps play up, why not just uninstall them? When the phone is almost wiped Alex stops because of an unusual emoji?? (Gene pulling a stupid face). This emoji is then sent to the girl he has a crush on and she instantly likes him because of that?? Most of the emoji's in Textopolis are erased during this process, but they all come back perfectly OK when the phone is rebooted? No side affects from that?\n\nOverall the movie certainly isn't as bad as I thought it was gonna be (but its still quite bad). There are some kernels of a good idea hidden away within, the odd sparse highlight. But again overall its still very very basic, bland, uninspiring, unfunny, and it doesn't even look that great really. This was always gonna be an uphill battle simply because what the hell can you do with emoji's?? I stand by my kudos to all involved for actually managing to produce something that isn't a complete train wreck, but at the end of the day I think we can all agree with was a complete waste of time and money. Heck the aim seems to be to push young kids towards their phones more than ever. As if youngsters need that kind of encouragement these days.","displayName":"Phil H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":true,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-19T11:59:10.000Z","updateDate":"2017-10-19T11:59:19.000Z","user":{"userId":"789814099","realm":"RT","displayName":"Phil H","accountLink":"/user/id/789814099"},"score":1.5,"timeFromCreation":"Oct 19, 2017"},{"rating":"STAR_1","review":"This movie was an overall flop, with 0 lure and no climax. This shows the ignorance that can be found in Hollywood movies today. This is a great example of a movie with so much potential and creativity but turned to ash one it was revealed. Why would Alec Baldwin waste his time and effort  for this trash. Hollywood step up your game.","displayName":"Dylan W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-18T12:10:16.000Z","updateDate":"2017-10-18T12:20:18.000Z","user":{"userId":"976741832","realm":"RT","displayName":"Dylan W","accountLink":"/user/id/976741832"},"score":1,"timeFromCreation":"Oct 18, 2017"},{"rating":"STAR_5","review":"I like it!! I don't know why others don't !!!!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1843421832637404/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-18T06:47:55.000Z","updateDate":"2017-10-18T06:48:45.000Z","user":{"userId":"976771030","realm":"RT","displayName":null,"accountLink":"/user/id/976771030"},"score":5,"timeFromCreation":"Oct 18, 2017"},{"rating":"STAR_5","review":"this movie was the worst because it had none of the good emojis like shrek or cory in the house, this movie ended with a cliffhanger leaving my mind spinning like a fidget spinner, it was so good it should be so badrijndcpejue I cant read","displayName":"Shrek%20 A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-17T19:35:27.000Z","updateDate":"2017-10-17T19:37:20.000Z","user":{"userId":"976770389","realm":"RT","displayName":"Shrek%20 A","accountLink":"/user/id/976770389"},"score":5,"timeFromCreation":"Oct 17, 2017"},{"rating":"STAR_0_5","review":"weak plot, predictable characters....this movie is fine for kids, but other than that, don't expect much out of it.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10206491616107052/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-17T19:13:32.000Z","updateDate":"2017-10-17T19:14:24.000Z","user":{"userId":"976770355","realm":"RT","displayName":null,"accountLink":"/user/id/976770355"},"score":0.5,"timeFromCreation":"Oct 17, 2017"},{"rating":"STAR_5","review":"10/10 movie has great visuals a 11/10 plot line and all the jokes always crack me up and doesn't make me want to kill myself 50000000/10 would watch again FUCK","displayName":"Bradley N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-17T18:20:53.000Z","updateDate":"2017-10-17T18:23:19.000Z","user":{"userId":"976770273","realm":"RT","displayName":"Bradley N","accountLink":"/user/id/976770273"},"score":5,"timeFromCreation":"Oct 17, 2017"},{"rating":"STAR_0_5","review":"I just wanna say to the people calling this film is \"A sign of the end times!\". Guys, there have be products based off of The Gummi Bears, The Rubix Cube, fast food, a lot of things. Every generation has something like this and that's fine because sometimes it turns out good, most of the time it doesn't, and this movie is one of the worst examples. But my point is, if you didn't think this was gonna happen in a world were you can go into any given store & buy a poop emoji pillow... Really?","displayName":"Lachlan B","displayImageUrl":"https://graph.facebook.com/v3.3/1117950975/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-16T17:45:36.000Z","updateDate":"2017-10-16T18:08:29.000Z","user":{"userId":"877694661","realm":"RT","displayName":"Lachlan B","accountLink":"/user/id/877694661"},"score":0.5,"timeFromCreation":"Oct 16, 2017"}]}