{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY1NzEzOTMiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMjZUMDE6NDU6MjIifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NTU3MTgyMzAiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMjZUMTk6NDM6NDQifQ=="},"reviews":[{"rating":"STAR_1","review":"Soooo MEH! They should've titled this waste of time same as the leading character, then I wouldn't have bothered.","displayName":"T24K R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-26T19:43:44.000Z","updateDate":"2017-08-15T17:53:56.000Z","user":{"userId":"955718230","realm":"RT","displayName":"T24K R","accountLink":"/user/id/955718230"},"score":1,"timeFromCreation":"Jul 26, 2017"},{"rating":"STAR_0_5","review":"WORST MOVIE OF THE YEAR !","displayName":"Jose O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-26T18:54:34.000Z","updateDate":"2017-07-27T15:52:23.000Z","user":{"userId":"968709812","realm":"RT","displayName":"Jose O","accountLink":"/user/id/968709812"},"score":0.5,"timeFromCreation":"Jul 26, 2017"},{"rating":"STAR_0_5","review":"they cancelled the popeye movie for this","displayName":"avery w","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-26T16:46:22.000Z","updateDate":"2017-07-28T05:21:25.000Z","user":{"userId":"976462576","realm":"RT","displayName":"avery w","accountLink":"/user/id/976462576"},"score":0.5,"timeFromCreation":"Jul 26, 2017"},{"rating":"STAR_5","review":"best movie ever. me me big boy","displayName":"Lily F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-26T15:11:11.000Z","updateDate":"2017-07-28T16:52:38.000Z","user":{"userId":"976572608","realm":"RT","displayName":"Lily F","accountLink":"/user/id/976572608"},"score":5,"timeFromCreation":"Jul 26, 2017"},{"rating":"STAR_4","review":"This movie is definitely not as bad as the snobbish critics make it out to be.  The target audience is kids, not adults!  It was entertaining and I would give it a 7.5 out of 10.  It is good for the kids  and had a decent storyline.","displayName":"K S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-26T14:16:08.000Z","updateDate":"2017-08-01T14:31:05.000Z","user":{"userId":"975606118","realm":"RT","displayName":"K S","accountLink":"/user/id/975606118"},"score":4,"timeFromCreation":"Jul 26, 2017"},{"rating":"STAR_5","review":"cinematic masterpiece","displayName":"mike c","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-26T13:12:44.000Z","updateDate":"2017-07-26T13:13:18.000Z","user":{"userId":"976572373","realm":"RT","displayName":"mike c","accountLink":"/user/id/976572373"},"score":5,"timeFromCreation":"Jul 26, 2017"},{"rating":"STAR_5","review":"Best film ever! 9/11 stars!","displayName":"Luke B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-26T12:45:40.000Z","updateDate":"2017-09-04T08:41:47.000Z","user":{"userId":"976535975","realm":"RT","displayName":"Luke B","accountLink":"/user/id/976535975"},"score":5,"timeFromCreation":"Jul 26, 2017"},{"rating":"STAR_4","review":"The story is good it's nothing new but it's told pretty good the human character doesn't get any development the character just gets one thing to do which is cool to.\n\nThe cast does a good job the characters are interesting Patrick Stewart is pretty good as poop.\n\nThe animation is really good with both the world and the characters the facial expressions are well done.","displayName":"Ronnie  N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-26T11:24:23.000Z","updateDate":"2018-02-20T23:42:38.000Z","user":{"userId":"975985648","realm":"RT","displayName":"Ronnie  N","accountLink":"/user/id/975985648"},"score":4,"timeFromCreation":"Jul 26, 2017"},{"rating":"STAR_5","review":"When, in the course of human events, it becomes necessary for one people to dissolve the political bonds which have connected them with another, and to assume among the powers of the earth, the separate and equal station to which the laws of nature and of nature's God entitle them, a decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation.\n\nWe hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable rights, that among these are life, liberty and the pursuit of happiness. That to secure these rights, governments are instituted among men, deriving their just powers from the consent of the governed. That whenever any form of government becomes destructive to these ends, it is the right of the people to alter or to abolish it, and to institute new government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their safety and happiness. Prudence, indeed, will dictate that governments long established should not be changed for light and transient causes; and accordingly all experience hath shown that mankind are more disposed to suffer, while evils are sufferable, than to right themselves by abolishing the forms to which they are accustomed. But when a long train of abuses and usurpations, pursuing invariably the same object evinces a design to reduce them under absolute despotism, it is their right, it is their duty, to throw off such government, and to provide new guards for their future security. --\n\nSuch has been the patient sufferance of these colonies; and such is now the necessity which constrains them to alter their former systems of government. The history of the present King of Great Britain is a history of repeated injuries and usurpations, all having in direct object the establishment of an absolute tyranny over these states. To prove this, let facts be submitted to a candid world.\n\nHe has refused his assent to laws, the most wholesome and necessary for the public good.\n\nHe has forbidden his governors to pass laws of immediate and pressing importance, unless suspended in their operation till his assent should be obtained; and when so suspended, he has utterly neglected to attend to them.\n\nHe has refused to pass other laws for the accommodation of large districts of people, unless those people would relinquish the right of representation in the legislature, a right inestimable to them and formidable to tyrants only.\n\nHe has called together legislative bodies at places unusual, uncomfortable, and distant from the depository of their public records, for the sole purpose of fatiguing them into compliance with his measures.\n\nHe has dissolved representative houses repeatedly, for opposing with manly firmness his invasions on the rights of the people.\n\nHe has refused for a long time, after such dissolutions, to cause others to be elected; whereby the legislative powers, incapable of annihilation, have returned to the people at large for their exercise; the state remaining in the meantime exposed to all the dangers of invasion from without, and convulsions within.\n\nHe has endeavored to prevent the population of these states; for that purpose obstructing the laws for naturalization of foreigners; refusing to pass others to encourage their migration hither, and raising the conditions of new appropriations of lands.\n\nHe has obstructed the administration of justice, by refusing his assent to laws for establishing judiciary powers.\n\nHe has made judges dependent on his will alone, for the tenure of their offices, and the amount and payment of their salaries.\n\nHe has erected a multitude of new offices, and sent hither swarms of officers to harass our people, and eat out their substance.\n\nHe has kept among us, in times of peace, standing armies without the consent of our legislature.\n\nHe has affected to render the military independent of and superior to civil power.\n\nHe has combined with others to subject us to a jurisdiction foreign to our constitution, and unacknowledged by our laws; giving his assent to their acts of pretended legislation:\n\nFor quartering large bodies of armed troops among us:\nFor protecting them, by mock trial, from punishment for any murders which they should commit on the inhabitants of these states:\nFor cutting off our trade with all parts of the world:\nFor imposing taxes on us without our consent:\nFor depriving us in many cases, of the benefits of trial by jury:\nFor transporting us beyond seas to be tried for pretended offenses:\nFor abolishing the free system of English laws in a neighboring province, establishing therein an arbitrary government, and enlarging its boundaries so as to render it at once an example and fit instrument for introducing the same absolute rule in these colonies:\nFor taking away our charters, abolishing our most valuable laws, and altering fundamentally the forms of our governments:\nFor suspending our own legislatures, and declaring themselves invested with power to legislate for us in all cases whatsoever.\nHe has abdicated government here, by declaring us out of his protection and waging war against us.\n\nHe has plundered our seas, ravaged our coasts, burned our towns, and destroyed the lives of our people.\n\nHe is at this time transporting large armies of foreign mercenaries to complete the works of death, desolation and tyranny, already begun with circumstances of cruelty and perfidy scarcely paralleled in the most barbarous ages, and totally unworthy the head of a civilized nation.\n\nHe has constrained our fellow citizens taken captive on the high seas to bear arms against their country, to become the executioners of their friends and brethren, or to fall themselves by their hands.\n\nHe has excited domestic insurrections amongst us, and has endeavored to bring on the inhabitants of our frontiers, the merciless Indian savages, whose known rule of warfare, is undistinguished destruction of all ages, sexes and conditions. \nIn Jefferson's draft there is a part on slavery here\n\nIn every stage of these oppressions we have petitioned for redress in the most humble terms: our repeated petitions have been answered only by repeated injury. A prince, whose character is thus marked by every act which may define a tyrant, is unfit to be the ruler of a free people.\n\nNor have we been wanting in attention to our British brethren. We have warned them from time to time of attempts by their legislature to extend an unwarrantable jurisdiction over us. We have reminded them of the circumstances of our emigration and settlement here. We have appealed to their native justice and magnanimity, and we have conjured them by the ties of our common kindred to disavow these usurpations, which, would inevitably interrupt our connections and correspondence. We must, therefore, acquiesce in the necessity, which denounces our separation, and hold them, as we hold the rest of mankind, enemies in war, in peace friends.\n\nWe, therefore, the representatives of the United States of America, in General Congress, assembled, appealing to the Supreme Judge of the world for the rectitude of our intentions, do, in the name, and by the authority of the good people of these colonies, solemnly publish and declare, that these united colonies are, and of right ought to be free and independent states; that they are absolved from all allegiance to the British Crown, and that all political connection between them and the state of Great Britain, is and ought to be totally dissolved; and that as free and independent states, they have full power to levy war, conclude peace, contract alliances, establish commerce, and to do all other acts and things which independent states may of right do. And for the support of this declaration, with a firm reliance on the protection of Divine Providence, we mutually pledge to each other our lives, our fortunes and our sacred honor.\n\nJOHN HANCOCK, President\n\nAttested, CHARLES THOMSON, Secretary\n\nNew Hampshire\nJOSIAH BARTLETT \nWILLIAM WHIPPLE \nMATTHEW THORNTON\nMassachusetts-Bay\nSAMUEL ADAMS \nJOHN ADAMS \nROBERT TREAT PAINE \nELBRIDGE GERRY\nRhode Island\nSTEPHEN HOPKINS \nWILLIAM ELLERY\nConnecticut\nROGER SHERMAN \nSAMUEL HUNTINGTON \nWILLIAM WILLIAMS \nOLIVER WOLCOTT\nGeorgia\nBUTTON GWINNETT \nLYMAN HALL \nGEO. WALTON\nMaryland\nSAMUEL CHASE \nWILLIAM PACA \nTHOMAS STONE \nCHARLES CARROLL OF CARROLLTON\nVirginia\nGEORGE WYTHE \nRICHARD HENRY LEE \nTHOMAS JEFFERSON \nBENJAMIN HARRISON \nTHOMAS NELSON, JR. \nFRANCIS LIGHTFOOT LEE \nCARTER BRAXTON.\nNew York\nWILLIAM FLOYD \nPHILIP LIVINGSTON \nFRANCIS LEWIS \nLEWIS MORRIS\nPennsylvania\nROBERT MORRIS \nBENJAMIN RUSH \nBENJAMIN FRANKLIN \nJOHN MORTON \nGEORGE CLYMER \nJAMES SMITH \nGEORGE TAYLOR \nJAMES WILSON \nGEORGE ROSS\nDelaware\nCAESAR RODNEY \nGEORGE READ \nTHOMAS M'KEAN\nNorth Carolina\nWILLIAM HOOPER \nJOSEPH HEWES \nJOHN PENN\nSouth Carolina\nEDWARD RUTLEDGE \nTHOMAS HEYWARD, JR. \nTHOMAS LYNCH, JR. \nARTHUR MIDDLETON\nNew Jersey\nRICHARD STOCKTON \nJOHN WITHERSPOON \nFRANCIS HOPKINS \nJOHN HART \nABRAHAM CLARK","displayName":"Mike%20 H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-26T11:23:38.000Z","updateDate":"2017-07-26T11:25:11.000Z","user":{"userId":"976572151","realm":"RT","displayName":"Mike%20 H","accountLink":"/user/id/976572151"},"score":5,"timeFromCreation":"Jul 26, 2017"},{"rating":"STAR_0_5","review":"I want to puke all over this movie.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/232282136969845/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-26T01:45:22.000Z","updateDate":"2017-07-26T01:45:42.000Z","user":{"userId":"976571393","realm":"RT","displayName":null,"accountLink":"/user/id/976571393"},"score":0.5,"timeFromCreation":"Jul 26, 2017"}]}