{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY3NTM5OTAiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMTAtMTBUMjM6Mzg6MjcifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzA2MTAzNDQiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMTAtMTNUMDg6MTU6MTAifQ=="},"reviews":[{"rating":"STAR_0_5","review":"There's no kind of analytical, in-depth review you could write on The Emoji Movie that a string of expletives couldn't say just as well. This 'film' is a perfect example of mainstream Hollywood at its most cynical, shameless and pandering, trying to ring every single dollar it can out of 'Hey, I recognise that!' To watch it is to be actively depressed, to have your faith in humanity crushed beneath the wheels of corporate marketing and drained of every last drop by the vacuum of lazy pop culture. Not a single thing about it contains a vestige of effort, wit, warmth or sincerity. In that way it's basically the anti-Lego Movie, another animation people assumed was going to be a product-placement driven waste of time and effort, but had characters you could empathise with and jokes you couldn't stop laughing at. Watching The Emoji Movie, I was desperately waiting for the laughs to start, but the most it could get out of me was the occasional smirk. It's painfully unfunny, dominated by dreadful puns, references masquerading as gags and haphazard, contrived, nonsensical plotting. Nothing in it works, and it all feels so forced because clearly no passion went into it. It's aimed squarely at the most braindead, impressionable fanbase, those who, ironically, if they were to attend a screening of the film, would likely be too engrossed in their smartphones to even watch it. With the rapid advancements being made in technology today this is quickly going to become the most dated movie in history, a relic of a bygone era, and when children of the future turn round and ask, 'What were Emojis?', we can turn to them with a grim, knowing look and answer 'Something that can never hurt us ever again'. Contemptible in every way, The Emoji Movie is a film so lacking in anything even resembling human emotion that it could, and probably was, made by actual smartphones.","displayName":"Wayne K","displayImageUrl":"https://graph.facebook.com/v3.3/10205949674155460/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-13T08:15:10.000Z","updateDate":"2017-10-13T08:15:39.000Z","user":{"userId":"970610344","realm":"RT","displayName":"Wayne K","accountLink":"/user/id/970610344"},"score":0.5,"timeFromCreation":"Oct 13, 2017"},{"rating":"STAR_5","review":"This movie was one of the best movies of all time","displayName":"Aaron M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-13T05:34:08.000Z","updateDate":"2017-10-13T05:35:14.000Z","user":{"userId":"976758051","realm":"RT","displayName":"Aaron M","accountLink":"/user/id/976758051"},"score":5,"timeFromCreation":"Oct 13, 2017"},{"rating":"STAR_4_5","review":"Had a lot of meaning","displayName":"Bailey R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-13T03:29:09.000Z","updateDate":"2017-10-13T03:29:09.000Z","user":{"userId":"976523969","realm":"RT","displayName":"Bailey R","accountLink":"/user/id/976523969"},"score":4.5,"timeFromCreation":"Oct 13, 2017"},{"rating":"STAR_5","review":"I didn't know if they'd pull it off but they did. They turned simple emojis into a living world and relatable story, great lessons for both kids and adults. Love the real world applications, the characterizations, lots of funny moments, and very touching.","displayName":"Rebecca T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-12T13:49:31.000Z","updateDate":"2017-10-12T13:53:09.000Z","user":{"userId":"976755926","realm":"RT","displayName":"Rebecca T","accountLink":"/user/id/976755926"},"score":5,"timeFromCreation":"Oct 12, 2017"},{"rating":"STAR_5","review":"It is an amazing movie you critics are liars","displayName":"Adrian A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-12T07:49:45.000Z","updateDate":"2017-10-12T07:50:15.000Z","user":{"userId":"976756240","realm":"RT","displayName":"Adrian A","accountLink":"/user/id/976756240"},"score":5,"timeFromCreation":"Oct 12, 2017"},{"rating":"STAR_4_5","review":"Very good movie!!! I will look at emojis differently now!!! Really cute story!!! I like how the world was based in its own world!!!","displayName":"Kandis A","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-12T03:38:17.000Z","updateDate":"2017-10-12T03:38:17.000Z","user":{"userId":"771264196","realm":"RT","displayName":"Kandis A","accountLink":"/user/id/771264196"},"score":4.5,"timeFromCreation":"Oct 12, 2017"},{"rating":"STAR_5","review":"Loved it! Hilarious. Great 80's jokes for adults. Brilliant!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1697452630287441/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-12T00:42:19.000Z","updateDate":"2017-10-12T00:43:24.000Z","user":{"userId":"976755881","realm":"RT","displayName":null,"accountLink":"/user/id/976755881"},"score":5,"timeFromCreation":"Oct 12, 2017"},{"rating":"STAR_0_5","review":"Cringiest movie ever, the emoji dance made me want to kill myself. The only exciting part was me thinking ab how the eggplant emoji is going to go from losers lounge to VIP after that dance if you know what I mean (insert wink emoji).","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1925954600986443/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-12T00:23:29.000Z","updateDate":"2017-10-12T00:26:36.000Z","user":{"userId":"976755865","realm":"RT","displayName":null,"accountLink":"/user/id/976755865"},"score":0.5,"timeFromCreation":"Oct 12, 2017"},{"rating":"STAR_1","review":"What an absolute fucking shitbox...... The Emoji Movie takes a premise that honestly isn't that bad of an idea, having the story take place within a smartphone allows for a variety of unique plot and comedic opportunities that the screenwriters try to make the most of. But where these unique comedic moments provide a few light chuckles this novelty wears off really fucking quickly, like, within the first 5-10 minutes, where beyond that point the humour is as predictable as ever. The film is directed by Tony Leondis and written by Leondis, Eric Siegel, and Mike White with John Hoffman providing additional screenplay material....... talk about too many cooks in the kitchen. This Sony Pictures Animation follows a meh emoji named Gene (T.J. Miller) who after finding out he can make multiple emoji faces goes on a quest to become a simple one-face emoji. With that synopsis you can tell EXACTLY where this movie is going to go and the messages it's going to try and implement and it does exactly that. It's a cut and paste generic story that hits all the beats you expect a film aimed solely at young kids to do and it's just lazy. The direction they took for humour is all over the place and the biggest misstep they make here. \n\nSo in terms of the humour the first 5 minutes or so where it is simply introducing you to this world is fine, there are some brief moments that may make you chuckle and it has to do with the clever way they introduce some emojis. But then as soon as it hits that 10 minute mark and the main plot is in full swing it loses its charm and brings in as many pop culture references to make the most obvious joke regarding each property. The most I am able to get from these moments is being able to have 150 Captain America reactions [insert \"I understood that reference\" meme], but the issue is it just isn't funny. Which brings me to wonder who their target audience is in terms of the jokes. Of course there's some stupidly silly humour for the kids but that only makes up a small portion of the attempted comedic moments. Adults who aren't tech-savvy aren't going to have any idea what's going on, those who are tech-savvy will simply understand the references, and kids won't understand half of the jokes the writers are making about internet culture. It's a weird approach that I think fails regardless of what age group decides to check out this movie. \n\nNow if you were to look at the voice cast you would think you're about to watch one of the greatest ensemble films in history as there are a tonne of big name actors, some even portraying incredibly minor one or two scene roles. So I can't really say anything bad about the voice performances, I think everyone delivers their lines the best that they can it's just the writing that kills any chance of humour. Much of the humour is banking on T.J Miller's meh emoji being effectively funny, now where I think T.J is the perfect role for the meh emoji I don't think this protagonist was the right choice. Much like everything else his character gets very old very quickly to the point where you yourself will turn into a meh.... James Corden plays the Hi-5 emoji and although he isn't funny he brings a lot of personality through his very loud and fast talking character which contrasts meh's presence. For the kids I feel like this is the character they will get the most laughs out of, if any, due to his very silly persona. The flurry of other voice performances as I mentioned are just fine.... they showed up, read their lines, promoted the release for a few weeks, cashed their paycheque and moved on. \n\nSo as i've just covered, The Emoji Movie doesn't have anything to offer in terms of enjoyment in general. The plot hits all the tired beats these kids movies choose to hit over and over again, so that will no doubt put you to sleep, and the comedic moments almost all fall flat regardless of the audience they are targeting. So as I mentioned right at the beginning...... this is a steaming pile of shit that will bore you and it manages to make an hour and 20 minutes feel like an agonising 2 hours. Do yourself a favour and stay far, far away from this movie and if you see a kid wanting to see this movie keep it far away from them too. \n\n1.5/10","displayName":"Stephen P","displayImageUrl":"https://graph.facebook.com/v3.3/100000134211968/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-11T23:53:08.000Z","updateDate":"2017-10-11T23:53:10.000Z","user":{"userId":"881713764","realm":"RT","displayName":"Stephen P","accountLink":"/user/id/881713764"},"score":1,"timeFromCreation":"Oct 11, 2017"},{"rating":"STAR_3","review":"It was a funny, emotional, sweet kid friendly movie for all ages. There were good jokes in the film and the animation was also nice. T.J. Miller was amazing, making the character more lovable than what he already was.","displayName":"Symone M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-10-10T23:38:27.000Z","updateDate":"2017-10-10T23:47:49.000Z","user":{"userId":"976753990","realm":"RT","displayName":"Symone M","accountLink":"/user/id/976753990"},"score":3,"timeFromCreation":"Oct 10, 2017"}]}