{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY1NzkwODUiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMjhUMTU6MDA6MTYifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY1NzkxNDYiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMjhUMTU6MTA6MjMifQ=="},"reviews":[{"rating":"STAR_5","review":"Single handedly the greatest film of all time. Go see it right now.","displayName":"Guy F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T15:10:23.000Z","updateDate":"2017-07-28T15:11:28.000Z","user":{"userId":"976579146","realm":"RT","displayName":"Guy F","accountLink":"/user/id/976579146"},"score":5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_0_5","review":"its the emoji movie, what did you expect?","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1984593365107540/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T15:09:19.000Z","updateDate":"2017-07-28T15:10:29.000Z","user":{"userId":"976579137","realm":"RT","displayName":null,"accountLink":"/user/id/976579137"},"score":0.5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"Make sure to check out the Just Dance app, free on iOS and Android.","displayName":"Jake W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T15:06:28.000Z","updateDate":"2017-07-28T15:06:49.000Z","user":{"userId":"973113492","realm":"RT","displayName":"Jake W","accountLink":"/user/id/973113492"},"score":5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"THIS MOVIE IS AMAZING DAB ON THEM HATERS ?????????????????????????????????????????????????????????????????????????????????????????????????????????????? SMASH DAT MF LIKE BUTTON CAUSE ITS REAL NIGGA HOURS????????????????????????","displayName":"meme b","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T15:06:17.000Z","updateDate":"2017-07-28T15:08:30.000Z","user":{"userId":"976579119","realm":"RT","displayName":"meme b","accountLink":"/user/id/976579119"},"score":5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_0_5","review":"Gut-churning pile of manure.\nCringe worthy \nI feel bad for the animators,directors and actors","displayName":"Northern%20 S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T15:06:05.000Z","updateDate":"2017-07-28T15:09:02.000Z","user":{"userId":"976579123","realm":"RT","displayName":"Northern%20 S","accountLink":"/user/id/976579123"},"score":0.5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_4","review":"not an Oscar contender but fun!!\n\ngo into this knowing expecting little and be impressed!!\n\nSuper cute","displayName":"Lupe R","displayImageUrl":"https://graph.facebook.com/v3.3/1533612052/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T15:04:12.000Z","updateDate":"2017-07-28T15:04:12.000Z","user":{"userId":"919068428","realm":"RT","displayName":"Lupe R","accountLink":"/user/id/919068428"},"score":4,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_0_5","review":"A boring waste of time.","displayName":"philmp6 .","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T15:02:44.000Z","updateDate":"2017-08-27T11:47:56.000Z","user":{"userId":"976579105","realm":"RT","displayName":"philmp6 .","accountLink":"/user/id/976579105"},"score":0.5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"Citizen Kane is a great motion picture. Great in that it was produced by a man who had never had any motion picture experience; great because he cast it with people who had never faced a camera in a motion picture production before; great in the manner of its story-telling, in both the writing of that story and its unfolding before a camera; great in that its photographic accomplishments are the highlights of motion picture photography to date, and finally great, because technically, it is a few steps ahead of anything that has been made in pictures before. \n\nFrom the point of entertainment, this reviewer chooses again to qualify it as great. An audience might not think so because they might not understand its technical perfections, or will be astonished, as we were, at the acting of a cast that had never been in a studio before. Nor will they credit the fact that this entertainment was really brought to the screen on a low budget - under $800,000 - and, in order to accomplish that, things had to be done that no brain or set of brains had ever before accomplished.\n\nThese items interested us, made the entertainment much greater, and how much an audience's ignorance of these facts will discount the actual entertainment, we can't tell. But we'll venture the opinion that no ticket buyer, if he ever has the opportunity of buying a ticket to see Citizen Kane, will leave the theatre mad at his buy, because he will be entertained, although probably not as much as those knowing the inside of this whole production. \n\nWhether the story was inspired by the life of William Randolph Hearst is of little interest to this reviewer; that's for others to determine and act as they see fit. However, we might express our opinion that we will be surprised if the picture ever hits a theatre where admission is charged, and if that is finally the case, audiences will lose the opportunity of seeing a fine motion picture produced in a most adult fashion and one that should lift Orson Welles right up to the top of producers and actors. \n\nViolates Tradition\n\nWelles has made his Hollywood debut in such an astonishingly unconventional production that it is difficult to criticize Citizen Kane along the customary lines. Time after time, as the life of Charles Foster Kane is unfolded, Welles violates cinema tradition in acting, writing and photography, and gets away with it all magnificently. \n\nHe wastes no time in introducing his different technique. The film begins with a mythical two-reel \"News on the March,\" obviously based on the March of Time, since the commentator's phraseology is unmistakable \"Time\" talk. It is a short on the life of the great publisher, Charles Foster Kane, who has just died, and it touches on the highlights of his career from the day he acquires The New York Inquirer until his death. \n\nAs Kane succumbs, he is heard to utter one word, \"Rosebud,\" and it is this one word which holds together the succeeding episodes of the film. As the short ends, it becomes apparent that this was a screening of the subject for its producers. They are dissatisfied with it, because the short has not brought out the hidden motivations which make Kane such a fabulous character, nor has it explained the meaning of the cryptic reference to \"Rosebud.\" \n\nHearst Mentioned Once\n\nIt is in this scene at the end of the \"News on the March\" sequence that the name of Hearst is mentioned the only time in Citizen Kane. One of the actors is overheard saying \"It could have been any publisher, could have been Pulitzer, could have been Hearst.\" Another responds: \"Yes, and it could have been John Doe.\" \n\nA reporter from \"News on the March\" then begins the monumental task of checking Kane's life, beginning with his infancy in the West when he inherits a fortune, the arrival of the estate's lawyers to take young Kane to school finds him sledding in the snow and fighting against leaving this pastime to accompany the attorneys. To obtain his information, the reporter interviews the five persons who knew Kane best: his lawyer, his right hand man in the Kane publications, his former dramatic critic, and his second wife, whom he meets as a penniless flighty girl and attempts to make the public accept as a great singer, and the butler who manages his far-flung estate on the Gulf of Mexico. \n\nWife Supplies Drama\n\nThe drama critic, the lawyer, the butler and his publishing aide all contribute their bits to the Kane saga, but the dramatic high spots come mostly from the memory of the press tycoon's second wife, by this time a drunken derelict, still trying to be a singer in an Atlantic City dive. When she meets Kane, he is already married to the niece of a mythical U.S. president, and so bored that he rarely comes home. Their meeting is just a \"pick-up\" on a rainy street, but it progresses so fast that, in no time, the illicit amour becomes public knowledge through exposure by a politician he is fighting, and Kane loses a sure election as governor of New York. \n\nHis first wife divorces him, he marries the singer, and then inaugurates a campaign in all his papers to establish her as a star. She is a desperately incompetent performer, and his efforts to put her over make him a laughing stock and cost him his best friend, the dramatic critic. \n\nFinally, shorn of most of his journalistic power by the 1929 crash, an embittered old man, he retires to his incredible Gulf Coast place. There the second wife does jigsaw puzzles in the vast living room and grows to hate him. She leaves him, and Kane's death follows very soon afterwards. He is broken, friendless and all he has left behind him are the palace and its grounds - which include a private zoo - his untold art treasures, and a string of papers actually controlled by banks. Not until the final scene is the mystery of \"Rosebud\" explained, and, though it is done with utter simplicity, it provides a chill and lump in anyone's throat. \n\n\"Rosebud\" Explained\n\nThe camera pans over the limitless expanse of paintings, sculpture, and all his other useless possessions. Appraisers are sorting it out, and the worthless items are burned. Into the flames go all manner of knickknacks, and at last the wreckers begin burning odds and ends from his mother's home out west, which Kane had collected after she died. Suddenly the flames are seen licking over a little boy's sled. The camera picks it out from the rest of the fire, and on it is written the one word \"Rosebud.\" \n\nWelles' performance is nothing less than astonishing. He begins as a youth of 21, goes through middle age to his death, and makes every moment believable in voice, walk and gesture. Even in his love scenes is Welles effective. \n\nThe support he gets from the cast, every one of whom is a completely new face to picture audiences, is downright amazing. There isn't a weak member of the troupe, and though space doesn't permit praise for all of them, a few must be selected for special mention. Dorothy Comingore, as the singer, is put through a range of emotions that would try any actress one could name, but she delivers without a second's let-down. Citizen Kane should make this girl a star. Joseph Cotten, who played in Philadelphia Story, is splendid as the drama critic, as are Everett Sloane in the role of Bernstein, Kane's faithful aide, and Ruth Warrick, as his first wife. \n\nGregg Toland's camera has never performed such miracles. He has caught the players from daringly unusual angles. He produced effects so novel in some scenes that they cannot be described here. The musical score by Bernard Herrmann is also worthy of commendation","displayName":"Max P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T15:01:41.000Z","updateDate":"2017-07-28T15:02:44.000Z","user":{"userId":"976579095","realm":"RT","displayName":"Max P","accountLink":"/user/id/976579095"},"score":5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"The best movie in history.","displayName":"Jack D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T15:01:18.000Z","updateDate":"2017-07-28T15:02:21.000Z","user":{"userId":"976579079","realm":"RT","displayName":"Jack D","accountLink":"/user/id/976579079"},"score":5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"This movie makes me wanna nut. Every character I see is another stroke i do on my p3nis. Every character's voice makes me feel all tingly, and It was such a pleasure. The designs are really hot aswell, especially the Poop emoji. This is the new generation for animation, and It's looking magnificent so far.","displayName":"Ashley N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T15:00:16.000Z","updateDate":"2017-07-28T15:05:04.000Z","user":{"userId":"976579085","realm":"RT","displayName":"Ashley N","accountLink":"/user/id/976579085"},"score":5,"timeFromCreation":"Jul 28, 2017"}]}