{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY2MTQ5NTkiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDgtMTBUMTk6MTE6MTcifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzAzMDA0ODEiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDgtMTFUMDM6MjE6NTQifQ=="},"reviews":[{"rating":"STAR_1","review":"0/5 \"don't even waste your money with this shit\"","displayName":"Lachlan C","displayImageUrl":"https://graph.facebook.com/v3.3/1453867348259977/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-11T03:21:54.000Z","updateDate":"2017-10-11T02:30:43.000Z","user":{"userId":"970300481","realm":"RT","displayName":"Lachlan C","accountLink":"/user/id/970300481"},"score":1,"timeFromCreation":"Aug 11, 2017"},{"rating":"STAR_5","review":"Saw a cinema it was awesome","displayName":"Theo B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-11T03:16:27.000Z","updateDate":"2017-08-11T03:17:01.000Z","user":{"userId":"976615615","realm":"RT","displayName":"Theo B","accountLink":"/user/id/976615615"},"score":5,"timeFromCreation":"Aug 11, 2017"},{"rating":"STAR_1","review":"One star, because my kids keep asking me if ð??© is on my phone.","displayName":"Kevin C","displayImageUrl":"https://graph.facebook.com/v3.3/100002106177410/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-11T01:50:06.000Z","updateDate":"2017-08-11T01:50:06.000Z","user":{"userId":"912294902","realm":"RT","displayName":"Kevin C","accountLink":"/user/id/912294902"},"score":1,"timeFromCreation":"Aug 11, 2017"},{"rating":"STAR_2","review":"It was pretty bad, but it wasn't terrible. It was a cute funny afternoon kind of watch. Nothing special, not worth the extreme hate, but nothing worth praising either.","displayName":"Melinda S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-11T00:54:01.000Z","updateDate":"2017-08-22T22:45:46.000Z","user":{"userId":"976615453","realm":"RT","displayName":"Melinda S","accountLink":"/user/id/976615453"},"score":2,"timeFromCreation":"Aug 11, 2017"},{"rating":"STAR_5","review":"Okay so there this little nigga named gene, he got some kind of mental disorder and is like transgender or some shit because he like identify as all the emoji's...and his parents like ain't accept him and shit because he about to work as emoji  and i really like the commentary because his parents are like trump bein all like you can't join because you are trans emoji or whatever because this whole movie is obviously about the political climate right now....anyways....so this nigga blue jeans or whatever joins the emojis and is all like fuck you guys and joins anyway but he immediately fucks everything up with his stupid ass disorder and everyone is like and this smiley bitch is like fuck  you and wants to kill his so she send these like robot niggas after him.... Now the kid who owns the phone is like oh shit my phone is like fucked and stuff better go to the store and delete EVERYTHING on my phone....now  while running away the emoji trans fuck runs into this stupid hand asshole dude, and genome he's all like you help me and the hand nigga is all like i don't know you at all but fuck it right...anyway they go fuck off and go out of the messenger app to find a hacker or some shit and then they start talking about porn....Now at this point genie parents are all like shit we should start accepting our son and shit and they go off to look for him....They eventually get to this like bar and find the hacker bitch who im just gonna call wild style, and hes like help me and she's like know and then she sees how fucked up he is and she's like whatever fuck it...and then these robots enter the bar and fuck everything up and they are like oh shit and suddenly get into candy crush.....and then wild style is all like yo like i hate men and shit and then just keeps walking and like hey let's go to the next ad for stupid apps....now jimminy crickets mom and dad are all like fuuuck we cant find him, we should get divorced and then back together again in like five minutes...now giggly joe and wild style and hand job are going to find this way to cure jewfros mental disorder and but before they have to go into just dance where wild style is all like you i'm a princess emoji but let's not mention that for like another half an hour and then jerry seinfeld and wildstyle get to the end and are about to get to the place where he could get cured but handie mandy is too busy dancing to notice that he is getting murdered, but it turns out he didn't get murdered he is just getting thrown in the trash and everyone in the audience cheers but gilligan's island does not agree and is like ,i could save my life right now but nah ima save this guy that i knew for five minutes, i need to save the guy i've known for like an hour...So now smiley bitch makes this giant robot that begins chasing them down right after they find out this the kid is going to fucking delete his phone and this super robot mothafucka goes to find german soldier...now that wild style and greg saved slappy boy, they go and retrace their steps but not before they get attacked by mega robot mothafucka but they survive...they quickly get away and end up at the cloud where gabe newll is like ehhhhh nevermind i dont wnat to be fixed and then he gets turned down by wildstyle because he likes her i guess, but he quickly gets raped by the mega robot dude and he is thrown back in the like emoji offices or whatever but wild style uses her special princess magic to fly her and hand stand to save goober...but the kid liek begins to delete his whole phone....but grape pudding quickly saves the day and even tho the all the other emojis got deleted, the kid unplugs his phone at 99% deletion all the emojis are restored for some reason...and the day is saved or some shit idk this movie sucked","displayName":"Emoji B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-10T23:50:03.000Z","updateDate":"2017-08-10T23:50:15.000Z","user":{"userId":"976615398","realm":"RT","displayName":"Emoji B","accountLink":"/user/id/976615398"},"score":5,"timeFromCreation":"Aug 10, 2017"},{"rating":"STAR_5","review":"IT CHANGED MY LIFE BEST MOVIE EVER 12/10","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/1073764616059540/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-10T22:54:33.000Z","updateDate":"2017-08-10T22:55:17.000Z","user":{"userId":"976615338","realm":"RT","displayName":null,"accountLink":"/user/id/976615338"},"score":5,"timeFromCreation":"Aug 10, 2017"},{"rating":"STAR_0_5","review":"One of the worst movies I have ever seen. The plot was fast-moving, but felt rushed rather than engaging. They included a lot of unnecessary dialogue that was seemingly meant to be funny, but the only part of the entire film that was even remotely funny was how bad the entire movie was. Whenever the characters Jailbreak and Gene were together I could literally hear some members of the audience facepalming (myself included). The movie was horrible and the only reason I give it half a star was because it was entertaining in how bad it was. I do not recommend seeing it or you'll just find yourself walking out of the theater before the movie ends, as many did when I saw it.","displayName":"Catherine M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-10T21:35:31.000Z","updateDate":"2017-08-10T21:51:28.000Z","user":{"userId":"976615225","realm":"RT","displayName":"Catherine M","accountLink":"/user/id/976615225"},"score":0.5,"timeFromCreation":"Aug 10, 2017"},{"rating":"STAR_0_5","review":"Please don't watch this.","displayName":"Dennis S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-10T20:08:26.000Z","updateDate":"2017-08-10T20:13:47.000Z","user":{"userId":"941261886","realm":"RT","displayName":"Dennis S","accountLink":"/user/id/941261886"},"score":0.5,"timeFromCreation":"Aug 10, 2017"},{"rating":"STAR_0_5","review":"This could have been a good movie, but it was not. It had terrible writing and way to much ad placement. The only good part of this film was the animation.","displayName":"Winfred H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-10T19:48:42.000Z","updateDate":"2017-08-10T19:51:55.000Z","user":{"userId":"976615036","realm":"RT","displayName":"Winfred H","accountLink":"/user/id/976615036"},"score":0.5,"timeFromCreation":"Aug 10, 2017"},{"rating":"STAR_0_5","review":"I saw it, it was visually beautiful with fluid animation and semi okay character design. The story was predictably boring with subplots to pad out time and with shallow jokes. Some people might enjoy this, but I found myself snoring.","displayName":"egg y","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-10T19:11:17.000Z","updateDate":"2017-08-10T19:12:53.000Z","user":{"userId":"976614959","realm":"RT","displayName":"egg y","accountLink":"/user/id/976614959"},"score":0.5,"timeFromCreation":"Aug 10, 2017"}]}