{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY5MTA5NzMiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDMtMjZUMTM6MzA6MTYifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyMDAxMjIiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDQtMDJUMTE6MjI6MTIifQ=="},"reviews":[{"rating":"STAR_5","review":"I WANNA SEE IT ITS AMAZING IT SHOULD HAVE A 98289689819491618983461396481394698134691364983468139691.78213468217621876146139131% YOU GUYS HAVE NO TASTE WOOOOOOOOOW.","displayName":"Bobity b","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-02T11:22:12.000Z","updateDate":"2018-04-02T11:25:56.000Z","user":{"userId":"977200122","realm":"RT","displayName":"Bobity b","accountLink":"/user/id/977200122"},"score":5,"timeFromCreation":"Apr 02, 2018"},{"rating":"STAR_0_5","review":"Down to the movie itself it is a unoriginal movie that steals elements from other more sucsessful movies","displayName":"reviews k","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-01T21:02:53.000Z","updateDate":"2018-04-01T21:06:00.000Z","user":{"userId":"977198930","realm":"RT","displayName":"reviews k","accountLink":"/user/id/977198930"},"score":0.5,"timeFromCreation":"Apr 01, 2018"},{"rating":"STAR_1","review":"I'd give it a poop emoji out of ten.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/2058067514210638/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-04-01T19:54:17.000Z","updateDate":"2018-04-01T19:54:56.000Z","user":{"userId":"977173726","realm":"RT","displayName":null,"accountLink":"/user/id/977173726"},"score":1,"timeFromCreation":"Apr 01, 2018"},{"rating":"STAR_0_5","review":"This movie is shit. I have never seen a movie so horrible. This is what happens when you leave a bunch of \"edgy\" kids in a room. This is the outcome. Nobody should watch this movie. Ever.","displayName":"Dylan Y","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-31T20:46:56.000Z","updateDate":"2018-03-31T20:46:59.000Z","user":{"userId":"977196753","realm":"RT","displayName":"Dylan Y","accountLink":"/user/id/977196753"},"score":0.5,"timeFromCreation":"Mar 31, 2018"},{"rating":"STAR_0_5","review":"By far the worst movie to have ever existed! Thanks Sony for ripping off Wreck-It-Ralph!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10215299473990764/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-29T22:44:56.000Z","updateDate":"2018-03-29T22:45:40.000Z","user":{"userId":"977192698","realm":"RT","displayName":null,"accountLink":"/user/id/977192698"},"score":0.5,"timeFromCreation":"Mar 29, 2018"},{"rating":"STAR_5","review":"movie MAKES A WAVE OF EMOTIONS AND Tears. its very very good!","displayName":"Sofia S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-29T03:11:52.000Z","updateDate":"2018-03-29T03:11:52.000Z","user":{"userId":"977189681","realm":"RT","displayName":"Sofia S","accountLink":"/user/id/977189681"},"score":5,"timeFromCreation":"Mar 29, 2018"},{"rating":"STAR_3_5","review":"This movie is great. I've noticed the people who are commenting negative  old people  my opinion is that it is mainly for the younger audience. Sadly little kids can't rate it. It does give a bit of adult humor that is sometimes awkward. The movie spreads a good message saying to be yourself  even if the world doesn't seem to accept you.","displayName":"Samantha%20 C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-28T20:38:06.000Z","updateDate":"2018-03-28T20:47:01.000Z","user":{"userId":"977190723","realm":"RT","displayName":"Samantha%20 C","accountLink":"/user/id/977190723"},"score":3.5,"timeFromCreation":"Mar 28, 2018"},{"rating":"STAR_0_5","review":"sooooooooooooooo bad","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-27T23:30:20.722Z","updateDate":"2018-10-22T04:15:32.944Z","user":{"userId":"260076846","realm":"RT","displayName":null,"accountLink":"/user/id/260076846"},"score":0.5,"timeFromCreation":"Mar 27, 2018"},{"rating":"STAR_1","review":"Did you love Inside Out?  I know I did.  I never felt like it was Pixar's best movie (there was too much repetition with the other emotions causing havoc in their host's mind), but I loved that, you could say, that it was a movie that dealt with mental illnesses in a mature and intelligent way.  It also explored issues about how, in the long run, you cannot avoid being sad.  Sadness is an emotion that will never be able to be avoided for as long as you're alive, but the movie never shied away from the fact that, you know what, this is a part of life and if you wanna be sad for one reason or another, then it's OK.  I obviously simplified it down, but Inside Out explores these issues intelligently with heart, soul and humor.  You may be asking yourself why I've brought this up in reference to The Emoji Movie.  Well, unless you're living under a rock and are unable to read this review, you know what emojis are.  Those little icons meant to display a singular emotion, whether that be sadness, happiness, anger.  There's obviously a shit-ton of emojis out there, but I'm just narrowing it down for the purpose of this review.  Well, this movie uses the emojis like Inside Out uses actual emotions.  Because, apparently, emojis in this world are as important and relevant as actual conversation and communication.  Conceptually, the movie is idiotic right from the start.  The meh emoji (I can't believe I just typed that) fails at his one job of being meh.  He fails at this by being too many emojis at once, he is called a malfunction and destroys his workplace with his malfunctions.  He teams up with the high-five emoji and Jailbreak (the original princess emoji) to reprogram the code so he'll be a proper meh emoji and Alex, the kid who owns the phone the emojis live, won't erase every app later that afternoon.  Apparently, one glitch is enough to make this kid want to erase every app on his phone, which he could actually do himself, but he decides to go to this store to have the apps erased.  Because the suffering needs to go on even longer.  But, fine, that's the basic outline of the story.  That's not the problem, naturally, the problem is the horrifyingly lazy humor on display here.  Sir Patrick Stewart (yes, he's in this) plays the turd emoji.  You can only imagine what his jokes will be like.  Puns surrounding the word duty, his being #2, wanting to be soft, but not too soft, people making a stink out of things.  Goddamnit, FUCKING WHY IS THIS HAPPENING?!?!?!?!  You pay Patrick Stewart to give him trash material to deliver.  I like Stewart, he still took the paycheck, but I like him and I think he deserves so much better than this.  But that's not the only egregious example of lazy, uninspired humor.  There's the emoji monkeys who are on, I quote, monkey business.  HA!!!  GET IT, BECAUSE THEY'RE MONKEY BUSINESSMEN!!!  HUMOR!!!!!  To borrow a line from the Honest Trailer from this movie, they run the meh emoji joke into the ground.  Mel tells his wife not to overreact and when she goes 'Oh my' in the most bored way possible, he replies 'see, I knew you'd overreact'.  MORE HUMOR!!!   And they really do run this joke into the ground.  If it wasn't funny the first time, it's not gonna be funny the fifth time.  It is, quite frankly, the most offensively lazy animated movie in terms of humor that I've seen in ages.  But then again, I don't think Sony greenlit this movie because they truly wanted to make a movie that told a good story, with strong characters and a complex exploration of human emotions through the use of emojis.  That's not what they wanted to do.  They wanted a movie that they could use to sell companies as cross-promotion.  Sony has been shy about littering their movies with so much product placement (of their own products) to the point that it's sickening.  Everyone remember in Chappie, when they used something like 200 (I'm just guessing, but this is an example) PS4s in order to create one giant supercomputer instead of using, you know, an actual supercomputer.  Because in a crime-ridden sci-fi world, it's really easy to find 200 PS4s just laying about.  Chappie was distributed by Columbia Pictures, which is owned by Sony.  So, obviously, the 200 PS4s were a Sony mandate.  This movie, on the other hand, reaches out to other companies in order to get their brand in this movie.  One of the few concepts I liked about this movie was the fact that every app is its own unique world.  I liked that concept in theory but, of course, given how many brands are in this movie, they just serve like commercials for those specific apps and not because the film requires it.  The problem is, though, that this movies take so long to make that a few of the apps they use for their worlds are already outdated by this point.  Just Dance and Candy Crush immediately come to mind.  My mom loved Candy Crush like two years ago, now she's over it and she's on to the Home/Gardenscapes of the world.  And this is a movie made for idiot kids, where if they haven't seen it within the last week, they've already forgotten about it.  I can imagine some kid asking his/her parent what the hell Candy Crush is.  That's only two of the worlds.  Let me just list off the brands that bought some space in this movie.  Instagram, Facebook (logo only, since you only see their world from outside), Twitter (the bird logo helps Jailbreak and Hi-5), Spotify, Dropbox, YouTube, WeChat.  And that's on top of Candy Crush and Just Dance.  Off the top of my head, that's NINE different brands shoved into this movie.  I'm sure there's plenty others, but I just forgot about them.  Remember how people were up in arms about The Lego Movie being a cynical marketing exercise for the Lego brand instead of the movie.  Yes, it was meant to sell the Lego brand, to be sure, but at least they used that brand to tell an insightful story on the importance of creativity for children as they're growing up.  It was an actual movie with characters, a story, humor and a lot of heart.  It ended up surprising a lot of people with how entertaining it was.  Where are those people now???  I mean I guess the fact of the matter is that since this movie wasn't called the Sony Cross-Promotion Marketing Experiment Movie then people couldn't overreact, but goddamn, guys, THIS movie deserves the outrage.  I think that's what pisses me off the most.  This isn't really a movie as much as it is Sony shoving a lot of brands in there to give them some shameless promotion.  And the sad thing is, I'm sure Sony Pictures Animation has a lot of really talented artists that worked hard as fuck for a long time to produce such a cynical piece of trash.  And it's not their fault, I'm sure that this was a Sony mandate.  And, even if it wasn't, even if it started as a legitimate movie surrounding emojis, Sony got their greedy little hands on it and they absolutely destroyed any chance this film might have had of being good.  This movie's existence is unacceptable.  I struggle to even think about stuff that I did like.  The animation is decent, but really bland.  The voice acting is fine, but not particularly inspired.  This felt like just a paycheck for everyone involved.  I imagine there's no real passion involved once you read the script and you see how this is actually gonna play out.  This isn't the worst movie I've ever seen, not by a long shot, but as far as cynical marketing exercises go, this is, by far, the worst.  Even worse than Cars 2.  And, as an animated movie (even though this really isn't one), it's the worst I have ever seen from a major studio.  I rarely ever count movies done by smaller, independent studios, because they don't have the resources.  This is a terrible movie, you know how Lavar Ball 'speaks things into existence', well I'm gonna wish this movie into obscurity.  Everyone who had the unfortunate task of watching this will forget they ever spent 80 minutes of their lives they will never get back with this piece of trash.  I'm embarrassed for our species after this movie.  Where's the Patrick Stewart facepalm meme when you need it?","displayName":"Jesse O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":true,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-26T15:03:42.000Z","updateDate":"2018-03-26T15:03:48.000Z","user":{"userId":"1202249","realm":"RT","displayName":"Jesse O","accountLink":"/user/id/1202249"},"score":1,"timeFromCreation":"Mar 26, 2018"},{"rating":"STAR_0_5","review":"More like the emoji movie: KILL YOURSELF","displayName":"jyoti t","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-03-26T13:30:16.000Z","updateDate":"2018-03-26T13:30:38.000Z","user":{"userId":"976910973","realm":"RT","displayName":"jyoti t","accountLink":"/user/id/976910973"},"score":0.5,"timeFromCreation":"Mar 26, 2018"}]}