{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY1ODA2MzciLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMjhUMjE6NDU6MjAifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzQ4MTU0MjkiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMjhUMjE6NTM6MDYifQ=="},"reviews":[{"rating":"STAR_4","review":"Looks very funny movie is, I want to see it. BTW I like emoji and almost with my  email, facebook, text and so on.","displayName":"Vivian Q","displayImageUrl":"https://graph.facebook.com/v3.3/10206752512113040/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T21:53:06.000Z","updateDate":"2017-07-28T21:56:22.000Z","user":{"userId":"974815429","realm":"RT","displayName":"Vivian Q","accountLink":"/user/id/974815429"},"score":4,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_0_5","review":"Will go down as a classic like my other classic disney princess fables such as Sharks Tale, Food Fight and Norm of the North.\nDont forget to keep dabbing on the haters XDDDD","displayName":"Thade S","displayImageUrl":"https://graph.facebook.com/v3.3/577401565744712/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T21:51:17.000Z","updateDate":"2017-07-29T01:35:56.000Z","user":{"userId":"973059114","realm":"RT","displayName":"Thade S","accountLink":"/user/id/973059114"},"score":0.5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"the best rom com west of the wickalily.  Seriously i watched this movie as a joke but found out that it actually has some deeper meanings. you should be yourself and not adapt to the society's standards and expectations. also, it foresees our impending doom where everyone is always on their phone and don't have any human interaction. no","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/304794653317624/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T21:51:16.000Z","updateDate":"2017-07-28T21:53:58.000Z","user":{"userId":"976580654","realm":"RT","displayName":null,"accountLink":"/user/id/976580654"},"score":5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"This was a spiritual experience. I have been enlightened in the most true form of the word. The knowledge and wisdom that has been granted to me is far greater than the greatest reaches of time and space. I have ascended into a state of higher being and have bypassed all trivial human nature. The Emoji Movie is the beginning of the end.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/113826662606386/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T21:50:49.000Z","updateDate":"2017-07-28T21:57:28.000Z","user":{"userId":"976580653","realm":"RT","displayName":null,"accountLink":"/user/id/976580653"},"score":5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_1_5","review":"Most people would be surprised to learn how much more there is to the emoji phenomenon than little digital icons which we use to express emotion or represent activities or locations in our text messages. For instance, did you know that the word emoji has nothing to do with the words emotion or emoticon? Emoji is a combination of the Japanese words for \"picture\" and \"character\". Emojis started appearing on Japanese cell phones in the late 1990s. When they began showing up in the U.S. on the Apple iPhone in 2011, soon followed by other smart phones, emojis truly became a global phenomenon. So much so that there's even an annual World Emoji Day - and an international organization which regulates emojis!\n\nJuly 17th is World Emoji Day because that's the date the calendar emoji shows, but every day is emoji day for the non-profit Unicode Consortium. According to a July 16, 2017 \"USA Today\" article, \"The Unicode Emoji Subcommittee determines which characters will become part of the official emoji lexicon, creating a uniform code that can be used across platforms.\" The article also says that the consortium, which has been around since 1988, is striving to be more inclusive and representative when it comes to race, gender and sexual orientation, pointing out that, at press time, there were 2,666 approved emojis.\n\nOf course, the business and regulatory aspects of emojis don't matter to the people who send the 6 billion emoji-enhanced text messages worldwide every single day. They're just looking for a more complete way to express themselves digitally, to add a little emotional context to their messages. More than just being \"cute\", emojis help us communicate more effectively in our increasingly digital world. And with emojis increasingly prevalent in our daily text messages and Emails, is it any wonder that they would make their way onto movie screens too? And we get just that with the animated adventure comedy \"The Emoji Movie\" (PG, 1:26) bringing to \"life\" those little yellow faces and other digitized objects in the summer of 2017, less than two weeks after the 4th (yes, 4th) annual World Emoji Day.\n\nAlex (voiced by Jake T. Austin from the Disney Channel's \"Wizards of Waverly Place\") is a typical teenager. He doesn't like school, but he does like a girl in his school, a pretty young lady named Addie (Tati Gabrielle). Of course, he tries to communicate with her through his smart phone, but he finds it difficult - because he's shy, but also because his phone seems to have a mind of its own these days. Little does Alex know, but inside his phone is a virtual city called Textopolis, which is where emojis live and work. The job of all the emojis is to stand by for Alex to call upon them in a text message and, when chosen, to present their best individual image as he or she is scanned for a digital text transmission.\n \nGene (T.J. Miller) is excited and nervous because this is his first day on the job as an emoji - the \"meh\" emoji. His parents, Mr. & Mrs. Meh (Steven Wright and Jennifer Coolidge), aren't sure he's ready, but he assures them that he is and he takes his position in his cube, waiting to be chosen to appear in a text message. When Alex chooses the meh emoji for a text to Addie, Gene freaks out during his scan, causing Alex to embarrass himself by sending Addie a very odd-looking emoji that she doesn't understand. Gene's mistake causes Smiler (Maya Rudolph), the head emoji, to label Gene a \"malfunction\" and order that he be deleted. Gene makes a run for it and Smiler sends menacing black bots after him.\n\nGene's \"problem\" is that he feels and expresses more emotions than meh. Now, besides being frustrated that he can't just be the meh that he was born to be, he has endangered the entire emoji community. If Alex thinks there's something wrong with his phone, he may just have it wiped clean. Hoping to get \"fixed\", Gene teams up with the hand emoji Hi-5 (James Corden), who is upset that he's no longer in the Favorites Lounge, and the two of them go in search of a hacker named Jailbreak (Anna Faris). Jailbreak is uninterested in helping them until she sees that Gene can show multiple emotions. She decides to help them get to a magical place called The Cloud where all of them may find the solutions to their problems. As the three emojis work their way through Alex's phone (while trying to steer clear of the bots), they cause various apps to malfunction, making even more problems for Alex.\n\n\"The Emoji Movie\" is derivative and not very enjoyable. The story, directed and co-written by Tony Leondis (\"Lilo & Stitch: Stitch Has a Glitch\") is a combination of \"Inside Out\", \"Toy Story\", \"Divergent\" and \"The Wizard of Oz\", but not nearly as good as any of them. The script finds many opportunities for humor in actual cell phone usage and the emojis that \"live\" in them, but the movie just isn't all that funny. There are positive lessons about the bonds of friendship and being the best version of yourself regardless of what others think, but those ideas have been portrayed more effectively by countless other movies before this one. \"The Emoji Movie\" is clever enough, but entertaining? Not enough. \"C\"","displayName":"Dave M","displayImageUrl":"https://graph.facebook.com/v3.3/1454412859/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T21:50:29.000Z","updateDate":"2017-07-28T21:50:37.000Z","user":{"userId":"876318698","realm":"RT","displayName":"Dave M","accountLink":"/user/id/876318698"},"score":1.5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"Best movie 100/100 fam!","displayName":"goed f","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T21:49:45.000Z","updateDate":"2017-07-28T21:50:03.000Z","user":{"userId":"976580650","realm":"RT","displayName":"goed f","accountLink":"/user/id/976580650"},"score":5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"I 100% recommend this movie, it was tear jerking and incredibly moving. Full of twists and turns and by far the best movie I have ever seen, I walked in wearing my JacksFilms shirt and fidget spinner and walked out a whole new emoji loving person. I hope there is a sequel and if there is you bet I'll be there.","displayName":"Callie%20 L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T21:48:37.000Z","updateDate":"2017-07-28T21:50:42.000Z","user":{"userId":"976580648","realm":"RT","displayName":"Callie%20 L","accountLink":"/user/id/976580648"},"score":5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_0_5","review":"...but who was phone?","displayName":"Deuce L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T21:47:45.000Z","updateDate":"2017-07-28T21:48:40.000Z","user":{"userId":"976580644","realm":"RT","displayName":"Deuce L","accountLink":"/user/id/976580644"},"score":0.5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"BEST MOVIE EVER!!!!\n\n\n\n\n\n\n\n\n\n\n\n\nJK Its so BORING","displayName":"Aldrian H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T21:46:05.000Z","updateDate":"2017-07-28T21:48:25.000Z","user":{"userId":"976580639","realm":"RT","displayName":"Aldrian H","accountLink":"/user/id/976580639"},"score":5,"timeFromCreation":"Jul 28, 2017"},{"rating":"STAR_5","review":"Lighten up and have a good time with the fam! Not as slick as most animated films but light hearted and clever.","displayName":"Julie O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-28T21:45:20.000Z","updateDate":"2017-07-28T21:46:27.000Z","user":{"userId":"976580637","realm":"RT","displayName":"Julie O","accountLink":"/user/id/976580637"},"score":5,"timeFromCreation":"Jul 28, 2017"}]}