{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY0MjM3MjYiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMjlUMTM6NTA6MTgifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY1ODMxMjUiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMjlUMTQ6MjA6NDIifQ=="},"reviews":[{"rating":"STAR_5","review":"i never watched a better movie in my life. i felt so aroused through the whole movie, by the time i walked out, there was a huge white trail on the ground behind me. instead of doing drugs i'll be watching this movie because it's all i'll need to ever live","displayName":"EMOJIMOVIE L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T14:20:42.000Z","updateDate":"2017-08-06T15:26:22.000Z","user":{"userId":"976583125","realm":"RT","displayName":"EMOJIMOVIE L","accountLink":"/user/id/976583125"},"score":5,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_1","review":"¿I need to explain why this is shit? ¿How you can make an emoji movie? Easy: YOU CAN'T. Everything of this movie is generic, cliche, boring, unfunny, stupid and annoying. Sure, the animation is nice and the voice cast is not that bad, but still The Emoji Movie is exactly what everybody expected. A shitty movie without effort and makes another terrible movie for Sony in the list of worst animated movies of the decade. If you want something entertaining for your kids, go and watch better movies. Go and watch Spider-Man; Homecoming, go and watch Despicable Me 3 again,go and watch The LEGO Batman Movie of Guardians of the Galaxy Vol. 2. Just anything that is good and enjoyable than this piss of shit.","displayName":"Fermín P","displayImageUrl":"https://graph.facebook.com/v3.3/1638237279748363/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T14:17:42.000Z","updateDate":"2017-07-29T14:22:39.000Z","user":{"userId":"971750508","realm":"RT","displayName":"Fermín P","accountLink":"/user/id/971750508"},"score":1,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_0_5","review":"Watching this put me on the brink of death","displayName":"Beck S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T14:16:47.000Z","updateDate":"2017-07-29T14:17:15.000Z","user":{"userId":"976583126","realm":"RT","displayName":"Beck S","accountLink":"/user/id/976583126"},"score":0.5,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_1","review":"This is the second worst movie that I have ever seen just in front on the pirates who don't do anything.  please do not support such a bad movie. there is no worse rating than one star","displayName":"Bob H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T14:06:09.000Z","updateDate":"2017-07-29T14:06:09.000Z","user":{"userId":"976583073","realm":"RT","displayName":"Bob H","accountLink":"/user/id/976583073"},"score":1,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_0_5","review":"Worst movie ever and a waste of movie","displayName":"David V","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T13:59:43.000Z","updateDate":"2017-08-05T09:52:45.000Z","user":{"userId":"976583059","realm":"RT","displayName":"David V","accountLink":"/user/id/976583059"},"score":0.5,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_5","review":"5 stars \nthe only real way i can show my love for this movie is with emojis","displayName":"Jimmy N","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T13:57:22.000Z","updateDate":"2017-08-11T08:55:31.000Z","user":{"userId":"976583049","realm":"RT","displayName":"Jimmy N","accountLink":"/user/id/976583049"},"score":5,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_1","review":"Grade:  D\n\nRating: PG, 86 minutes\n\nIn a Nutshell:  Meh. Rumor has it that this film was Sony's last effort to make a good movie before going bankrupt.  I doubt that's true, but I have a feeling they're not going to be posting any happy emojis when they see how audiences are reacting to this disappointing movie.\n\nUnfortunately, It appears to be a blatant money grab, as well as a copycat of Pixar's successful movie Inside Out (Theatrical). \n\nBased on the idea that high schooler's lives revolve around cell phones, the animated emojis live in a colorful, nonsensical world called Textropolis.  In fact, the narrator (Meh) exclaims cell phones as the \"most important invention in the history of communication.\" Ummm...no.  I love using emojis too, but I love language even more...and real human interaction.\n\nUplifting theme: \nIndividuality, express yourself\n\"Being #1 doesn't matter if there aren't any other numbers.\" - Meh, Jail Break\n\"I'd rather have a real friend.\" - Meh, hand\nIt's OK to have a lot of different emotions.\nFriendship, loyalty\n\nThings I liked:\nThe talented voice cast includes T.J. Miller, James Corden, Anna Faris, Maya Rudolph, Steven Wright, Jennifer Coolidge, Christina Aguilera, and Sofia Vergara.  Can you believe Patrick Stewart plays \"Poop\"?!\nGood music.\nThe parents of \"Meh\" talk in monotone, which is pretty funny, especially when you recognize comedian Steven Wright's voice who is absolutely perfect for his role.\nThe YouTube video of the kitten getting tickled got more reaction out of the audience than anything else in the entire movie.  \n \n\nTons of poop jokes.  Who doesn't love the poop emoji?  Some movie critics are using it to describe this movie. The poop emojis are in a lot of scenes and easy to write gags for.  I thought it was cute when the young poop followed his dad out of the bathroom with toilet paper stuck on his foot.\nThere's a quick look at WeChat, which Meh describes as \"a whole other world.\"  That's for sure.  I've been to China twice this year and have been completely amazed with WeChat.  You can invite a friend out to dinner, make a reservation at a restaurant, call a taxi service to take you there, pay for dinner, and all without ever leaving the app.  You can even pay for vending machines, go shopping, shake your cell phone to win prizes, and soooooo much more, all on WeChat.  It's like all of America's apps built into one.\nWhen you see The Emoji Movie in the movie theater, you'll also get to see the animated short called \"Puppy\", based on the characters from Hotel Transylvania.\n\nThings I didn't like:\nReally dumb script and plot.\nIt's just not funny.  When I arrived in the theater, kids were bouncing out of their seats with excitement.  Once the movie started, they became almost comatose.\nPredictable, obligatory dance number at the end of the movie that fell flat.\n\n \n\nFunny lines:\n\"My mom just joined Facebook.  Can you believe she wanted to friend me?\" - school girl\n\"We're number two!  We're number two!\" - poop emojis\n\"What could a teenage boy possibly want to hide from his parents?\" - Meh (T.J. Miller)\n\nDumb lines:\n\"We have business to attend to.\" - monkey emojis\n\"What kind?\" - Meh\n\"Monkey business!\" - monkey emojis\n\"Words aren't cool.\" - boy's friend'\n\"That's what matters in life: popularity.\" - High 5 (James Corden) \n\nTips for parents: \nYour kids deserve a better movie.\nTalk of piracy, skins, and a ton of social media programs.\n\n\nMOVIE REVIEW MOM\n\n@trinaboice","displayName":"Trina B","displayImageUrl":"https://graph.facebook.com/v3.3/527012958/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T13:54:59.000Z","updateDate":"2017-07-29T13:56:56.000Z","user":{"userId":"793945371","realm":"RT","displayName":"Trina B","accountLink":"/user/id/793945371"},"score":1,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_1","review":"Um what? This is as shit  as the poop emoji!","displayName":"Tommy J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T13:51:47.000Z","updateDate":"2017-07-29T13:52:33.000Z","user":{"userId":"976583030","realm":"RT","displayName":"Tommy J","accountLink":"/user/id/976583030"},"score":1,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_5","review":"I would totally fuck Jailbreak","displayName":"Jerry S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T13:51:18.000Z","updateDate":"2017-07-29T13:55:56.000Z","user":{"userId":"976580391","realm":"RT","displayName":"Jerry S","accountLink":"/user/id/976580391"},"score":5,"timeFromCreation":"Jul 29, 2017"},{"rating":"STAR_0_5","review":"I was expecting there to be a moral to the film, as there were many instances of social media interfering with the main human character Alex's relationships. I thought he was gonna realize that friends are more important than \"fans\" (which is how the movie put it), but that didn't happen. I would've accepted anything else in comparison to what I got. The emojis ended up improving his social life somehow, which doesn't make sense (Alex's crush takes a liking to him because he sent her an emoji, her reasoning being that he's more expressive with his emotions than other guys. Through emojis.) and contradicts what emojis were made out to be by the film itself: nuisances to actual social lives.\n\nI found no redeeming qualities. The fact it relies on product placement to progress the story. The terribly unoriginal and lazily minimalistic character designs. To add insult to injury, the cheap animation and bare minimum of a story pair well with the unfunny performances the film provided, especially the character of Hi-5, who was one of the worst comic relief characters I've ever seen or heard in a film, ever.\n\nIn addition, the Jailbreak emoji did almost nothing to aid multi-expression emoji Gene on his journey, only acting as his unnecessary love interest. The reveal that she's actually a princess emoji is not in the least surprising, as she implies it multiple times prior to the reveal, unsubtly.\n\nAlso, hearing T. J. Miller proudly exclaim \"I'm an emoji\" made me wanna die.","displayName":"Kai B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-29T13:50:18.000Z","updateDate":"2017-07-29T13:50:37.000Z","user":{"userId":"976423726","realm":"RT","displayName":"Kai B","accountLink":"/user/id/976423726"},"score":0.5,"timeFromCreation":"Jul 29, 2017"}]}