{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY4MzQyNzMiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMTEtMDVUMTU6MTc6NDkifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY4NDI0ODciLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMTEtMDlUMTk6MDQ6MDUifQ=="},"reviews":[{"rating":"STAR_5","review":"This is the greatest movie every created! I don't know what all the fuss is about! Me and my 17 kids loved it the 57 times we saw it! Please just give it a chance!","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/121172565321587/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-11-09T19:04:05.000Z","updateDate":"2017-11-09T19:09:08.000Z","user":{"userId":"976842487","realm":"RT","displayName":null,"accountLink":"/user/id/976842487"},"score":5,"timeFromCreation":"Nov 09, 2017"},{"rating":"STAR_5","review":"10/10 movie, would pay thousands of dollars to see it again. It was so good, it relieved me of my cancer.","displayName":"Donivan I","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-11-09T06:02:13.000Z","updateDate":"2017-11-09T06:04:19.000Z","user":{"userId":"976841338","realm":"RT","displayName":"Donivan I","accountLink":"/user/id/976841338"},"score":5,"timeFromCreation":"Nov 09, 2017"},{"rating":"STAR_0_5","review":"Like most people, I hated the trailers. I was not hyped for this movie what so ever, but I saw it any way. This movie is complete rip off of wreck it ralph and inside out, both movies that I saw and loved. This movie completely relies on the fact that its all about emoji's which completely gets old within a few seconds. I've never seen a movie where I hated every single character, especially the hi five emoji. While product placement never bothered me, this movie actually got to me with it because it shoved it right in my face and was incredibly un-creative with it. My final complaint is that this movie is the same as Shark Tale, as in nobody had any bright ideas for this movie, they just made it based off marketing surveys. So all together, this movie comes second place to Foodfight as the worst animated movie of all time.","displayName":"Sam O","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-11-09T01:37:25.000Z","updateDate":"2017-11-12T17:23:45.000Z","user":{"userId":"976589012","realm":"RT","displayName":"Sam O","accountLink":"/user/id/976589012"},"score":0.5,"timeFromCreation":"Nov 09, 2017"},{"rating":"STAR_3","review":"Me gusto, la idea de traer a la vida un mundo de emojis imaginario es lo mismo que crear un mundo de Legos. Solo hay que crear una buena historia y es en eso donde esta pierde algunos puntos","displayName":"I-Onell S","displayImageUrl":"https://graph.facebook.com/v3.3/618860485/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-11-08T14:44:02.000Z","updateDate":"2017-11-08T14:44:02.000Z","user":{"userId":"833460099","realm":"RT","displayName":"I-Onell S","accountLink":"/user/id/833460099"},"score":3,"timeFromCreation":"Nov 08, 2017"},{"rating":"STAR_0_5","review":"Believe the rumors.  So in the world of anthropomorphized emojis, this is the story of a Meh emoji (T.J. Miller).  He is struggling to fit in because he experiences more than his one predetermined emotion, and he has a journey to go through if he wants to be able to find his place.  Now I heard about this well in advance, as it has been reigning in infamy as being one of the worst animated movies ever made.  I still held out the small glimmer of hope for this; the trailer for this didn't look to be all that bad, and this is from Sony Pictures who did more with less in Cloudy with a Chance of Meatballs back in the day (still my favorite animated movie of all time).  That hope I had was very quickly dashed about ten minutes in, and there is no getting around it: this is a stinker.  I did the disservice to myself of watching this while I was tired, and it ended up playing like a fever dream nightmare that I couldn't pinch myself awake from.  Every joke in this falls flat on its face, and I am having difficulty recalling a time where this even gave me a chuckle.  It's a story that's been done umpteen times before, and without even trying, I'm sure you can fill your brain with better animated features of characters finding their purpose.  The Emoji Movie is soulless, and it feels like this is written by adults who think that they have a grasp on what kids think is cool.  All of this is abundant throughout, but it is not what makes this movie worse than something like Smurfs: The Lost Village.  What makes this so offensive is that it is a walking, talking 90 minute advertisement for phone apps, and a blatant one at that.  I'm not talking about subtle product placement, either, I'm talking about characters looking at each other and saying \"Oh, we can use Spotify for that\".  The only positive I have to say about this is that I thought Anna Faris was alright.  She has experience with animated movies, and she has the proper amount of bubbliness in her voice to make a character at least tolerable.  I hated T.J. Miller in this who is just playing T.J. Miller, but I couldn't STAND James Corden as the Hi-5 emoji.  He is obnoxious, and to make it worse, he obstructs the forward movement of the plot.  I am about to give a minor spoiler for The Emoji Movie (like this even matters), but there is a moment when Hi-5 is put in peril, and Meh makes this big deal about having to go back for him.  Why would you even care?  You've known him for about 15 minutes and all he did was annoy you, let him rot.  It feels like they just wrote one draft of the script and said that it was good enough, and may the gods have mercy on your soul if you spend time on this phone commercial.","displayName":"John M","displayImageUrl":"https://graph.facebook.com/v3.3/25106477/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-11-08T06:27:58.000Z","updateDate":"2017-11-08T06:28:00.000Z","user":{"userId":"782214838","realm":"RT","displayName":"John M","accountLink":"/user/id/782214838"},"score":0.5,"timeFromCreation":"Nov 08, 2017"},{"rating":"STAR_0_5","review":"Worst movie to ever exist I'm serious this movie makes me feel like I'm watching wreck it Ralph or thee lego movies. And the same boring plot too main character is on a quest do to something the world is struggling someone's trying to stop him. WORST MOVIE EVER","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/137566347001997/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-11-07T18:26:46.000Z","updateDate":"2017-11-07T18:29:11.000Z","user":{"userId":"976838696","realm":"RT","displayName":null,"accountLink":"/user/id/976838696"},"score":0.5,"timeFromCreation":"Nov 07, 2017"},{"rating":"STAR_0_5","review":"Not only was an movie based on emojis a terrible idea, but I think someone could do better at an emoji movie","displayName":"Drew L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-11-06T14:05:27.000Z","updateDate":"2017-11-06T14:07:30.000Z","user":{"userId":"976589837","realm":"RT","displayName":"Drew L","accountLink":"/user/id/976589837"},"score":0.5,"timeFromCreation":"Nov 06, 2017"},{"rating":"STAR_5","review":"THISD IS THE GREATEST MOVEE I HAVE EVER SEEN I WPLSD RECOMENSD THIS TO ANYONE EVUR I LOV THIS MOVIE AND I THIKN THT IS THE BEST MOVE EVEER","displayName":"Gay B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-11-06T07:25:15.000Z","updateDate":"2017-11-06T07:26:23.000Z","user":{"userId":"976835676","realm":"RT","displayName":"Gay B","accountLink":"/user/id/976835676"},"score":5,"timeFromCreation":"Nov 06, 2017"},{"rating":"STAR_3_5","review":"This movie,(AKA The Monkey Directed Movie) has a certain type of thrill to it. The type of thrill you get is similar to the thrill of getting your hand stuck in a vending machine. Or a paper cut. Or getting turned into human flambé veeery slowly with a cigarette  lighter. It's that bad.","displayName":"Carrie G","displayImageUrl":"https://graph.facebook.com/v3.3/1472044778/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-11-05T19:43:54.000Z","updateDate":"2017-11-05T19:43:54.000Z","user":{"userId":"846912607","realm":"RT","displayName":"Carrie G","accountLink":"/user/id/846912607"},"score":3.5,"timeFromCreation":"Nov 05, 2017"},{"rating":"STAR_0_5","review":"Just a silly way to put all kind of publicity without even thinking of how the costumers feel about it. This movie is so cliché that you try to stop paying attention to it, but it has to continue over another hour to make you die slowly. This movie is basically the worst of the worst. Nothing on it makes anything good. It was better as a meme than as a movie.","displayName":"Ricardo C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-11-05T15:17:49.000Z","updateDate":"2017-11-05T15:23:38.000Z","user":{"userId":"976834273","realm":"RT","displayName":"Ricardo C","accountLink":"/user/id/976834273"},"score":0.5,"timeFromCreation":"Nov 05, 2017"}]}