{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzUzMDM1NTMiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDEtMTFUMTg6MzY6MzYifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzYwNDYwNDgiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDMtMDZUMTM6MDY6MTMifQ=="},"reviews":[{"rating":"STAR_1","review":"Yay! The director of Igor.... End my life. Since it is about emojis, here is the real way to describe it ?? (Middle Finger Emoji).","displayName":"Ben S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-03-06T13:06:13.000Z","updateDate":"2017-08-26T12:58:17.000Z","user":{"userId":"976046048","realm":"RT","displayName":"Ben S","accountLink":"/user/id/976046048"},"score":1,"timeFromCreation":"Mar 06, 2017"},{"rating":"STAR_0_5","review":"This is without a doubt, the worst movie I've ever seen in my life!","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-03-05T17:11:12.000Z","updateDate":"2018-03-17T15:29:26.601Z","user":{"userId":"974813349","realm":"RT","displayName":null,"accountLink":"/user/id/974813349"},"score":0.5,"timeFromCreation":"Mar 05, 2017"},{"rating":"STAR_0_5","review":"THIS IS ONE IF THE WORST MOVIE IVE SEEN IN MY LIFE","displayName":"Divit  K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-03-04T12:07:39.000Z","updateDate":"2017-10-07T18:03:46.000Z","user":{"userId":"975499204","realm":"RT","displayName":"Divit  K","accountLink":"/user/id/975499204"},"score":0.5,"timeFromCreation":"Mar 04, 2017"},{"rating":"STAR_0_5","review":"IT sounds like the beginning of the fall of humanity is here","displayName":"Luca D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-03-02T16:24:15.000Z","updateDate":"2017-03-02T16:25:05.000Z","user":{"userId":"976122659","realm":"RT","displayName":"Luca D","accountLink":"/user/id/976122659"},"score":0.5,"timeFromCreation":"Mar 02, 2017"},{"rating":"STAR_1","review":"I can tell you a hundred things that are wrong with this movie but I will keep it short and sweet..........IT IS PURE GARBAGE!!! There is no plot line nor storyline that can save this. It's your average dumb you down film that will make you want your money back. What was the point of even releasing it when it gets over 78,000 dislikes on it's YouTube page...that's a sign to Sony and it's executives that nobody wanted or asked for. Take my advice and save your money for like Atomic Blonde or Dunkirk that will be worth your time instead of 86 minutes of nonsense.","displayName":"Taylor B","displayImageUrl":"https://graph.facebook.com/v3.3/100001401103727/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-03-02T08:51:49.000Z","updateDate":"2017-08-07T21:15:55.000Z","user":{"userId":"929573808","realm":"RT","displayName":"Taylor B","accountLink":"/user/id/929573808"},"score":1,"timeFromCreation":"Mar 02, 2017"},{"rating":"STAR_0_5","review":"\"My brain literally turned upside down watching this movie. It is the \"Baby Geniuses\" of animated features\"\nMovie Review: The Emoji Movie\nDate Viewed: July 29 2017\nRating: Zero Stars out of Five\nDirected By Tony Leondis (Lilo & Stitch 2: Stitch Has a Glitch and Igor)\nScreenplay By Tony Leondis, Eric Siegel and Mike White, Story By Tony Leondis and Eric Siegel\nFeaturing the voices of T.J. Miller, James Corden, Anna Faris, Maya Rudolph, Steven Wright, Jennifer Coolidge, Patrick Stewart, Christina Aguilera, Sofia Vergara, Jeff Ross, Sean Hayes, Rachael Ray, Jake T. Austin and Tati Gabrielle.\n\nMy brain literally turned upside down watching this movie. It has no imagination, relatable characters or even a heartfelt message. I guess there's a story here but it's buried under a ton of product placement and dreadful candy-colored animation. It literally borrows elements from \"Inside Out\" and it features the same \"You can be different as long as you stay true to yourself\" message we got from \"The LEGO Movie\" and \"Wreck-It Ralph\". How could this film deliver so little an impact? It is a film so dumb, so stupid, so unfunny and so unoriginal, I wonder I can review another film again because of it.\n\nWhen I first saw the teaser trailer for \"The Emoji Movie\", I went \"YOU GOT TO BE KIDDING ME!\". Okay, I had low expectations for \"Power Rangers\" and \"Smurfs: The Lost Village\" but they were surprisingly not bad because the filmmakers put some thought into them instead of just being easy cash-grabs. \"The Emoji Movie\" is beyond an easy cash-grab, it is an unholy mess. Be afraid, be very, very, very, very, very, very, very afraid. The one line in this film that made me very angry was....UGH! Emojis are the most important form of communication ever invented. It's official people, originality in Hollywood is dead. Even though, there are some original ideas out there like \"Get Out\", \"Dunkirk\" and \"Baby Driver\", this film just declares that Hollywood has got nothing left.\n\nAre emojis even a big thing right now? I know a lot of people use them for their text messages every single day but turning these yellow, tennis-ball shaped ideograms into a feature-length animated movie? I would like to say that it is stretch but it's not, it's just unfilmable. If this film thinks that words don't matter than quality cinema as we know it is doomed.\n\nThe plot if there is one centers around a particular \"Meh\" emoji named Gene (voiced by T.J. Miller), he lives in a digital city named Textopolis where all of the other emojis live but they all have to express the one emotion they represent otherwise they become outcasts. The emojis all live inside the phone of their user, a shy 14-year-old teenage boy named Alex (voiced by Jake T. Austin). Gene is the only emoji in his world that can express more than one emotion which concerns his parents, Mary Meh (voiced by Jennifer Coolidge) and Mel Meh (voiced by Steven Wright).\n\nAll of the emojis go to the cube where Alex selects his emoji and puts it in his text. When Gene gets chosen, he accidentally expresses a confusing reaction which leads text center leader and \"Smiley\" emoji, Smiler (voiced by Maya Rudolph) to declare Gene a malfunction and have him be deleted. Gene then hides out in the never-used emoji club where he bumps into Hi-5 (voiced by James Corden). He was a popular emoji once but Hi-5 lost his fame and glory because he never got used enough.\n\nHi-5 tells Gene that he can fixed if they can find the codebreaker emoji known as Jailbreak (voiced by Anna Faris). Gene believes that she is the only emoji who can crack the code to fixing him. Gene, Hi-5 and Jailbreak must go to the Dropbox so that they could go to the cloud and yes people, Dropbox becomes an important plot point to this terrible enterprise. They get chased by anti-Virus robots and they hop from one popular app to another like \"Just Dance\" and \"Candy Crush\" which causes Alex's phone to go completely bonkers. Alex starts to think that his phone might be broken which causes widespread panic in the city of Textopolis. Meanwhile, Gene's parents go outside of their world to search for their son and yeah Mary Meh and Mel Meh become important characters here because do you really wanna know? They are dealing with problems in their marriage.\n\nHold on guys, there's more horrificness to come, YouTube, Instagram and the \"Spotify\" app also make product plug appearances here and the voice cast also includes Christina Aguilera as Akiko Glitter, the super cool dancer from the \"Just Dance\" app, Sofia Vergara as the flamenco dancer emoji, Sean Hayes as the devil emoji and a casting choice that would've been seen as total science-fiction, Patrick Stewart voices Poop. No seriously, he literally voices a pile of s$&@.\n\nListen people, any joke involving or towards poop is not the least bit funny and this movie is dreadfully not funny. The voice actors sound bored to death, the characters barely have an identity, the animation here looks very ill and the screenplay which was conceived by director Tony Leondis (Lilo & Stitch 2: Stitch Has a Glitch and Igor), Eric Siegel and Mike White (Orange County, School of Rock, Nacho Libre) doesn't make any or logical sense. As for the kid who owns the phone, his only purpose in the film is to win over this girl that he likes and it all comes down to him picking the right emoji because you know, words don't matter anymore.\n\nYou know what movie, you don't deserve any emojis or emoji puns because words do matter. I'm a film critic, whether I like it or dislike it, I always express my opinion on a movie through words. It's simply the best way to communicate with people who love going to the movies. If you say that emojis are the most important form of communication in the world right now than you're basically slapping us film critics in the face.\n\nThe only highlight from this 86-minute nightmare of a movie is that there's a \"Hotel Transylvania\" short attached to it called \"Puppy!\". It centers around Dracula getting a giant pug for his grandson and the monstrous dog causes all sorts of trouble for Dracula and his hotel. The short was funnier and more cute compared to this clunker. \"The Emoji Movie\" is truly an artless film. It is the \"Baby Geniuses\" of animated features. And finally it is hands down the worst movie of 2017.","displayName":"Patrick L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-02-28T16:43:58.000Z","updateDate":"2017-10-21T08:03:16.000Z","user":{"userId":"942439004","realm":"RT","displayName":"Patrick L","accountLink":"/user/id/942439004"},"score":0.5,"timeFromCreation":"Feb 28, 2017"},{"rating":"STAR_0_5","review":"I don't know much Spanish, but this is MUY MALO","displayName":"Soren S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-01-29T20:05:25.000Z","updateDate":"2017-07-28T14:28:38.000Z","user":{"userId":"975764050","realm":"RT","displayName":"Soren S","accountLink":"/user/id/975764050"},"score":0.5,"timeFromCreation":"Jan 29, 2017"},{"rating":"STAR_3_5","review":"A nice heartwarming movie. Funny, cool, good actors doing the voices as well, like T.J Miller & James Corden!","displayName":"Logan B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-01-27T09:31:08.000Z","updateDate":"2017-10-14T20:00:24.000Z","user":{"userId":"955939903","realm":"RT","displayName":"Logan B","accountLink":"/user/id/955939903"},"score":3.5,"timeFromCreation":"Jan 27, 2017"},{"rating":"STAR_0_5","review":"WHY DOES THIS EVEN EXIST","displayName":"Mustapha W","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-01-18T07:12:54.000Z","updateDate":"2017-01-18T07:13:39.000Z","user":{"userId":"975979863","realm":"RT","displayName":"Mustapha W","accountLink":"/user/id/975979863"},"score":0.5,"timeFromCreation":"Jan 18, 2017"},{"rating":"STAR_0_5","review":"My tax dollars paid for this movie!","displayName":"Goose M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-01-11T18:36:36.000Z","updateDate":"2017-07-28T14:27:32.000Z","user":{"userId":"975303553","realm":"RT","displayName":"Goose M","accountLink":"/user/id/975303553"},"score":0.5,"timeFromCreation":"Jan 11, 2017"}]}