{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NTE1MzQyODgiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDgtMTFUMTI6NTM6MzMifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY2MTY5NzkiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDgtMTFUMTY6NDQ6MjEifQ=="},"reviews":[{"rating":"STAR_0_5","review":"I hate this movie before even watching it.","displayName":"STUDIOCRAFTapps D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-11T16:44:21.000Z","updateDate":"2017-08-11T16:44:59.000Z","user":{"userId":"976616979","realm":"RT","displayName":"STUDIOCRAFTapps D","accountLink":"/user/id/976616979"},"score":0.5,"timeFromCreation":"Aug 11, 2017"},{"rating":"STAR_5","review":"This movie was funny.  My favorite part was the cat video.  This is one of the best movies of the year.","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/10203649780590228/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-11T16:19:03.000Z","updateDate":"2017-08-11T16:21:05.000Z","user":{"userId":"976616931","realm":"RT","displayName":null,"accountLink":"/user/id/976616931"},"score":5,"timeFromCreation":"Aug 11, 2017"},{"rating":"STAR_4","review":"Very cute way better than I anticipated for sure.","displayName":"Angela L","displayImageUrl":"https://graph.facebook.com/v3.3/1610455723/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-11T15:54:16.000Z","updateDate":"2017-08-11T15:54:16.000Z","user":{"userId":"892408549","realm":"RT","displayName":"Angela L","accountLink":"/user/id/892408549"},"score":4,"timeFromCreation":"Aug 11, 2017"},{"rating":"STAR_4_5","review":"Outstanding movie! First movie in years that I've laughed this much. May go back and see it again.","displayName":"Scott C","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-11T15:49:17.000Z","updateDate":"2017-08-11T15:49:17.000Z","user":{"userId":"951396242","realm":"RT","displayName":"Scott C","accountLink":"/user/id/951396242"},"score":4.5,"timeFromCreation":"Aug 11, 2017"},{"rating":"STAR_0_5","review":"Bad. Most people would say meh. But it's not even good enough to be meh. It had maybe two good jokes in a super overused plot. It was wreck it Ralph without the heart and Disney charm. I don't even suggest seeing it jokingly because it's not even good bad. It's just bad","displayName":"Lex B","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-11T15:06:42.000Z","updateDate":"2017-08-11T15:06:42.000Z","user":{"userId":"971066596","realm":"RT","displayName":"Lex B","accountLink":"/user/id/971066596"},"score":0.5,"timeFromCreation":"Aug 11, 2017"},{"rating":"STAR_5","review":"It's so hilarious and amazing i loved it","displayName":"Jsa Q","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-11T15:06:23.000Z","updateDate":"2017-08-11T15:06:23.000Z","user":{"userId":"976616760","realm":"RT","displayName":"Jsa Q","accountLink":"/user/id/976616760"},"score":5,"timeFromCreation":"Aug 11, 2017"},{"rating":"STAR_5","review":"best movie 10/10 I saw it 4 times, 1 to see it, 2 to appreciate it, 3 to study it, and 4 to make therius","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/499393110408613/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-11T14:49:57.000Z","updateDate":"2017-08-11T14:51:18.000Z","user":{"userId":"976616735","realm":"RT","displayName":null,"accountLink":"/user/id/976616735"},"score":5,"timeFromCreation":"Aug 11, 2017"},{"rating":"STAR_5","review":"iTs wAz LikE Th3 B3St eVr","displayName":null,"displayImageUrl":"https://graph.facebook.com/v3.3/878287915656550/picture","isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-11T13:04:55.000Z","updateDate":"2017-08-11T13:05:52.000Z","user":{"userId":"976616534","realm":"RT","displayName":null,"accountLink":"/user/id/976616534"},"score":5,"timeFromCreation":"Aug 11, 2017"},{"rating":"STAR_0_5","review":"The emoji movie is the worst film I have ever had the displeasure of having to sit through, FACT, this utter cluster fuck of shambolic storylines and cheap jokes is really the lowest denominator in current cinematography. For example in the first 10 minutes alone of this film there was 5 jokes about poo, these jokes are just cheap laughs from stupid children. Talking about children you would presume that the main demographic is children however there was an uncomfortable amount of jokes and statements at the expense of this target audience. \n\nThe story was so unbelievably predictable and boring, an emoji is out of place so goes away and try's to find his place but then realises that no matter what other people say being yourself is always best, wow how original definitely nothing like the lego movie, wreck it Ralph or inside out. The similarities don't end there either, when the \"emojis\" went into the candy crush world ( which was so ashamingly bad product placement ) the whole world looked identical to that of the candy land in wreck it Ralph. The sub plot with the character Alex trying to ask adie to the dance was painful cringey to watch, it was like having to sit through 2 awkward teenagers messages, thanks for that. There was nothing else to that story other then to try and lazily give a way for the emojis to be alive and have a purpose. \nThe characters of genes parents speak in this dreadful monotone voice for the entire film, it wasn't funny the first time so by the 50th time it was unbearable. At one point they entered the YouTube app, now what video do you think they used to sum up all the content on YouTube, what one video is funny relatable and relevant. The video they used to do this was pen pineapple apple pen, shows how little the creators cared or knew about the world. The 3 main characters went into the just dance app, this segment definitely didn't go on to long and definitely wasn't boring or pointless. Another shameful product placement. There were so many parts that could have been removed and made no difference to the story, the whole thing could have been done in 25 minutes. \n\nSpoiler/ gene and jailbreak never have any sexual interaction, not even 1st base, but there's so much sexual tension seen in the trailers and the film, now I was confused with the message after gene told jailbreak his true feelings, she says that she doesn't feel the same and \" likes him the way he is\" this is a perfectly reasonable response, however gene becomes very sad after this and jailbreak blames herself for how he feels, are we being told that we should accept everyone no matter how we feel about them ourselves, this is a wrong message to tell to a very young group of people and left me very confused about wether this was the intended effect. \nAfter gene returns to text Troilus jailbreak in all her guilt uses her ability as a princess to whistle the twitter bird to take her back to the town, this felt so lazy and was very confusing, to the main demographic many wouldn't of understand the premise of this.  \n\nThe segment where genes parents entered the Instagram app was again a lazy and lacklustre attempt to drag out the length of the film, why did the parents separate anyway, over a little argument over there son, which parents don't argue about there kids, it's not a call to split up instantly, when they reunite in the app we are left confused about how narrow minded and easily influenced the two of them are, obviously the whole thing is In an awful monotone that really makes it hard for any audience member to associate any emotion or empathy towards these lazily made up and cramed together characters.\n\nRealistically this film never stood a chance of being good, anyone with a developed brain could see past all the cringey and lazy passovers. The story was so predictable and the characters are so unrelatable, your not going to use a poop emoji and think of Patrick Stewart, unlike if you pick up a woody toy you will associate that toy with the charter tom hanks gave it, why is this, It's because you can't humanise an emoji, there are no questions or what ifs about little yellow pictures unlike there are with toys or video games. This film was a cheap money grab by a group of people who couldn't care less about the people they are showing it to or the product they are creating just more about the pay check at the end of the day, this film optimises what film has become today, money grabs from unintelligent audience who will lick up any shite that is thrown at them. \n\nOverall this film was an utter embarrassment to watch, I have 80 years on this spinning ball of rock and I chose to spend 90 minutes of that watching this utter shambolic shameful shit, this film should never of been a thing and all the ratings are too good 0/100, god I'm annoyed after watching this.","displayName":"Ben H","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-11T12:59:53.000Z","updateDate":"2017-08-11T13:00:30.000Z","user":{"userId":"976616522","realm":"RT","displayName":"Ben H","accountLink":"/user/id/976616522"},"score":0.5,"timeFromCreation":"Aug 11, 2017"},{"rating":"STAR_0_5","review":"i hate jacksfilms for making me see this","displayName":"Miranda J","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-08-11T12:53:33.000Z","updateDate":"2017-08-11T12:53:33.000Z","user":{"userId":"951534288","realm":"RT","displayName":"Miranda J","accountLink":"/user/id/951534288"},"score":0.5,"timeFromCreation":"Aug 11, 2017"}]}