{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzcyOTk1MDgiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDUtMzBUMjA6MDE6MjYifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzczMDU5ODYiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTgtMDYtMDRUMTI6MDQ6MDMifQ=="},"reviews":[{"rating":"STAR_5","review":"Well you see the reason why I love this movie is because of its plot, I'll tell you all about it. gene the main protagonist is under deep stress due to the fact that his disability isn't letting him convey true emotions, he tries to speak up but the antagonist, smiler, just tries to murder him. Yes, the main plot about the emoji movie is that some random dude is trying to murder some autistic child, deep shit. But since this is the emoji movie, it handles it with great care and admiration towards people with the disability. The other main character is jailbreak, she is a strong independent woman who don't need no man, and that's her whole character, then there's high five, he a funi funi fat cunt. Of course the expert comedy is perfect and it just works greatly with the perfect acting skills of TG Miller and sir Patrick Stewart. In conclusion the emoji move is secksy innit","displayName":"Stev s","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-04T12:04:03.000Z","updateDate":"2018-06-04T12:08:40.000Z","user":{"userId":"977305986","realm":"RT","displayName":"Stev s","accountLink":"/user/id/977305986"},"score":5,"timeFromCreation":"Jun 04, 2018"},{"rating":"STAR_0_5","review":"If I was God, and I heard this product was not only being made, not only being promoted, but actually released, then I would invite Satan over to manage the heavens so I could personally eradicate my failure below. This is the sort of product - because this is not truly a movie, as the word \"movie\" is too suggestive of art - that corporations fawn over. And they did. Believe it or not, three major production studios *fought* to make this happen. \n\nOf course, they wouldn't spend too much: Minions, a product almost as artless as this one, cost $74 million and runs for 91 minutes. In comparison, The Emoji Movie cost $50 mil and runs for 86 minutes. A 91-minute-long Emoji Movie would cost a mere $52.91 million; Sony cares less than the company that brought us screaming yellow screen- fever. They threw as little as they could at it.\n\nBut that's just the math. In order to fully appreciate how apocalyptic this wretched insult to all things sincere is, consider the following; You, the assumed person seeking entertainment, go to the movie theater expecting to take a break or have fun. And while the blatant advertising (Dropbox(TM) is an important plot point, there's a pointless scene with Just Dance, apps all around etc.) and banality may be entertainingly laughable, the very same slithery gargoyles that gave you this product get the money. They count their cash, and they think \"Hey, that worked.\" \n\nSo they give you more of the same thing. And more of it. And more, until the idiocy is familiar and the ads the norm. It's already happened to music, with the same notes and lyrics repeated over and over again. Here we have the same situation staring us down, except instead of ass and cash the contents are something else they're trying to sell you. \n\nThe Emoji Movie is an ad that you pay to see. Of course product placement already exists in film. The Lego Movie and Toy Story both feature products as characters, but those films had heart and personality. Here, there is nothing but product placement. Anything resembling humanity is just padding for the next app to appear. How vile for a product that constantly tells you to \"express yourself.\"\n\nDo not watch this thing. Don't bring your kids to see it. Don't watch it ironically. Whatever your beliefs, biases, intentions, anything, do not give companies the thumbs up to feed us mediocre, heartless drivel.","displayName":"infinitywarisawesome i","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-03T08:34:54.000Z","updateDate":"2018-06-03T08:40:04.000Z","user":{"userId":"977304350","realm":"RT","displayName":"infinitywarisawesome i","accountLink":"/user/id/977304350"},"score":0.5,"timeFromCreation":"Jun 03, 2018"},{"rating":"STAR_5","review":"great movie i'd suggest watching it many times.","displayName":"chase n","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-01T21:52:04.000Z","updateDate":"2018-06-01T21:57:36.000Z","user":{"userId":"977302328","realm":"RT","displayName":"chase n","accountLink":"/user/id/977302328"},"score":5,"timeFromCreation":"Jun 01, 2018"},{"rating":"STAR_0_5","review":"trash movie. Do not see ","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-01T14:10:36.770Z","updateDate":"2018-06-01T14:11:03.556Z","user":{"userId":"976475778","realm":"RT","displayName":null,"accountLink":"/user/id/976475778"},"score":0.5,"timeFromCreation":"Jun 01, 2018"},{"rating":"STAR_0_5","review":"Who thought this was a good idea?????","displayName":"benji D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-06-01T10:51:36.000Z","updateDate":"2018-06-01T10:52:28.000Z","user":{"userId":"977301682","realm":"RT","displayName":"benji D","accountLink":"/user/id/977301682"},"score":0.5,"timeFromCreation":"Jun 01, 2018"},{"rating":"STAR_1","review":"This movie had amazing depth which foreshadowed what's to come for meh and his friends.","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-31T23:36:19.327Z","updateDate":"2018-05-31T23:36:19.327Z","user":{"userId":"260120531","realm":"RT","displayName":null,"accountLink":"/user/id/260120531"},"score":1,"timeFromCreation":"May 31, 2018"},{"rating":"STAR_1","review":"This movie is the most generic and cliché animated movie. Do not watch it.","displayName":"Kyle M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-31T22:20:49.000Z","updateDate":"2018-05-31T22:22:20.000Z","user":{"userId":"977261078","realm":"RT","displayName":"Kyle M","accountLink":"/user/id/977261078"},"score":1,"timeFromCreation":"May 31, 2018"},{"rating":"STAR_5","review":"The Emoji Movie is overflowing with life, rich with all the grand emotions and vital juices of existence, up to and including blood.\nThe Emoji Movie is a desolate, fast, funny, advertiser friendly film, and it takes more risks than any recent film. It is set in the anonymous suburbs of Textopilis.\nThe film is already a huge success every where. It is based on the novel called  The Emoji Book by James Corden, and is the work of the producer-director-writer team  that made Hotel  Transelveinia 3. It has its sentimental moments, but it is funny as well as intense, and creates a world that's hard to forget. The film streamlines the novel, but it is never sentimental.\n\nThe movie recounts a series of inconclusive adventures, but centers them on Gene. He is an emoji who finds himself not fitting in as he has more than one emotion.  Fortunately he has the help from his good friends High five and Jailbreak.\nWhat holds the film together, though, is not Gene's emotion or character or dilemma, or even the episodic story line, but the powerful sense of an emoji.\nThe structure itself is ingenious. The film is narrated by T.G. Miller or \"Gene\"  a young emoji who is trying to find his purpose as an emoji. \n\nArtistically constructed, and featuring a bravura performance from Sir Patrick Stewart as the poo emoji, The Emoji Movie's craftily balances both a funny and charming tone all together.\nThis extraordinary movie goes to great lengths to show us the true meaning of fitting in.\nThank you...\n                    -Jasonsfilms","displayName":"Jason M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-31T16:02:44.000Z","updateDate":"2018-05-31T16:35:17.000Z","user":{"userId":"977300624","realm":"RT","displayName":"Jason M","accountLink":"/user/id/977300624"},"score":5,"timeFromCreation":"May 31, 2018"},{"rating":"STAR_0_5","review":"1/10 not enough eggplant emoji #bestcharacter #freeeggplant2k18","displayName":"Jikke P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-31T03:01:25.000Z","updateDate":"2018-05-31T03:01:49.000Z","user":{"userId":"977062665","realm":"RT","displayName":"Jikke P","accountLink":"/user/id/977062665"},"score":0.5,"timeFromCreation":"May 31, 2018"},{"rating":"STAR_0_5","review":"wow just wow i thougt that you can do better pixar","displayName":"Raden R","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2018-05-30T20:01:26.000Z","updateDate":"2018-05-30T20:02:20.000Z","user":{"userId":"977299508","realm":"RT","displayName":"Raden R","accountLink":"/user/id/977299508"},"score":0.5,"timeFromCreation":"May 30, 2018"}]}