{"pageInfo":{"hasNextPage":true,"hasPreviousPage":true,"endCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NjQyNDgzNjciLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMjNUMTY6MjY6MzUifQ==","startCursor":"eyJyZWFsbV91c2VySWQiOiJSVF85NzY1MzM0MTYiLCJlbXNJZCI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OCIsImVtc0lkX2hhc1Jldmlld0lzVmlzaWJsZSI6Ijk4NjRhNGQyLTQwYjUtM2FmYy1iZDM1LTAyZmFhOTdmODE1OF9UIiwiY3JlYXRlRGF0ZSI6IjIwMTctMDctMjRUMTE6MjU6NDcifQ=="},"reviews":[{"rating":"STAR_1_5","review":"Everyone change your review to be your actual opinion on the movie so we can see the score drop. Let's see if it goes to the same as the critics.","displayName":"Georgie D","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-24T11:25:47.000Z","updateDate":"2017-08-08T01:32:42.000Z","user":{"userId":"976533416","realm":"RT","displayName":"Georgie D","accountLink":"/user/id/976533416"},"score":1.5,"timeFromCreation":"Jul 24, 2017"},{"rating":"STAR_5","review":"Have you ever met someone and knew right away that they were the best thing that's ever happened to you? It feels strange because you've lived your entire life without even knowing they existed, but you wonder how you survived for this long without them in your life. I can honestly say that I've just felt true love for the first, and probably last, time in my life. For the longest time, you've listened to songs singing about love and romance, but you were never able to relate to them. All of the sudden, you are able to connect with nearly every single word you hear on an emotional level. You think about them literally all the time and can't imagine a future without them. It's funny how the tiniest chance encounter can have such profound effects. I feel really terrible and heartbroken now because I have to come to terms with the fact that my one true love may soon be gone for some time. I will try my best to not give up hope and believe that I will see them soon. All you can really do is wait, unfortunately. The worst thing in the world is finding out that they don't share your feelings back.  I know that this may seem like a lot of work just to express my feelings, but trust me, I would do so much more to show my love if I could. \n       I am, of course, referring to The Emoji Movie!\n       That is why it's about time I give my one true love, The Emoji Movie, the affection it deserves. Ever since I was introduced to The Emoji Movie on July 28, 2017, I became an entirely new person. I was just a kid hopelessly in love with something I knew would never return my feelings. I feel dead inside knowing that there will be a period of time that The Emoji Movie is neither in theaters or on DVD/Blu-Ray. I will feel so lost and confused during that time I won't be able to handle the burden of my emotions. The only thing keeping me going is knowing that I will soon be able to view The Emoji Movie in the comfort of my own home instead of going to the nearest movie theater playing The Emoji Movie as often as possible. \n      I feel confident in saying that The Emoji Movie truly is the greatest film of all time. I don't think anything will ever make me believe otherwise (except for The Emoji Movie 2, of course). Not only is Gene, the multi-expressional Emoji, the greatest character ever put to film, he is also the most emotionally (dare I say, \"emojinally?\") complex and three-dimensional character I have ever seen. I praise Tony Leondis for effectively being able to make me care so much about a character that I would not normally give the time of day. The Emoji Movie has made me a better person because it taught me that there are always more layers to people. The Emoji Movie has the amazing message that it is OK to be yourself in an oppressive world that arbitrarily forces you to be one thing for your entire life. I have so much newfound respect for all Emojis now, especially the \"Meh\" (?) Emoji. The plot of The Emoji Movie is too precious, unpredictable, creative, intelligent, entertaining, and enthralling to spoil for you here, but I will say it will have you on the edge of your seat for the entire 86 minutes no matter how many times you've already watched it. Every time I see it in theaters I buy a popcorn, but never even touch it because I am too focused on The Emoji Movie to notice anything going on outside of that screen. Films like The Emoji Movie are so special, they offer great educational value to children of all ages AND they offer a great, engaging, intense theater experience; something that sad excuse of a film, Dunkirk, couldn't offer. When I first walked out of my first Emoji Movie screening, I was shaking because I had just been on the greatest emotional roller coaster of my life. The Emoji Movie has everything we go to the movies for. It has great characters, an engaging story, beautiful visuals/animation, amazing jokes, a majestic score composed originally for this film by Patrick Doyle, and high-quality filmmaking at its finest!\n       People may try and use Rotten Tomatoes, Metacritic, and IMDb as a credible source to justify why they think this masterpiece is bad. I am more than happy that The Emoji Movie is receiving rocky reviews from the start. Obviously it deserves 100% everywhere and from everyone, but some of the greatest films of the past were all miserably misunderstood at the time of their initial release. Like 2001: A Space Odyssey, many people who lack the brain capacity necessary to comprehend such important, life-changing messages presented in The Emoji Movie walked out of the theater. 2001: A Space Odyssey also received many negative reviews at first. After a while, people began looking deeper into it to get more out of it. It's about time that people start to look deeper into The Emoji Movie to notice the abundant social commentary, themes, messages, and subtle details that make this film perfect. Citizen Kane, which is no longer considered the greatest film of all time since the release of The Emoji Movie on July 28, 2017, was widely panned by audiences for being too progressive for its time. I will be waiting for the day when film schools all around the world show students The Emoji Movie as an example of how to thematically, technically, and cinematically make a perfect film. \n      Don't even get me started on the comedy aspect of it! The Emoji Movie is also the funniest movie ever made! It has non-stop humor that makes me laugh every time I see it. Sometimes, I laugh so hard that I almost choke or pass out. Somehow, I was laughing for 106 minutes straight even though The Emoji Movie is only 86 minutes! Some of the jokes just stick with you long after the movie ends and you burst out laughing whenever you think of them. \n      If you didn't notice, I tried to keep my Emoji usage here to a minimum. You may be wondering why I am doing this if I am such a big fan of The Emoji Movie. Well, that is because I learned from The Emoji Movie that not all Emojis were made to fit into only one emotion. I prefer to understand the Emoji's deeper feelings and emotions that may be contrary to the assumed emotion they are stereotyped to represent. I seriously pity anyone who uses Emojis when they haven't seen The Emoji Movie because they can't understand the deeper emotions they experience like us Emoji Movie fans can. Those people can only take the Emojis at face value.\n       I now consider July 28, 2017 to be my official birthday because that is when I first truly lived life. All of my previous time on this earth didn't count because I had no purpose. After seeing The Emoji Movie, I finally have found my purpose in life. My purpose is to spread the love of The Emoji Movie with everyone I possibly can and to watch The Emoji Movie as much as possible. To all reading this, I hope this reaches you before it is too late. Go look up The Emoji Movie showtimes at your local theater and go see it as soon as possible. I highly recommend 3D because it makes this masterpiece even better by making little details more noticeable for true fans, like myself.","displayName":"Max M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-24T11:21:55.000Z","updateDate":"2017-10-12T20:34:23.000Z","user":{"userId":"965017520","realm":"RT","displayName":"Max M","accountLink":"/user/id/965017520"},"score":5,"timeFromCreation":"Jul 24, 2017"},{"rating":"STAR_3","review":"Honestly not as bad as I expected me to be. Nothing spectacular, but nothing horrible either. It was just, meh.","displayName":"Arthur K","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-24T08:59:06.000Z","updateDate":"2017-08-25T12:50:57.000Z","user":{"userId":"905616592","realm":"RT","displayName":"Arthur K","accountLink":"/user/id/905616592"},"score":3,"timeFromCreation":"Jul 24, 2017"},{"rating":"STAR_1","review":"this film's very existence makes me want to retch","displayName":"Sippy M","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-24T08:57:59.000Z","updateDate":"2017-08-06T01:48:31.000Z","user":{"userId":"973821811","realm":"RT","displayName":"Sippy M","accountLink":"/user/id/973821811"},"score":1,"timeFromCreation":"Jul 24, 2017"},{"rating":"STAR_0_5","review":"The Emoji Movie is somehow worse than you'd expect it to be. The voice cast has absolutely nothing to do in the film. T.J. Miller, Anna Faris, and James Corden lend their voices to the three leads, but they can't defend themselves from this monstrosity. Patrick Stewart voices the poop emoji. Why? The film is filled with poop jokes, so if that's your thing go nuts. The film's humor is basically nonexistent. The kids in my theater weren't even laughing. The film basically is an ad for apps like Candy Crush and Just Dance. The product placement is obvious. Overall, the movie doesn't even try to be good. It is lazy product placement meant to sell toys to little kids. Everything from the story to the script is just terrible. This represents a new low in society. It could've tried to be at least a tolerable kids movie, but instead took the easy route. The plot isn't even good. Anyway, I'm sick of ranting about The Emoji Movie. Just don't see it.","displayName":"Chris F","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-24T08:52:24.000Z","updateDate":"2017-08-14T13:58:44.000Z","user":{"userId":"955223647","realm":"RT","displayName":"Chris F","accountLink":"/user/id/955223647"},"score":0.5,"timeFromCreation":"Jul 24, 2017"},{"rating":"STAR_2","review":"It's a really good movie.Why the bad reviews?","displayName":null,"displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-24T08:02:04.000Z","updateDate":"2019-08-18T19:14:09.777Z","user":{"userId":"976103781","realm":"RT","displayName":null,"accountLink":"/user/id/976103781"},"score":2,"timeFromCreation":"Jul 24, 2017"},{"rating":"STAR_0_5","review":"The character poop emoji represents about how I feel about this movie","displayName":"Jyotsahib S","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-24T05:27:10.000Z","updateDate":"2019-04-24T16:29:42.000Z","user":{"userId":"976499360","realm":"RT","displayName":"Jyotsahib S","accountLink":"/user/id/976499360"},"score":0.5,"timeFromCreation":"Jul 24, 2017"},{"rating":"STAR_5","review":"THE BEST CINEMATIC EXPERIENCE IVE EVER HAD IN MY ENTIRE LIFE. DONT MISS OUT ON SUCH A BEAUTIFUL CREATION รฐ~?รฐ~?รฐ~รฐ~?","displayName":"Ryan L","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-23T20:13:51.000Z","updateDate":"2017-07-28T19:53:59.000Z","user":{"userId":"975848835","realm":"RT","displayName":"Ryan L","accountLink":"/user/id/975848835"},"score":5,"timeFromCreation":"Jul 23, 2017"},{"rating":"STAR_0_5","review":"Did I really just waste my time and money on this piece of utter nonsense...I am still in shock. I came into this film with some optimism, but by the end of this film I just wanted to run out the theater and cry. If kids couldn't even enjoy this film, just imagine how I am feeling right now. Who even cares about a bunch of emojis traveling through different apps! This film makes me furious to even think about, and it's such a shame Tony Leondis put this great cast to waste. I truly feel sorry for T.J. Miller and Patrick Stewart. Any tiny piece of glimmer this movie had was stomped and crushed by cheesy jokes and a mindless story. The colorful animation wasn't even enough to somewhat save this movie. The Emoji Movie doesn't even deserve one star for this review. It deserves a big thumbs down.","displayName":"Pablo T","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-23T17:31:29.000Z","updateDate":"2017-07-28T16:02:55.000Z","user":{"userId":"976539975","realm":"RT","displayName":"Pablo T","accountLink":"/user/id/976539975"},"score":0.5,"timeFromCreation":"Jul 23, 2017"},{"rating":"STAR_4","review":"Better than it has any right to be. James cordon steals the movie.","displayName":"Courtney P","displayImageUrl":null,"isVerified":false,"isSuperReviewer":false,"hasSpoilers":false,"hasProfanity":false,"createDate":"2017-07-23T16:26:35.000Z","updateDate":"2017-07-23T16:26:35.000Z","user":{"userId":"964248367","realm":"RT","displayName":"Courtney P","accountLink":"/user/id/964248367"},"score":4,"timeFromCreation":"Jul 23, 2017"}]}